import type { TestData } from "@/types";

export const chapter7Test: TestData = {
  chapterId: "chapter-7",
  chapterTitle: "ટેસ્ટ 7",
  totalQuestions: 40,
  questions: [
    {
      id: 1,
      question: "આબોહવા બાબતે નીચેના વિધાનો ધ્યાને લો.\n1) આબોહવા એ ટૂંકા સમયગાળાની પરિસ્થિતિ છે.\n2) હવામાન એ વાતાવરણની લાંબાગાળાની પરિસ્થિતિ છે.\nઉપરોક્ત પૈકી સાચા વિધાન જણાવો.",
      options: [
        "ફક્ત 1",
        "ફક્ત 2",
        "બંને",
        "એકપણ નહી"
      ],
      correctAnswer: 3,
      explanation: "",
      },
    {
      id: 2,
      question: "નીચે આપેલા દેશો પૈકી કયા દેશો મોસમી આબોહવા ધરાવતા દેશો છે?\n1) અમેરિકા\n2) ભારત\n3) શ્રીલંકા\n4) બાંગ્લાદેશ\n5) પાકિસ્તાન\n6) મ્યાનમાર",
      options: [
        "ફક્ત 1, 2, 4, 5 અને 6",
        "ફક્ત 2, 3, 4 અને 5",
        "ફક્ત 2, 3, 4, 5 અને 6",
        "ફક્ત 1, 4 અને 6"
      ],
      correctAnswer: 2,
      explanation: ""
    },
    {
      id: 3,
      question: "નીચેના વિધાનો ધ્યાને લો.\n1) પૃથ્વીની ધરી 23.5 0 નમેલી છે. અને કક્ષાની સાથે 66.50 નો ખૂણો બનાવે છે.\n2) 22 ડિસેમ્બરે સૂર્યના કિરણો મકરવૃત્ત પર લંબ પડે છે.\n3) 21 જૂને કર્કવૃત્ત તરફ સૂર્યના કિરણો લંબ ઉત્તર ગોળાર્ધમાં પડતા હોવાથી દિવસ લાંબો બને છે.\nઉપરોક્ત પૈકી સાચા વિધાન જણાવો.",
      options: [
        "ફક્ત 1 અને 3",
        "ફક્ત 2 અને 3",
        "ફક્ત 1 અને 2",
        "આપેલ તમામ"
      ],
      correctAnswer: 3,
      explanation: ""
    },
    {
      id: 4,
      question: "સામાન્ય પરિસ્થિતિમાં પૃથ્વીની સપાટીથી કેટલા મીટર ઊંચે જતા 10°C તાપમાન ઘટે છે?",
      options: [
        "210",
        "195",
        "145",
        "165"
      ],
      correctAnswer: 3,
      explanation: "",
      },
    {
      id: 5,
      question: "આબોહવા બાબતે નીચેના વિધાનો ધ્યાને લો.\n1) ભારતના પશ્ચિમ ભારતમાં આવેલ ચેરાપુંજીમાં દુનિયાનો 1200 સેમી વરસાદ વરસે છે.\n2) પૃથ્વી સપાટી પર આબોહવાના પ્રકાર જે -તે પ્રદેશોના રેખાંશ પ્રમાણે બદલાય છે.\nઉપરોક્ત પૈકી સાચા વિધાન જણાવો.",
      options: [
        "ફક્ત 1",
        "ફક્ત 2",
        "બંને",
        "એકપણ નહિ"
      ],
      correctAnswer: 3,
      explanation: "",
      },
    {
      id: 6,
      question: "આબોહવા બાબતે નીચેના વિધાનો ધ્યાને લો.\n1) આબોહવામાં તત્વોનું વિતરણ મોટા ભાગે અક્ષાંશોને અનુસરે છે.\n2) બે ક્રમિક અક્ષાંશો વચ્ચે 111 કિ.મી.નું અંતર હોય છે.\n3) વિષુવવૃત્તની આસપાસના પ્રદેશ પર સૂર્યના કિરણો પડતા હોય છે.\nઉપરોકત પૈકી સાચા વિધાન જણાવો.",
      options: [
        "ફક્ત 1 અને 3",
        "ફક્ત 2 અને 3",
        "ફક્ત 3",
        "આપેલ તમામ"
      ],
      correctAnswer: 3,
      explanation: ""
    },
    {
      id: 7,
      question: "ભારતમાં હવામાન ખાતાની મુખ્ય કચેરી કયા શહેરમાં આવેલી છે?",
      options: [
        "દિલ્હી",
        "પૂણે",
        "મુંબઈ",
        "દહેરાદૂન"
      ],
      correctAnswer: 0,
      explanation: ""
    },
    {
      id: 8,
      question: "આબોહવા બાબતે નીચેના વિધાનો ધ્યાને લો.\n1) ભેજવાળી હવા ઊંચે ચડતા ઠંડી બને છે અને વરસાદ આપે છે.\n2) સામાન્ય પરિસ્થિતિમાં પૃથ્વી સપાટીથી ઊંચે તરફ જતાં 165 મીટરે 10°C તાપમાન વધે છે.\n3) પૃથ્વીની સપાટીએ ઊંચે જતા 1000 મીટરે 6.50 તાપમાન વધે છે.\nઉપરોક્ત પૈકી ખોટા વિધાન જણાવો.",
      options: [
        "ફક્ત 1 અને 2",
        "ફક્ત 2 અને 3",
        "ફક્ત 1 અને 3",
        "આપેલ તમામ"
      ],
      correctAnswer: 1,
      explanation: "",
      },
    {
      id: 9,
      question: "22 ડિસેમ્બરે સૂર્યના કિરણો કયા વૃત્ત પર લંબ પડે છે?",
      options: [
        "વિષુવવૃત્ત પર",
        "મકરવૃત્ત પર",
        "કર્કવૃત્ત પર",
        "દક્ષિણ ધ્રુવ વૃત્ત પર"
      ],
      correctAnswer: 1,
      explanation: ""
    },
    {
      id: 10,
      question: "ભારતમાં વાતાવરણીય દબાણ અને પવનો બાબતે નીચેના વિધાનો ધ્યાને લો.\n1) શીતઋતુ - શિયાળો - જુનથી સપ્ટેમ્બર\n2) ઉષ્ણઋતુ - ઉનાળો - ડિસેમ્બરથી ફેબ્રુઆરી\n3) વર્ષા ઋતુ – માર્ચથી મે\nઉપરોક્ત પૈકી સાચી જોડ પસંદ કરો.",
      options: [
        "ફક્ત 1",
        "ફક્ત 2",
        "ફક્ત 3",
        "એકપણ નહિ"
      ],
      correctAnswer: 3,
      explanation: "",
      },
    {
      id: 11,
      question: "વાતાવરણીય દબાણ બાબતે નીચેના વિધાનો ધ્યાને લો.\n1) ભારત ઉત્તર-પૂર્વી વ્યાપારિક પવનોવાળા ક્ષેત્રમાં આવેલ છે.\n2) ભારત ઉત્તર-પૂર્વી વ્યાપારિક પવનો ઉત્તર ગોળાર્ધના ઉષ્ણ કટિબંધીય ગુરુદાબપટના ભારે દબાણ પટાઓ દ્વારા સર્જાય છે.\n3) ભારતના ઉત્તર-પૂર્વીય પવનોને વ્યાપારી પવનો કહે છે.\nઉપરોક્ત પૈકી સાચા વિધાનો જણાવો.",
      options: [
        "ફક્ત 1 અને 3",
        "ફક્ત 2 અને 3",
        "ફક્ત 1 અને 2",
        "આપેલ તમામ"
      ],
      correctAnswer: 3,
      explanation: ""
    },
    {
      id: 12,
      question: "બંને ગોળાર્ધમાં આશરે 300 અક્ષાંશની આસપાસ 8 થી 15 કિમીની ઊંચાઈના વાતાવરણના સર્પાકાર પટ્ટામાં અત્યંત વેગીલા પવનોને શું કહેવામાં આવે છે?",
      options: [
        "પશ્ચિમી વિક્ષોભ",
        "જેટ સ્ટ્રીમ",
        "ઓર્વેસ્ટર",
        "આઈ. ટી.સી. ઝોન"
      ],
      correctAnswer: 1,
      explanation: ""
    },
    {
      id: 13,
      question: "ભારતમાં ગારો, ખાસી અને જૈન્તિયા નામની ટેકરીઓ કયાં રાજ્યમાં આવેલ છે?",
      options: [
        "મણિપુર",
        "મેઘાલય",
        "નાગાલેન્ડ",
        "અરૂણાચલ પ્રદેશ"
      ],
      correctAnswer: 1,
      explanation: ""
    },
    {
      id: 14,
      question: "મે માસમાં મલબાર કિનારે થતો થોડો વરસાદ કયા નામે ઓળખાય છે?",
      options: [
        "અનાર વર્ષા",
        "બનાના વર્ષા",
        "આમ્ર વર્ષા",
        "હિમ વર્ષા"
      ],
      correctAnswer: 2,
      explanation: ""
    },
    {
      id: 15,
      question: "વ્યાપારી પવનો જ્યાં ભેગા થાય છે. ત્યાં વિષુવવૃત્ત ઉપર વિશાળ હવાનું દબાણ ક્ષેત્ર રચાય છે તે આંતર ઉષ્ણ કટિબંધીય .............કહે છે.",
      options: [
        "અલનીનો",
        "આઈ.ટી.સી.ઝોન",
        "નોર્વેસ્ટર",
        "લૂ"
      ],
      correctAnswer: 1,
      explanation: ""
    },
    {
      id: 16,
      question: "ભારતીય વન્યજીવન બાબતે નીચેના વિધાનો પૈકી સાચા વિધાન જણાવો.\n1) ભારતમાં 81251 જીવસૃષ્ટિ જોવા મળે છે.\n2) ભારત સમૃદ્ધ બૃહદ જૈવ વૈવિધ્ય ધરાવતા આઠ દેશોમાં છઠ્ઠા ક્રમે છે.",
      options: [
        "ફક્ત 1",
        "ફક્ત 2",
        "બંને",
        "એકપણ નહિ"
      ],
      correctAnswer: 2,
      explanation: ""
    },
    {
      id: 17,
      question: "વૈવિધ્યસભર વન્ય જીવ સૃષ્ટિ બાબતે પ્રદેશમાં જોવા મળતી પ્રજાતિ બાબતે નીચેના કઈ જોડ સાચી છે.\n1) જમ્મુ-કશ્મીરમાં – જંગલી બકરી\n2) જમ્મુ-કાશ્મીર – કસ્તુરી મૃગ\n3) દક્ષિણ ભારતના જંગલોમાં – ભારતીય બાયસન\n4) મધ્યભારત અને પ.બંગાળમાં -વાઘ",
      options: [
        "ફક્ત 1, 2 અને 4",
        "ફક્ત 2, 3 અને 4",
        "ફક્ત 1, 3 અને 4",
        "આપેલ તમામ"
      ],
      correctAnswer: 3,
      explanation: ""
    },
    {
      id: 18,
      question: "વન્યજીવ સૃષ્ટિની વિવિધતા બાબતે નીચેના વિધાનો પૈકી સાચા વિધાન જણાવો.\n1) કચ્છના નાના રણમાં સુરખાબ જોવા મળે છે.\n2) કચ્છના મોટા રણમાં ઘોરાડ જોવા મળે છે.",
      options: [
        "ફક્ત 1",
        "ફક્ત 2",
        "બંને",
        "એકપણ નહિ"
      ],
      correctAnswer: 3,
      explanation: "",
      },
    {
      id: 19,
      question: "ભારતના કયા વિસ્તારમાં ઊડતી ખિસકોલી જોવા મળે છે?",
      options: [
        "કચ્છના મોટા રણમાં",
        "હિમાલયના ઊંચા પર્વતીય વિસ્તારોમાં",
        "દલદલના વિસ્તારોમાં",
        "પશ્ચિમઘાટના ગીચ જંગલોમાં"
      ],
      correctAnswer: 3,
      explanation: ""
    },
    {
      id: 20,
      question: "ભારતના અગત્યના રાષ્ટ્રીય ઉદ્યાનો અને અભ્યારણો બાબત પૈકી સાચી જોડ પસંદ કરો.\n1) કાઝીરંગા – અરૂણાચલપ્રદેશ\n2) કાન્હા – મધ્યપ્રદેશ\n3) કેવલાદેવ – ઉત્તરપ્રદેશ",
      options: [
        "ફક્ત 1 અને 3",
        "ફક્ત 2 અને 3",
        "ફક્ત 2",
        "આપેલ તમામ"
      ],
      correctAnswer: 2,
      explanation: "",
      },
    {
      id: 21,
      question: "ભારતના અગત્યના રાષ્ટ્રીય અભ્યારણો પૈકી નીચેનામાંથી કયા/ કયું વિધાન સાચા છે?\n1) જીમ કોર્બટ – જમ્મુ કાશ્મીર\n2) દચિગામ – ઉત્તરાખંડ\n3) બાંદીપુર – તમિલનાડુ",
      options: [
        "ફક્ત 1 અને 2",
        "ફક્ત 2 અને 3",
        "ફક્ત 2",
        "એકપણ નહિ"
      ],
      correctAnswer: 3,
      explanation: "",
      },
    {
      id: 22,
      question: "ઉત્તરથી શરૂ કરી દક્ષિણ તરફ આવેલા રાષ્ટ્રીય ઉદ્યાનોનો સાચો ક્રમ કયો છે?",
      options: [
        "રણથંભોર, બાંદીપુર, દચિગામ, કાન્હા",
        "કાન્હા, દચિગામ, બાંદીપુર, રણથંભોર",
        "દચિગામ, કાન્હા, બાંદીપુર, રણથંભોર",
        "દચિગામ, રણથંભોર, કાન્હા, બાંદીપુર"
      ],
      correctAnswer: 3,
      explanation: ""
    },
    {
      id: 23,
      question: "પર્યાવરણ બાબતે નીચેના વિધાનો પૈકી સાચા વિધાન જણાવો.\n1) ભારતમાં જોવા મળતુ દક્ષિણનું બર્ડવીંગ સૌથી નાનું પતંગિયુ છે.\n2) ભારતમાં જોવા મળતુ સીરસ જેવેલ સૌથી મોટુ પતંગિયુ છે.",
      options: [
        "ફક્ત 1",
        "ફક્ત 2",
        "બંને",
        "એકપણ નહિ"
      ],
      correctAnswer: 3,
      explanation: "",
      },
    {
      id: 24,
      question: "ભારતીય વન્યજીવ સૃષ્ટિ વિશે નીચેના વિધાનો પૈકી કયુ/ કયા વિધાન સાચા છે?\n1) સારસ ભારતમાં જોવા મળતું સૌથી નાનું પક્ષી છે.\n2) ફૂલ સુંઘણો એ ભારતમાં જોવા મળતું સૌથી મોટું પક્ષી છે.",
      options: [
        "ફક્ત 1",
        "ફક્ત 2",
        "બંને",
        "એકપણ નહિ"
      ],
      correctAnswer: 3,
      explanation: "",
      },
    {
      id: 25,
      question: "નીચેના વિધાનો સાચા વિધાન જણાવો.\n1) ગીર રાષ્ટ્રીય ઉદ્યાન - સિંહ, દીપડા, ચિતલ જોવા મળેલ છે.\n2) વેરાવદર કાળીયાર રાષ્ટ્રીય ઉદ્યાન - કાળીયાર, વરુ, ખડમોર",
      options: [
        "ફક્ત 1",
        "ફક્ત 2",
        "બંને",
        "એકપણ નહિ"
      ],
      correctAnswer: 2,
      explanation: ""
    },
    {
      id: 26,
      question: "ગુજરાતના રાષ્ટ્રીય ઉદ્યાન પૈકી ખોટી જોડ જણાવો\n1) ગીર રાષ્ટ્રીય ઉદ્યાન – સ્થાપના – 1975\n2) કાળીયાર રાષ્ટ્રીય ઉદ્યાન – સ્થાપના – 1975\n3) વાંસદા રાષ્ટ્રીય ઉદ્યાન – સ્થાપના - 1979\n4) દરિયાઇ રાષ્ટ્રીય ઉદ્યાન – સ્થાપના - 1982",
      options: [
        "ફક્ત 1",
        "ફક્ત 2",
        "ફક્ત 3",
        "ફક્ત 4"
      ],
      correctAnswer: 1,
      explanation: "",
      },
    {
      id: 27,
      question: "નીચેના વિધાનો પૈકી સાચા વિધાન જણાવો.\n1) કોઈ પણ પ્રદેશમાં મળતો સૂર્યપ્રકાશ તે પ્રદેશના અક્ષાંશ અને તેની ઊંચાઈ પર આધાર રાખે છે.\n2) ભારતમાં લગભગ 5000 જાતના વૃક્ષો થાય છે.\n3) ભારતમાં 15000 પ્રકારના ફુલવાળા છોડ થાય છે જે વિશ્વના 6% છે.",
      options: [
        "ફક્ત 1 અને 3",
        "ફક્ત 2 અને 3",
        "ફક્ત 3",
        "આપેલ તમામ"
      ],
      correctAnswer: 3,
      explanation: ""
    },
    {
      id: 28,
      question: "મહોગની, અબનૂસ, રોઝવુડ અને રબર જેવા વૃક્ષો - નીચેનામાંથી કેવા પ્રકારના જંગલોમાં જોવા મળે છે?",
      options: [
        "ઉષ્ણ કટિબંધીય ખરાઉ જંગલો",
        "ઉષ્ણ કટિબંધીય વરસાદી જંગલો",
        "ઉષ્ણ કટિબંધીય કાંટાળા જંગલો",
        "સમશીતોષ્ણ કટિબંધીય ઘાસના મેદાનો"
      ],
      correctAnswer: 1,
      explanation: ""
    },
    {
      id: 29,
      question: "નીચે આપેલા વિધાનોમાંથી કયું વિધાન અયોગ્ય છે?",
      options: [
        "ગંગા નદીના મુખત્રિકોણપ્રદેશમાં ભરતીનું જંગલ આવેલું છે.",
        "ચીડના રસમાંથી ટર્પેન્ટાઇન મળે છે.",
        "સુંદરીનું લાકડું હોડી બનાવવા માટે ઉપયોગમાં આવે છે.",
        "હિમાલયના પર્વતીય વિસ્તારોમાં કાંટાળી વનસ્પતિ થાય છે."
      ],
      correctAnswer: 3,
      explanation: "",
      },
    {
      id: 30,
      question: "ભારતના જંગલો વિશે નીચેના વિધાનો ધ્યાને લઈ જંગલનો પ્રકાર જણાવો\n1) આ જંગલોમાં ઝાંડી ઝાંખરાના કારણે ભેજનું પ્રમાણ વધુ હોય છે.\n2) આ જંગલોમાં પાનખર જેવી કોઈ ઋતુ હોતી નથી.\n3) આ જંગલો બારેમાસ નિત્ય લીલા રહેતા હોય છે.\n4) આ જંગલોમાં વૃક્ષો સામાન્ય રીતે 60 મીટર જેટલા ઊંચા હોય છે.",
      options: [
        "ઉષ્ણ કટિબંધીય કાંટાળા જંગલો",
        "ઉષ્ણ કટિબંધીય વરસાદી જંગલો",
        "ઉષ્ણ કટિબંધીય ખરાઉ જંગલો",
        "ભરતીના જંગલો"
      ],
      correctAnswer: 1,
      explanation: ""
    },
    {
      id: 31,
      question: "વનસ્પતિની ઉપયોગીતા બાબતે નીચેના વિધાનો પૈકી સાચું વિધાન પસંદ કરો.\n1) લોહીના ઊંચા દબાણના રોગની સારવારમાં સર્પગંધા વનસ્પતિ ઉપયોગી છે.\n2) જીવાણુ પ્રતિરોધક તરીકે લીમડો ઉપયોગી છે.\n3) શરદી, ઉધરસ, તાવ માટે તુલસી ઉપયોગી છે.",
      options: [
        "ફક્ત 1 અને 2",
        "ફક્ત 2 અને 3",
        "ફક્ત 1 અને 3",
        "આપેલ તમામ"
      ],
      correctAnswer: 3,
      explanation: ""
    },
    {
      id: 32,
      question: "શંકુદ્રુમ જંગલોના વૃક્ષોનો સાચો ક્રમ નીચેનામાંથી કયો છે?",
      options: [
        "પાઈન, દેવદાર, સિલ્વર, ફર, સ્પ્રુસ",
        "ખજૂર, બોરડી, બાવળ, ખીજડો",
        "સાગ, સાલ, સીસમ, ચંદન",
        "મહોગની, અબનૂસ, રોઝવૂડ, રબર"
      ],
      correctAnswer: 0,
      explanation: ""
    },
    {
      id: 33,
      question: "ભારત સરકારે નવી રાષ્ટ્રીય વન નીતિ ક્યારે જાહેર કરી હતી?",
      options: [
        "ઈ.સ. 1978માં",
        "ઈ.સ. 1988માં",
        "ઈ.સ. 1991માં",
        "ઈ.સ .2005માં"
      ],
      correctAnswer: 1,
      explanation: ""
    },
    {
      id: 34,
      question: "ભારતના કયા પ્રકારનાં જંગલોના વૃક્ષો 6 થી 8 અઠવાડિયા દરમિયાન પોતાના પાંદડાં ખેરવી નાખે છે?",
      options: [
        "ખરાઉ",
        "સમશીતોષ્ણ કટિબંધીય",
        "કાંટાળા",
        "વરસાદી"
      ],
      correctAnswer: 0,
      explanation: ""
    },
    {
      id: 35,
      question: "ભારતની રાષ્ટ્રીય વનનીતિ અનુસાર ભારતના કેટલા ટકા વિસ્તારમાં જંગલો હોવા જોઈએ?",
      options: [
        "33%",
        "23%",
        "41%",
        "50%"
      ],
      correctAnswer: 0,
      explanation: ""
    },
    {
      id: 36,
      question: "નીચેનામાંથી કયાં દિવસને વિશ્વ ઓઝોન દિવસ તરીકે મનાવવામાં આવે છે?",
      options: [
        "22 એપ્રિલ",
        "16 સપ્ટેમ્બર",
        "16 જુલાઈ",
        "21 માર્ચ"
      ],
      correctAnswer: 1,
      explanation: ""
    },
    {
      id: 37,
      question: "નીચેનામાંથી કઈ ઔષધીય વનસ્પતિના ઉપચારથી ચામડીના રોગ, દાંત-પેઢાના રોગ દુર કરી શકાય?",
      options: [
        "આમળા",
        "કરંજ",
        "હરડે",
        "ગળો"
      ],
      correctAnswer: 1,
      explanation: ""
    },
    {
      id: 38,
      question: "ઔષધીય વનસ્પતિની ઉપયોગિતા બાબતે નીચેના વિધાનો પૈકી કયું/કયાં વિધાન સાચા છે?\n1) હૃદયરોગની સારવાર માટે - અર્જુન સાદડ\n2) મધુપ્રમેહ, તાવ અને સાંધાના દુખાવા - ગળો\n3) વાળ અંગેના રોગોમાટે ઉપયોગી – આમળાં",
      options: [
        "ફક્ત 1 અને 2",
        "ફક્ત 2 અને 3",
        "ફક્ત 1 અને 3",
        "આપેલ તમામ"
      ],
      correctAnswer: 0,
      explanation: ""
    },
    {
      id: 39,
      question: "કયા દિવસને વિશ્વ વન દિવસ તરીકે ઉજવવામાં આવે છે?",
      options: [
        "21 માર્ચ",
        "22 એપ્રિલ",
        "5 જૂન",
        "16 સપ્ટેમ્બર"
      ],
      correctAnswer: 0,
      explanation: ""
    },
    {
      id: 40,
      question: "વિંધ્ય અને સાતપુડાના પર્વતોમાં કયા-પ્રકારના જંગલો જોવા મળે છે?",
      options: [
        "ખરાઉ",
        "વરસાદી",
        "કાંટાળા",
        "સમશીતોષ્ણ કટિબંધીય"
      ],
      correctAnswer: 0,
      explanation: ""
    }
  ]
};
