import type { TestData } from "@/types";

export const chapter18Test: TestData = {
  chapterId: "chapter-18",
  chapterTitle: "રીવાઇઝડ પેપર 2",
  totalQuestions: 100,
  questions: [
  {
    "id": 1,
    "question": "ભારતમાં આવનાર વિદેશી પ્રજા નેગ્રીટો વિશે નીચેના વિધાનો ધ્યાને લો.\n1. નેગ્રીટો અથવા નીગ્રો ભારતના સૌથી પ્રાચીન પ્રજા હતી.\n2. તેઓને હબસીઓ પણ કહેવામાં આવતું હતું.\n3. તેઓ આફ્રિકામાંથી થઇને બલુચિસ્તાનના રસ્તે થઇ ભારતમાં આવ્યા હતા.\nઉપરોક્ત પૈકી ખોટા વિધાન જણાવો.",
    "options": [
      "ફક્ત 1 અને 3",
      "ફક્ત 3",
      "ફક્ત 2 અને 3",
      "એકપણ નહિ"
    ],
    "correctAnswer": 3,
    "explanation": ""
  },
  {
    "id": 2,
    "question": "નીચેના વિધાનો ધ્યાને લો.\n1. પોળોના જંગલો – સાબરકાંઠા\n2. જૈન તીર્થ પાલીતાણા – ભાવનગર\n3. ઉત્તરાર્ધ મહોત્સવ – વડનગર\n4. કાંકરીયા કાર્નિવલ – અમદાવાદ\nઉપરોક્ત પૈકી સાચા વિધાન જણાવો.",
    "options": [
      "ફક્ત 1, 3 અને 4",
      "ફક્ત 2, 3 અને 4",
      "ફક્ત 1, 2 અને 4",
      "આપેલ તમામ"
    ],
    "correctAnswer": 2,
    "explanation": ""
  },
  {
    "id": 3,
    "question": "ભારતમાં આવનાર કઇ વિદેશી પ્રજાને મોહેં-જો-દડોની સિંધુ સંસ્કૃતિના સર્જકો અને પાષાણ યુગની સંસ્કૃતિના સીધા વારસદાર કહેવામાં આવે છે?",
    "options": [
      "નેગ્રીટો",
      "ઓસ્ટ્રેલૉઇડ",
      "દ્રવિડો",
      "મોંગોલોઇડ"
    ],
    "correctAnswer": 2,
    "explanation": ""
  },
  {
    "id": 4,
    "question": "પ્રાચીનકાળ દરમિયાન ભારતીય સંસ્કૃતિ કઈ બે નદીના કિનારે પોષણ પામી હતી એવું માની શકાય છે?",
    "options": [
      "યમુના અને ગંગા",
      "સિંધુ અને ગંગા",
      "સિંધુ અને રાવી",
      "યમુના અને રાવી"
    ],
    "correctAnswer": 2,
    "explanation": ""
  },
  {
    "id": 5,
    "question": "ગુજરાતના સાંસ્કૃતિક વારસાના સ્થળો બાબતે નીચેના વિધાનો ધ્યાને લો.\n1) લોથલ - ધોળકા તાલુકો\n2) ધોળાવીરા – કચ્છ જિલ્લો\n3) રોજડી અને શ્રીનાથગઢ – રાજકોટ\n4) લાખાબાવળ અને આમરા - ભાવનગર\nઉપરોક્ત સ્થળો પૈકી સાચી જોડ પૈકી કઈ/કયું જોડ સાચી છે?",
    "options": [
      "ફક્ત 1, 2 અને 4",
      "ફક્ત 1, 2 અને 3",
      "ફક્ત 1, 3 અને 4",
      "આપેલ તમામ"
    ],
    "correctAnswer": 1,
    "explanation": ""
  },
  {
    "id": 6,
    "question": "કયુ નૃત્ય સાગરના મોતી કે એ મોજા પર હિલોળા લેતા વહાણ જેવુ દ્રશ્ય ઉભું કરે છે?",
    "options": [
      "ગોફ ગુંથન",
      "ધમાલ",
      "મેરાયો",
      "પઢાર"
    ],
    "correctAnswer": 3,
    "explanation": ""
  },
  {
    "id": 7,
    "question": "વૈજયંતીમાલા અને હેમામાલિની કઈ નૃત્યશૈલી સાથે જોડાયેલ છે?",
    "options": [
      "મણિપુરી",
      "કૂચીપુડી",
      "કથકલી",
      "ભરતનાટ્યમ"
    ],
    "correctAnswer": 3,
    "explanation": ""
  },
  {
    "id": 8,
    "question": "નીચેના જોડકા જોડો.\n(1) આદિવાસીઓનું નૃત્ય - (a) મેરાયો નૃત્ય\n(2) સીદીઓનું નૃત્ય - (b) ચાળો નૃત્ય\n(3) બનાસકાંઠાના વાવ વિસ્તારનું નૃત્ય - (c) પઢારનૃત્ય\n(4) સુરેન્દ્રનગર વિસ્તારનું નૃત્ય - (d) ધમાલ નૃત્ય",
    "options": [
      "1-B, 2-D, 3-A, 4-C",
      "1-A, 2-B, 3-C, 4-D",
      "1-D, 2-C, 3-B, 4-A",
      "1-B, 2-D, 3-C, 4-A"
    ],
    "correctAnswer": 0,
    "explanation": ""
  },
  {
    "id": 9,
    "question": "ભારતમાં નૃત્યકલા બાબતે નીચેના વિધાનો ધ્યાને લો.\n(1) કેરળના શ્રી વલ્લથોળ, કલામંડલમ્ કૃષ્ણપ્રસાદ, શિવારમન એ કથકલી નૃત્યસાથે સંકળાયેલ છે.\n(2) બિરજુમહારાજ સિતારા દેવી અને કુમુદિની લાખિયા કથક નૃત્ય સાથે સંકળાયેલ છે.\nઉપરોક્ત પૈકી સાચા વિધાન જણાવો.",
    "options": [
      "ફક્ત 1",
      "ફક્ત 2",
      "બંને",
      "એકપણ નહિ"
    ],
    "correctAnswer": 2,
    "explanation": ""
  },
  {
    "id": 10,
    "question": "ગુજરાતના સાંસ્કૃતિક વારસાનાં સ્થળો બાબતે નીચેના વિધાનો ધ્યાને લો.\n1) સમ્રાટ અશોકનો શિલાલેખ જૂનાગઢમાં આવેલ છે.\n2) મોઢેરાનુ સૂર્યમંદિર ભીમદેવ-2 દ્વારા બાંધવામાં આવ્યું હતું.\nઉપરોક્ત પૈકી સાચા વિધાન જણાવો.",
    "options": [
      "ફક્ત 2",
      "ફક્ત 1",
      "ફક્ત 1 અને 2",
      "એકપણ નહિ"
    ],
    "correctAnswer": 1,
    "explanation": ""
  },
  {
    "id": 11,
    "question": "સ્તુપના અંડાકાર ભાગની ટોચની ચારે બાજુ આવેલી રેલિંગને શું કહે છે?",
    "options": [
      "મહેરાબ",
      "હર્મિકા",
      "મેધિ",
      "તોરણ"
    ],
    "correctAnswer": 1,
    "explanation": ""
  },
  {
    "id": 12,
    "question": "5 મી સદીમાં કયા ચીની પ્રવાસીએ તક્ષશિલા વિદ્યાપીઠની મુલાકાત લીધી હતી?",
    "options": [
      "હાન-શુઈએ",
      "યુઅન-શ્વાંગે",
      "ઈત્સિંગે",
      "ફાહિયાને"
    ],
    "correctAnswer": 3,
    "explanation": ""
  },
  {
    "id": 13,
    "question": "ભારતમાં કઈ વિદ્યાપીઠો પ્રસિદ્ધ વિદ્વાનોનાં નામ દરવાજા પર લખવામાં આવતા?",
    "options": [
      "વારાણસી",
      "નાલંદા",
      "વલભી",
      "તક્ષશિલા"
    ],
    "correctAnswer": 2,
    "explanation": ""
  },
  {
    "id": 14,
    "question": "પ્રાચીન ભારતીય કયાં સાહિત્યમાં બ્રહ્માંડનો આરંભ, જીવન, મૃત્યુ, ભૌતિક અને આધ્યાત્મિક જગત, જ્ઞાન પ્રકૃતિ અને બીજા અનેક દાર્શનિક પ્રશ્નોનું વિવેચન કરવામાં આવ્યું છે?",
    "options": [
      "ઋગ્વેદમાં",
      "સામવેદમાં",
      "ઉપનિષદમાં",
      "બ્રાહ્મણગ્રંથોમાં"
    ],
    "correctAnswer": 2,
    "explanation": ""
  },
  {
    "id": 15,
    "question": "કવિ ચંદબરદાઈનો કયો ગ્રંથ હિંદી સાહિત્યનો પ્રારંભિક ગ્રંથ છે?",
    "options": [
      "પૃથ્વીરાજરાસો",
      "વિક્રમાંકદેવચરિત",
      "કવિરાજમાર્ગ",
      "ચંદ્રાયન"
    ],
    "correctAnswer": 0,
    "explanation": ""
  },
  {
    "id": 16,
    "question": "નીચેના જોડકા જોડો.\n1) મલાવ તળાવ - (A) સિદ્ધપુર\n2) રુદ્ર મહાલય - (B) પાટણ\n3) સહસ્ત્રલિંગ તળાવ - (C) વડનગર\n4) કીર્તિતોરણ - (D) ધોળકા",
    "options": [
      "1-A, 2-B, 3-C, 4-D",
      "1-D, 2-A, 3-C, 4-B",
      "1-D, 2-C, 3-B, 4-A",
      "1-D, 2-A, 3-B, 4-C"
    ],
    "correctAnswer": 3,
    "explanation": ""
  },
  {
    "id": 17,
    "question": "સમ્રાટ અશોકના સમયમાં સ્તુપોમાં નીચેનામાંથી કોનો કોનો સમાવેશ થાય છે?\n1) સાંચીનો સ્તુપ 2) સારનાથનો સ્તુપ\n3) બેરતનો સ્તુપ 4) નંદનગઢનો સ્તુપ\n5) પુરુષપુરનો સ્તુપ 6) દેવની મોરીનો સ્તુપ",
    "options": [
      "ફક્ત 1, 2, 3, 5 અને 6",
      "ફક્ત 1, 3, 5 અને 6",
      "ફક્ત 1, 2, 3, 4 અને 6",
      "આપેલ તમામ"
    ],
    "correctAnswer": 2,
    "explanation": ""
  },
  {
    "id": 18,
    "question": "નીચેના વિધાનો ધ્યાને લો.\n1) ગુજરાતના પાલિતાણાના શેત્રુંજય પર્વત પર જૈન મંદિરો આવેલા છે.\n2) હઠીસિંહના દેરા - અમદાવાદમાં આવેલા છે.\nનીચેના વિધાનો સાચાં વિધાન શોધો.",
    "options": [
      "ફક્ત 1",
      "ફક્ત 2",
      "બંને",
      "એકપણ નહિ"
    ],
    "correctAnswer": 2,
    "explanation": ""
  },
  {
    "id": 19,
    "question": "મહાબલિપુરમ્ ના રથમંદિરો બાબતે નીચેના વિધાનો ધ્યાને લો.\n1) સૌથી મોટું રથમંદિર ધર્મરાજનું છે.\n2) સૌથી નાનું રથમંદિર દ્રૌપદીનું છે.\nઉપરોક્ત પૈકી ખોટું વિધાન જણાવો.",
    "options": [
      "ફક્ત 1",
      "ફક્ત 2",
      "બંને",
      "એકપણ નહિ"
    ],
    "correctAnswer": 3,
    "explanation": ""
  },
  {
    "id": 20,
    "question": "પ્રાચીન ભારતીય સાહિત્ય બાબતે નીચેના વિધાનો ચકાસો.\n1) મહાભારત વિશ્વનો સૌથી મોટો કાવ્યગ્રંથ છે.\n2) શ્રીમદ્ ભગવતગીતામાં મોક્ષ પ્રાપ્તિના ત્રણ માર્ગોનું વિવેચન કરવામાં આવ્યું છે.\n3) કૌટિલ્યનું અર્થશાસ્ત્ર વહીવટી વિજ્ઞાનની કૃતિ છે.\nઉપરોક્ત પૈકી સાચા વિધાન જણાવો.",
    "options": [
      "ફક્ત 1 અને 3",
      "ફક્ત 2 અને 3",
      "ફક્ત 3",
      "આપેલ તમામ"
    ],
    "correctAnswer": 3,
    "explanation": ""
  },
  {
    "id": 21,
    "question": "કાલગણના નામનું શાસ્ત્ર કોના દ્વારા લખવામાં આવેલ છે?",
    "options": [
      "મહામુનિ પરાશાર",
      "શકમૂનિ",
      "મહર્ષિ ભારદ્વાજ",
      "ચક્રપાણિદત્ત"
    ],
    "correctAnswer": 1,
    "explanation": ""
  },
  {
    "id": 22,
    "question": "નીચેનામાંથી કઈ શોધ ભારત દ્વારા કરવામાં આવેલી છે.\n1. શૂન્યની શોધ\n2. દશાંશ પદ્ધતિ\n3. બીજ ગણિત\n4. બોધાયાન નો પ્રમેય\n5. રેખા ગણિત",
    "options": [
      "1, 2 અને 3",
      "1, 2, 3 અને 5",
      "1, 3, 4 અને 5",
      "આપેલ તમામ"
    ],
    "correctAnswer": 3,
    "explanation": ""
  },
  {
    "id": 23,
    "question": "ગુજરાતમાં કયા સ્થળની પરિક્રમાનું અનેરૂ મહત્વ છે?\n1) નર્મદા 2) ચોટીલા\n3) શૈત્રુંજય 4) ગિરનાર\n5) સાપુતારા 6) ડાકોર",
    "options": [
      "ફક્ત 1, 3 અને 6",
      "ફક્ત 1, 2, 3 અને 4",
      "ફક્ત 1, 3 અને 4",
      "આપેલ તમામ"
    ],
    "correctAnswer": 2,
    "explanation": ""
  },
  {
    "id": 24,
    "question": "ભારતના ઐતિહાસિક સ્થળોને ઉત્તરથી દક્ષિણના ક્રમમાં ગોઠવતા કયો ક્રમ સાચો ગણાય?",
    "options": [
      "તાજમહલ, ખજૂરાહોનાં મંદિર, બૃહદેશ્વર મંદિર, ઈલોરાની ગુફા",
      "ઈલોરાની ગુફા, તાજમહેલ, ખજૂરાહોનાં મંદિર, બૃહદેશ્વર મંદિર",
      "તાજમહલ, બૃહદેશ્વર મંદિર, ખજૂરાહોનાં મંદિર, ઈલોરાની ગુફા",
      "તાજમહલ, ખજૂરાહોનાં મંદિર, ઈલોરાની ગુફા, બૃહદેશ્વર મંદિર"
    ],
    "correctAnswer": 3,
    "explanation": ""
  },
  {
    "id": 25,
    "question": "નીચેનામાંથી કયું વિધાન સાચું નથી?",
    "options": [
      "ઈલોરાની ગુફાઓમાં કૈલાસ મંદિર આવેલું છે.",
      "ઈલોરામાં કુલ 34 ગુફાઓ આવેલી છે.",
      "રાષ્ટ્રકૂટ રાજાઓના સમયમાં હિંદુ ધર્મની ગુફાઓનું નિર્માણ થયું.",
      "ઈલોરાની ગુફાઓને ચાર ભાગમાં વહેંચવામાં આવી છે."
    ],
    "correctAnswer": 3,
    "explanation": ""
  },
  {
    "id": 26,
    "question": "બૃહદેશ્વરના મંદિર બાબતે નીચેનામાંથી કયું વિધાન અયોગ્ય છે?",
    "options": [
      "તમિલનાડુના તાંજોર (થંજાવુરમાં) બૃહદેશ્વર મંદિર આવેલું છે.",
      "આ મંદિર પલ્લવ રાજવી રાજા રાજ પ્રથમે બંધાવ્યું હતું.",
      "આ મંદિરને રાજરાજેશ્વર મંદિર પણ કહે છે.",
      "આ મંદિરનું નિર્માણ દ્રવિડ શૈલીમાં થયું હતું."
    ],
    "correctAnswer": 1,
    "explanation": ""
  },
  {
    "id": 27,
    "question": "કુતુબમિનાર બાબતે નીચેના વિધાનો પૈકી કયું/કયાં વિધાન સાચું/સાચાં છે?\n1) તેનું નિર્માણ 12મી સદીમાં ગુલામ વંશના સ્થાપક કુત્બુદ્દીન ઐબકે શરૂ કરાવ્યું હતું.\n2) કુતુબ મિનારનું કામ પૂર્ણ કરાવનાર શાસક ઈલ્તુતમીશ હતો.",
    "options": [
      "ફક્ત 1",
      "ફક્ત 2",
      "બંને",
      "એકપણ નહિ"
    ],
    "correctAnswer": 2,
    "explanation": ""
  },
  {
    "id": 28,
    "question": "નીચે આપેલા ભારતના કયાં સ્થાપત્યમાં હાસ્યમુદ્રામાં વિષ્ણુની મૂર્તિ તથા મહિષાસુરનો વધ કરતી દુર્ગાદેવીનું શિલ્પ જોવા મળે છે?",
    "options": [
      "ખજૂરાહોના મંદિરોમાં",
      "મહાબલિપુરમમાં",
      "કોર્ણાકના સૂર્યમંદિરોમાં",
      "બૃહદેશ્વર મંદિરમાં"
    ],
    "correctAnswer": 1,
    "explanation": ""
  },
  {
    "id": 29,
    "question": "શાહજહાંએ જિંદગીના આખરી દિવસો કયા કિલ્લામાં વિતાવ્યા હતા?",
    "options": [
      "આગરાના કિલ્લામાં",
      "શાહી કિલ્લામાં",
      "દિલ્હીના લાલ કિલ્લામાં",
      "લાહોરી કિલ્લામાં"
    ],
    "correctAnswer": 0,
    "explanation": ""
  },
  {
    "id": 30,
    "question": "એલિફન્ટાની ગુફાઓ બાબતે નીચેનામાંથી કયું વિધાન અયોગ્ય છે?",
    "options": [
      "મહારાષ્ટ્ર રાજ્યમાં મુંબઈથી 12 કિમી દુર અરબસાગરમાં ગુફાઓ આવેલી છે.",
      "એલિફન્ટાની ગુફાઓની કુલ સંખ્યા 7 છે.",
      "ઈ.સ.1987માં યુનેસ્કો દ્વારા વૈશ્વિક વારસામાં એલિફન્ટાને સ્થાન આપવામાં આવ્યું છે.",
      "તેમાં આવેલી ત્રિમૂર્તિ (બ્રહ્મા, વિષ્ણુ અને મહેશ) એ ગુફા નંબર-7 માં આવેલી છે."
    ],
    "correctAnswer": 3,
    "explanation": ""
  },
  {
    "id": 31,
    "question": "વૈશ્વિક વારસાનાં સ્થળોની યાદી કોણ તૈયાર કરે છે?",
    "options": [
      "યુનેસ્કો",
      "યુનિસેફ",
      "સંયુક્ત રાષ્ટ્રોની સામાન્ય સભા",
      "સંયુક્ત રાષ્ટ્રોની સલામતી સમિતિ"
    ],
    "correctAnswer": 0,
    "explanation": ""
  },
  {
    "id": 32,
    "question": "ભારત સરકારે રાષ્ટ્રીય સ્મારકોની જાળવણીનું કામ કોને સોંપ્યું છે?",
    "options": [
      "પ્રવાસ અને પર્યટન ખાતાને",
      "પર્યાવરણ ખાતાને",
      "પુરાતત્ત્વ ખાતાને",
      "શિક્ષણ ખાતાને"
    ],
    "correctAnswer": 2,
    "explanation": ""
  },
  {
    "id": 33,
    "question": "ભારતીય નિધિ વ્યાપાર કાનૂન ક્યારે અમલમાં આવ્યો?",
    "options": [
      "ઈ. સ. 1880માં",
      "ઈ.સ. 1888 માં",
      "ઈ. સ. 1876માં",
      "ઈ. સ. 1952માં"
    ],
    "correctAnswer": 2,
    "explanation": ""
  },
  {
    "id": 34,
    "question": "હૈદરાબાદમાં કયું સંગ્રહાલય આવેલું છે?",
    "options": [
      "સુલતાનગંજ સંગ્રહાલય",
      "સાલારગંજ સંગ્રહાલય",
      "આબાદગંજ સંગ્રહાલય",
      "નિઝામ સંગ્રહાલય"
    ],
    "correctAnswer": 1,
    "explanation": ""
  },
  {
    "id": 35,
    "question": "શિકાગો શહેરમાં મળેલી 'વિશ્વધર્મ પરિષદ'માં કોણે વક્તવ્ય આપ્યું હતું?",
    "options": [
      "સ્વામી રામકૃષ્ણ પરમહંસે",
      "સ્વામી દયાનંદ સરસ્વતીએ",
      "રાજા રામમોહનરાયે",
      "સ્વામી વિવેકાનંદ"
    ],
    "correctAnswer": 3,
    "explanation": ""
  },
  {
    "id": 36,
    "question": "નીચેનામાંથી કયા દિવસને ‘વિશ્વ પર્યાવરણ દિવસ‘ તરીકે ઉજવવામાં આવે છે?",
    "options": [
      "5 ઓગસ્ટ",
      "5 સપ્ટેમ્બર",
      "5 જૂન",
      "5 માર્ચ"
    ],
    "correctAnswer": 2,
    "explanation": ""
  },
  {
    "id": 37,
    "question": "સોનું, તાંબુ અને યુરેનિયમ જેવી ખનીજો કેવા પ્રકારના સંસાધનોમાં સમાવેશ થાય છે?",
    "options": [
      "સર્વસુલભ સંસાધન",
      "સામાન્ય સુલભ સંસાધન",
      "વિરલ સંસાધન",
      "એકલ સંસાધન"
    ],
    "correctAnswer": 2,
    "explanation": ""
  },
  {
    "id": 38,
    "question": "અસમ, દાર્જીલિંગ, ઉત્તરાખંડ, હિમાચલ પ્રદેશ અને કશ્મીરમાં નીચેનામાંથી કેવી જમીન જોવા મળે છે?",
    "options": [
      "જંગલ પ્રકારની જમીન",
      "દલ દલ કે પીટ પ્રકારની જમીન",
      "રણ-પ્રકારની જમીન",
      "પર્વતીય જમીન"
    ],
    "correctAnswer": 3,
    "explanation": ""
  },
  {
    "id": 39,
    "question": "ભારતના કુલ ક્ષેત્રફળના લગભગ કેટલા ટકા વિસ્તારમાં રાતી અથવા લાલ જમીન જોવા મળે છે?",
    "options": [
      "43%",
      "22%",
      "19%",
      "29%"
    ],
    "correctAnswer": 2,
    "explanation": ""
  },
  {
    "id": 40,
    "question": "રાતી જમીનમાં કયાં તત્વની હાજરીના કારણે તેનો રંગ લાલ બને છે અને તથા તે નીચે જતા પીળા રંગમાં ફેરવાય છે?",
    "options": [
      "નાઈટ્રોજન",
      "ફેરિક ઓક્સાઈડ",
      "મેગ્નેશિયમ કાર્બોનેટ",
      "પોટાશ"
    ],
    "correctAnswer": 1,
    "explanation": ""
  },
  {
    "id": 41,
    "question": "ગુજરાતના કયા વિસ્તારને 2008માં જૈવ આરક્ષિત ક્ષેત્ર તરીકે ઘોષિત કરાયો છે?",
    "options": [
      "નળ સરોવરને",
      "ગીરને",
      "વેરાવદરને",
      "કચ્છના રણને"
    ],
    "correctAnswer": 3,
    "explanation": ""
  },
  {
    "id": 42,
    "question": "ગુજરાતની કઈ નદીઓમાં જોવા મળતી જળ બિલાડી આજે જુજ માત્રામાં જોવા મળે છે?\n(1) નર્મદા (2) તાપી\n(3) મહી (4) સાબરમતી",
    "options": [
      "ફક્ત 1, 2 અને 3",
      "ફક્ત 1",
      "ફક્ત 2 અને 4",
      "આપેલ તમામ"
    ],
    "correctAnswer": 3,
    "explanation": ""
  },
  {
    "id": 43,
    "question": "ઓડિસા, મેઘાલય, પંજાબ અને અરૂણાચલ પ્રદેશનાં પ્રદેશોમાં કયાં પ્રકારનાં જંગલોનું પ્રમાણ વિશેષ જોવા મળે છે?",
    "options": [
      "ખાનગી",
      "જાહેર",
      "સામુદાયિક",
      "અનામત"
    ],
    "correctAnswer": 0,
    "explanation": ""
  },
  {
    "id": 44,
    "question": "ભારતમાં હાથી પરિયોજનાનો પ્રોજેક્ટનો આરંભ કયાં વર્ષ દરમિયાન કરવામાં આવ્યો હતો?",
    "options": [
      "1973",
      "1992",
      "1995",
      "1980"
    ],
    "correctAnswer": 1,
    "explanation": ""
  },
  {
    "id": 45,
    "question": "ICAR નું પૂર્ણ નામ જણાવો.",
    "options": [
      "ઈન્ડિયન કાઉન્સિલ ઓફ એગ્રિકલ્ચરલ રિસર્ચ",
      "ઈન્ડિયન કોર્પોરેશન ઓફ એગ્રિકલ્ચરલ રિસર્ચ",
      "ઈન્ડિયન કમિટી ઓફ એગ્રિકલ્ચરલ રિસર્ચ",
      "ઈન્ડિયન કોર ઓફ એગ્રિકલ્ચરલ રિસર્ચ"
    ],
    "correctAnswer": 0,
    "explanation": ""
  },
  {
    "id": 46,
    "question": "કઈ ખેતીમાં જંગલોમાં વૃક્ષો કાપીને તેને સળગાવીને સાફ કરી ત્યાં ખેતી કરાય છે અને બે ત્રણ વર્ષ ખેતી કરાય છે. જમીનની ફળદ્રુપતા ઘટતા આ વિસ્તારોને છોડી દઈ બીજી ખેતી કરે છે?",
    "options": [
      "આર્દ્ર ખેતી",
      "બાગાયત ખેતી",
      "સૂકી ખેતી",
      "ઝૂમ ખેતી"
    ],
    "correctAnswer": 3,
    "explanation": ""
  },
  {
    "id": 47,
    "question": "“ચા”ના ઉત્પાદનમાં વિશ્વમાં કયો દેશ પ્રથમ સ્થાન ધરાવે છે?",
    "options": [
      "ભારત",
      "ચીન",
      "બ્રાઝીલ",
      "અમેરિકા"
    ],
    "correctAnswer": 1,
    "explanation": ""
  },
  {
    "id": 48,
    "question": "પાક અને તેને અનુકૂળ જમીન સંબંધી નીચેના વિધાનોમાંથી કયું/કયાં વિધાન સાચું/સાચાં છે?\n1. ડાંગર - નદીઓના કાંપની ફળદ્રુપ જમીન\n2. ઘઉં - કાળી કે ગોરાડુ જમીન\n3. બાજરી - ઓછી ફળદ્રુપ અને રેતાળ જમીન\n4. નાળિયેર – ક્ષારવાળી જમીન",
    "options": [
      "ફક્ત 1, 3 અને 4",
      "ફક્ત 2 અને 3",
      "ફક્ત 1, 2 અને 4",
      "આપેલ તમામ"
    ],
    "correctAnswer": 3,
    "explanation": ""
  },
  {
    "id": 49,
    "question": "નીચેના વિધાનો ચકાસી અયોગ્ય વિકલ્પ પસંદ કરો.",
    "options": [
      "કોકોમાંથી ચોકલેટ બાનવવામાં આવે છે.",
      "વિશ્વમાં રબરના ઉત્પાદનમાં પ્રથમ દેશ અમેરિકા છે.",
      "ચા ઉષ્ણ અને સમશીતોષ્ણ કટિબંધીય છોડ છે.",
      "ગુજરાતમાં બાજરીના વાવેતરમાં બનાસકાંઠા જિલ્લો મોખરે છે."
    ],
    "correctAnswer": 1,
    "explanation": ""
  },
  {
    "id": 50,
    "question": "ચા અને કોફી બંને પાકો કયાં રાજ્યોમાં થાય છે?",
    "options": [
      "અસમ અને કેરળમાં",
      "પશ્ચિમ બંગાળ અને કર્ણાટકમાં",
      "તમિલનાડું અને કર્ણાટકમાં",
      "ઉત્તરાખંડ અને ઉત્તર પ્રદેશમાં"
    ],
    "correctAnswer": 2,
    "explanation": ""
  },
  {
    "id": 51,
    "question": "ભાખરા નાંગલ પરિયોજનાં કારણે નીચેનામાંથી કયાં કયાં રાજ્યને લાભ મળે છે?",
    "options": [
      "કર્ણાટક, બિહાર, ઓડીસા",
      "પંજાબ, હરિયાણા, રાજસ્થાન",
      "મધ્યપ્રદેશ, બિહાર, રાજસ્થાન",
      "આંધ્રપ્રદેશ અને તેલંગાણા"
    ],
    "correctAnswer": 1,
    "explanation": ""
  },
  {
    "id": 52,
    "question": "સરદાર સરોવર પરિયોજનાનાં લાભાનવિત રાજ્યોમાં નીચેનામાંથી કયા કયા રાજ્યોનો સમાવેશ થાય છે?",
    "options": [
      "ઉત્તરપ્રદેશ, રાજસ્થાન, ગુજરાત અને મહારાષ્ટ્ર",
      "ગુજરાત, મધ્યપ્રદેશ, રાજસ્થાન અને બિહાર",
      "ગુજરાત, મધ્યપ્રદેશ, રાજસ્થાન અને મહારાષ્ટ્ર",
      "ગુજરાત, મધ્યપ્રદેશ, મહારાષ્ટ્ર અને તેલંગાણા"
    ],
    "correctAnswer": 2,
    "explanation": ""
  },
  {
    "id": 53,
    "question": "સોડાએશ, સાબુ, અને કાગળ અને ખાંડનાં શુદ્ધિકરણમાં કઇ ધાતુનો ઉપયોગ થાય છે?",
    "options": [
      "સીસુ",
      "ચુનાનો પથ્થર",
      "મેંગેનીઝ",
      "અબરખ"
    ],
    "correctAnswer": 1,
    "explanation": ""
  },
  {
    "id": 54,
    "question": "ઉત્તરથી શરુ કરી દક્ષિણ તરફ આવેલી નદીઓનો સાચો ક્રમ કયો છે?",
    "options": [
      "ગોદાવરી, ચંબલ, સતલુજ, કૃષ્ણા",
      "સતલુજ, ચંબલ, ગોદાવરી, કૃષ્ણા",
      "ચંબલ, કૃષ્ણા, સતલુજ, ગોદાવરી",
      "કૃષ્ણા, સતલુજ, ગોદાવરી, ચંબલ"
    ],
    "correctAnswer": 1,
    "explanation": ""
  },
  {
    "id": 55,
    "question": "બોક્સાઈટ ધાતુ સૌપ્રથમ કયા દેશમાં મળી આવી હતી?",
    "options": [
      "ભારત",
      "રશિયા",
      "ફ્રાંસ",
      "જાપાન"
    ],
    "correctAnswer": 2,
    "explanation": ""
  },
  {
    "id": 56,
    "question": "બાયોગેસ બાબતે નીચેના વિધાનો પૈકી કયા /કયુ વિધાન સાચા/સાચું છે?\n1. અમદાવાદનાં દસ્કોઇ તાલુકાના રુદાતલ ખાતે બાયોગેસનો પ્લાન્ટ આવેલ છે.\n2. બનાસકાંઠાનાં ડીસા તાલુકામાં બાયોગેસ પ્લાન્ટ આવેલ છે.",
    "options": [
      "ફક્ત 1",
      "ફક્ત 2",
      "બંને",
      "એકપણ નહિ"
    ],
    "correctAnswer": 0,
    "explanation": ""
  },
  {
    "id": 57,
    "question": "ભારતમાં સિંચાઈનાં મુખ્ય માધ્યમો પૈકી કયાં સૌથી મુખ્ય માધ્યમો છે?",
    "options": [
      "કુવા અને નહેરો",
      "નહેરો અને તળાવો",
      "કૂવા અને ટ્યુબવેલ",
      "નહેરો અને સરોવરો"
    ],
    "correctAnswer": 2,
    "explanation": ""
  },
  {
    "id": 58,
    "question": "ખનીજોના વર્ગીકરણ બાબતે નીચેના વિધાન ધ્યાને લો.\n1. મેગ્નેશિયમ, બૉકસાઇડ, અને ટીટાનીયમ કીમતી ધાતુઓના ઉ.દા. છે.\n2. ક્રોમિયમ, મેંગેનીઝ અને વેનેડીયમ મિશ્ર ધાતુઓના ઉ.દા. છે.\nઉપરોક્ત પૈકી સાચા વિધાનો ધ્યાને લો.",
    "options": [
      "ફક્ત 1",
      "ફક્ત 2",
      "બંને",
      "એકપણ નહિ"
    ],
    "correctAnswer": 1,
    "explanation": ""
  },
  {
    "id": 59,
    "question": "લોહ અયસ્ક બાબતે નીચેના વિધાનો પૈકી કયા/કયું વિધાન સાચા/સાચું છે?\n1. ભારતમાં વધુ લોખંડ ઝારખંડ રાજ્યમાંથી મેળે છે.\n2. લોખંડની કાચી ધાતુને શુદ્ધ કરવા માટે કોક અને ચૂનાનો ઉપયોગ કરવામાં આવે છે.",
    "options": [
      "ફક્ત 1",
      "ફક્ત 2",
      "બંને",
      "એકપણ નહિ"
    ],
    "correctAnswer": 1,
    "explanation": ""
  },
  {
    "id": 60,
    "question": "નીચેના વિધાનો ધ્યાને લો.\n1. માનવીના સૌપ્રથમ ઉપયોગમાં આવેલી ધાતુ તાંબુ હતી.\n2. તાંબામાં જસત ઉમેરવથી કાંસુ બને છે.\n3. તાંબામાં કલાઇ ઉમેરવાથી પિત્તળ બને છે.\nઉપરોક્ત પૈકી સાચા વિધાનો ધ્યાને લો.",
    "options": [
      "ફક્ત 2",
      "ફક્ત 1",
      "ફક્ત 2 અને 3",
      "આપેલ તમામ"
    ],
    "correctAnswer": 1,
    "explanation": ""
  },
  {
    "id": 61,
    "question": "ભારતમાં લોખંડ અને પોલાદનું પહેલું કારખાનું ક્યાં સ્થાપવમાં આવ્યું હતું?",
    "options": [
      "કુલ્ટીમાં",
      "બર્નપુરમાં",
      "જમશેદપુરમાં",
      "પોર્ટોનોવામાં"
    ],
    "correctAnswer": 3,
    "explanation": ""
  },
  {
    "id": 62,
    "question": "ભારતમાં આધુનિક ઢબે જહાજ બાંધવાનાં મુખ્ય કેન્દ્રોમાં કયાં કયાં છે?",
    "options": [
      "વિશાખાપટ્ટનમ અને મુંબઇ",
      "વિશાખાપટ્ટનમ અને ચેન્નાઇ",
      "પારાદ્વીપ અને તિરુવનંતપુરમ",
      "કોચી અને કંડલા"
    ],
    "correctAnswer": 0,
    "explanation": ""
  },
  {
    "id": 63,
    "question": "લોખંડ પોલાદનાં ઉત્પાદનમાં વિશ્વમાં ભારત કયુ સ્થાન ધરાવે છે?",
    "options": [
      "પાંચમું",
      "ત્રીજુ",
      "બીજુ",
      "દશમું"
    ],
    "correctAnswer": 0,
    "explanation": ""
  },
  {
    "id": 64,
    "question": "ભારતમાં Border Road Organisation નામની સંસ્થાની સ્થાપના કયાં વર્ષ દરમિયાન કરવામાં આવી હતી?",
    "options": [
      "1965",
      "1960",
      "1982",
      "1990"
    ],
    "correctAnswer": 1,
    "explanation": ""
  },
  {
    "id": 65,
    "question": "ભારત સરકારે કયાં વર્ષમાં રાષ્ટ્રીય ધોરી માર્ગ નંબરમાં ફેરફાર કર્યો છે?",
    "options": [
      "ઈ. સ. 2009માં",
      "ઈ.સ. 2011માં",
      "ઈ.સ. 2014માં",
      "ઈ.સ. 2015માં"
    ],
    "correctAnswer": 1,
    "explanation": ""
  },
  {
    "id": 66,
    "question": "ભારતમાં રાસાયણિક ખાતરનું પહેલું કારખાનું ક્યાં સ્થાપવામાં આવ્યું હતું?",
    "options": [
      "કલોલમાં",
      "રાનીપેટમાં",
      "ભરૂચમાં",
      "વડોદરામાં"
    ],
    "correctAnswer": 1,
    "explanation": ""
  },
  {
    "id": 67,
    "question": "ભારતમાં તાંબાના ગાળણનો ઉદ્યોગ ભારતીય તાંબા નિગમ દ્વારા ઝારખંડનાં કયા વિસ્તારમાં કરવામાં આવી હતી?",
    "options": [
      "ઘાટશિલા",
      "ભિલાઇ",
      "રાઉરકેલા",
      "દુર્ગાપુર"
    ],
    "correctAnswer": 0,
    "explanation": ""
  },
  {
    "id": 68,
    "question": "જનસંખ્યાની દ્રષ્ટિએ નીચેના પૈકી કયાં રાજ્યમાં રાષ્ટ્રીય ધોરી માર્ગોની સંખ્યા વધારે છે?",
    "options": [
      "મધ્યપ્રદેશ",
      "ગોવા",
      "રાજસ્થાન",
      "ગુજરાત"
    ],
    "correctAnswer": 1,
    "explanation": ""
  },
  {
    "id": 69,
    "question": "નાહર-કોટિયાથી નૂનમતી-બરૌની સુધી ખનીજતેલની પાઈપલાઈન કયા રાજ્યમાં સ્થિત છે?",
    "options": [
      "આંધ્રપ્રદેશ",
      "અસમ",
      "મહારાષ્ટ્ર",
      "કેરળ"
    ],
    "correctAnswer": 1,
    "explanation": ""
  },
  {
    "id": 70,
    "question": "ભારતનો સૌથી લાંબો રાષ્ટ્રીય ધોરી માર્ગ કયો છે?",
    "options": [
      "ગુવાહાટીથી કન્યાકુમારી",
      "જમ્મુથી કન્યાકુમારી",
      "કોલકતાથી ચેન્નાઇ",
      "શ્રીનગરથી કન્યાકુમારી"
    ],
    "correctAnswer": 3,
    "explanation": ""
  },
  {
    "id": 71,
    "question": "કઈ આર્થિક પદ્ધતિને ‘મુડીવાદી પદ્ધતિ’ તરીકે પણ ઓળખવામાં આવે છે?",
    "options": [
      "મિશ્ર અર્થતંત્રને",
      "સામ્રાજ્યવાદી પદ્ધતિને",
      "બજાર પદ્ધતિને",
      "એકપણ નહી"
    ],
    "correctAnswer": 2,
    "explanation": ""
  },
  {
    "id": 72,
    "question": "નીચેનામાંથી કયા દેશમાં મિશ્ર અર્થતંત્ર પ્રવર્તે છે?",
    "options": [
      "ચીન",
      "યુ.એસ.એ",
      "ભારત",
      "યુગોસ્લાવિયા"
    ],
    "correctAnswer": 2,
    "explanation": ""
  },
  {
    "id": 73,
    "question": "કઈ પદ્ધતિમાં નાણું અને ભાવતંત્ર સર્વોપરી હોય છે?",
    "options": [
      "સમાજવાદી પદ્ધતિમાં",
      "સામ્યવાદી અર્થતંત્રમાં",
      "મિશ્ર અર્થતંત્રમાં",
      "બજાર પદ્ધતિમાં"
    ],
    "correctAnswer": 3,
    "explanation": ""
  },
  {
    "id": 74,
    "question": "આર્થિક વિકાસ કોને કહે છે?",
    "options": [
      "લોકોના જીવનધોરણમાં સુધારાને",
      "આવકમાં થતી વૃદ્ધિને",
      "મોંઘવારીના વધારાને",
      "નિકાસ વૃદ્ધિને"
    ],
    "correctAnswer": 0,
    "explanation": ""
  },
  {
    "id": 75,
    "question": "ચીજવસ્તુઓ કે સેવાના વિનિમય દ્વારા આવક પ્રાપ્ત કરવાની અને ખર્ચ કરવાની પ્રવૃત્તિને કેવી પ્રવૃત્તિ કહે છે?",
    "options": [
      "વ્યાપાર પ્રવૃત્તિ",
      "બિન આર્થિક પ્રવૃત્તિ",
      "આર્થિક પ્રવૃત્તિ",
      "વિનિમય પ્રવૃત્તિ"
    ],
    "correctAnswer": 2,
    "explanation": ""
  },
  {
    "id": 76,
    "question": "વિશ્વ બેન્કના 2004ના અહેવાલ મુજબ માથાદીઠ આવક કેટલા ડોલરથી ઓછી હોય તો તે વિકાસશીલ દેશ કહેવાય?",
    "options": [
      "480$",
      "735$",
      "250$",
      "520$"
    ],
    "correctAnswer": 1,
    "explanation": ""
  },
  {
    "id": 77,
    "question": "નીચેના પૈકી કયા દેશમાં મિશ્ર અર્થતંત્ર પ્રવર્તે છે?",
    "options": [
      "ચીન",
      "યૂ.એસ.એ.",
      "ભારત",
      "યુગોસ્લાવિયા"
    ],
    "correctAnswer": 2,
    "explanation": ""
  },
  {
    "id": 78,
    "question": "વિશ્વ વ્યાપાર સંગઠન ક્યારે શરૂ કરવામાં આવે છે?",
    "options": [
      "1 જાન્યુઆરી 1996",
      "1 જાન્યુઆરી 1995",
      "1 જાન્યુઆરી 1997",
      "1 જાન્યુઆરી 1998"
    ],
    "correctAnswer": 1,
    "explanation": ""
  },
  {
    "id": 79,
    "question": "વિશ્વભરમાં કઈ તારીખે પર્યાવરણ દિન તરીકે જાહેર કરવામાં આવ્યો છે?",
    "options": [
      "5 જુલાઈ",
      "5 માર્ચ",
      "5 જૂન",
      "5 એપ્રિલ"
    ],
    "correctAnswer": 2,
    "explanation": ""
  },
  {
    "id": 80,
    "question": "ભારત સરકારે વાયુ પ્રદુષણ નિયંત્રણ ધારો ક્યારે પસાર કર્યો?",
    "options": [
      "1980",
      "1990",
      "1991",
      "1981"
    ],
    "correctAnswer": 3,
    "explanation": ""
  },
  {
    "id": 81,
    "question": "લોકો પ્રાથમિક જરુરિયાતો લઘુત્તમ બજાર ભાવે પણ પ્રાપ્ત કરી શકવા સમર્થ ન હોય તો તેને કઈ ગરીબી કહેવાય?",
    "options": [
      "આર્થિક ગરીબી",
      "સાપેક્ષ ગરીબી",
      "નિરપેક્ષ ગરીબી",
      "એકપણ નહી"
    ],
    "correctAnswer": 2,
    "explanation": ""
  },
  {
    "id": 82,
    "question": "લોકો પોતાની આવક બીજા કોઈ અન્ય વ્યક્તિ કરતા ઓછી આવક મેળવતો હોય તો તે કઈ ગરીબી કહેવાય?",
    "options": [
      "આર્થિક ગરીબી",
      "સાપેક્ષ ગરીબી",
      "નિરપેક્ષ ગરીબી",
      "એકપણ નહી"
    ],
    "correctAnswer": 1,
    "explanation": ""
  },
  {
    "id": 83,
    "question": "ભારતમાં આયોજનપંચે 2011-12માં ગરીબી રેખા નક્કી કરવા માટે ગ્રામીણક્ષેત્રે માથાદીઠ આવક માસિક વપરાશી ખર્ચ કેટલા હતો?",
    "options": [
      "810",
      "812",
      "816",
      "818"
    ],
    "correctAnswer": 2,
    "explanation": ""
  },
  {
    "id": 84,
    "question": "UNDP-2015ના રિપોર્ટ મુજબ ભારતમાં 2011-12માં ગરીબીનું પ્રમાણ કુલ વસ્તિના કેટલા ટકા હતું?",
    "options": [
      "20.91%",
      "20.92%",
      "21.92%",
      "20.92%"
    ],
    "correctAnswer": 2,
    "explanation": ""
  },
  {
    "id": 85,
    "question": "ભારતમાં સૌથી વધુ ગરીબીનું પ્રમાણ ધરાવતું રાજ્ય કયું છે?",
    "options": [
      "છત્તિસગઢ",
      "હરીયાણા",
      "બિહાર",
      "ઝારખંડ"
    ],
    "correctAnswer": 0,
    "explanation": ""
  },
  {
    "id": 86,
    "question": "ભાવોની સ્થિરતા માટે શેની રચના કારવામાં આવી હતી?",
    "options": [
      "પ્રધાનમંત્રી કૃષિ યોજના",
      "ઈ-નામ યોજના",
      "ક્ષતિમુક્ત કૃષિભાવ પંચ",
      "એકપણ નહી"
    ],
    "correctAnswer": 2,
    "explanation": ""
  },
  {
    "id": 87,
    "question": "‘દીનદયાળ ઉપાધ્યાય ગ્રામજ્યોતિ યોજના’ કેટલા ગામોને વિજળી પોહચાડવાની છે?",
    "options": [
      "12000",
      "13000",
      "18000",
      "20000"
    ],
    "correctAnswer": 2,
    "explanation": ""
  },
  {
    "id": 88,
    "question": "ભારતમાં કયા પ્રકારની બેરોજગારી જોવા મળે છે?",
    "options": [
      "માળખાગત",
      "પ્રચ્છન્ન",
      "શિક્ષિત",
      "મોસમી"
    ],
    "correctAnswer": 0,
    "explanation": ""
  },
  {
    "id": 89,
    "question": "ડિસેમ્બર 2015 સુધીમાં દેશમાં કેટલા રોજગાર વિનિમય કેન્દ્રો હતાં?",
    "options": [
      "947",
      "847",
      "956",
      "856"
    ],
    "correctAnswer": 0,
    "explanation": ""
  },
  {
    "id": 90,
    "question": "ભારતમાં સરેરાશ કેટલા ટકા વસતી વધે છે?",
    "options": [
      "૩%",
      "5 %",
      "1.9%",
      "2.5%"
    ],
    "correctAnswer": 2,
    "explanation": ""
  },
  {
    "id": 91,
    "question": "ભારતનો સૌથી ઊંચો બંધ ‘ટિહરી બંધ’ નું નિર્માણ ઉત્તરાખંડમાં કઈ નદીના કિનારે આવેલ છે?",
    "options": [
      "યમુના",
      "ભગીરથી",
      "અલકનંદા",
      "રાવી"
    ],
    "correctAnswer": 1,
    "explanation": ""
  },
  {
    "id": 92,
    "question": "‘ભારતનું પેરિસ’ તરીકે નીચેના પૈકી કયું સ્થળ ઓળખાય છે?",
    "options": [
      "જયપુર",
      "જોધપુર",
      "લખનઉ",
      "અમૃતસર"
    ],
    "correctAnswer": 0,
    "explanation": ""
  },
  {
    "id": 93,
    "question": "તહેવારોનું શહેર એટલે.....",
    "options": [
      "મદુરાઈ",
      "પાણીપત",
      "પ્રયાગરાજ",
      "ઉજ્જૈન"
    ],
    "correctAnswer": 0,
    "explanation": ""
  },
  {
    "id": 94,
    "question": "કયા નૃત્યના પાત્રો સુંદર ઘેરદાર કપડા પહેરે છે અને મોટા કલાત્મક મુકુટ ધારણ કરે છે?",
    "options": [
      "કથક",
      "મણિપુરી",
      "કૂચીપુડી",
      "કથકલી"
    ],
    "correctAnswer": 3,
    "explanation": ""
  },
  {
    "id": 95,
    "question": "પારાને ભસ્મ કરવાની પદ્ધતિ કોના દ્વારા વિકસાવવામાં આવી હતી.",
    "options": [
      "આચાર્ય ચાણક્ય",
      "આચાર્ય હેમચંદ્રાચાર્ય",
      "મહર્ષિ ચણક",
      "આચાર્ય નાગાર્જુન"
    ],
    "correctAnswer": 3,
    "explanation": ""
  },
  {
    "id": 96,
    "question": "કયુ સ્થાપત્ય મધ્યકાલીન વિશ્વની સાત અજાયબીઓ પૈકીનું એક ગણાય છે?",
    "options": [
      "ખજૂરાહોના મંદિર",
      "રાણીની વાવ",
      "આગરાનો કિલ્લો",
      "તાજમહેલ"
    ],
    "correctAnswer": 3,
    "explanation": ""
  },
  {
    "id": 97,
    "question": "સરકારે અતિ મૂલ્યવાન કલાકૃતિઓ અંગેનો કાયદો કઈ સાલમાં પસાર કર્યો?",
    "options": [
      "ઈ. સ. 1968માં",
      "ઈ. સ. 1972માં",
      "ઈ. સ. 1978માં",
      "ઈ. સ. 1962માં"
    ],
    "correctAnswer": 1,
    "explanation": ""
  },
  {
    "id": 98,
    "question": "નીચેનામાંથી ભારતના કયાં વિસ્તારમાં દલદલ કે પીટ પ્રકારની જમીન જોવા મળે છે?",
    "options": [
      "તમિલનાડુના કિનારાના ભાગ",
      "પશ્ચિમ બંગાળ",
      "ઓડિશા",
      "આપેલ તમામ"
    ],
    "correctAnswer": 3,
    "explanation": ""
  },
  {
    "id": 99,
    "question": "વનસ્પતિની વિધિવતની દ્રષ્ટિએ ભારતનું સ્થાન વિશ્વમાં કેટલામું છે?",
    "options": [
      "પંદરમું",
      "બારમું",
      "દશમું",
      "આઠમું"
    ],
    "correctAnswer": 1,
    "explanation": ""
  },
  {
    "id": 100,
    "question": "નીચેનામાંથી કયાં દિવસને વાઘ દિવસ તરીકે ઓળખવામાં આવે છે?",
    "options": [
      "10મી ઓગસ્ટ",
      "29 જુલાઈ",
      "12મી ઓગસ્ટ",
      "12 ઓક્ટોબર"
    ],
    "correctAnswer": 1,
    "explanation": ""
  }
]
};
