import type { TestData } from "@/types";

export const chapter3Test: TestData = {
  chapterId: "chapter-3",
  chapterTitle: "ટેસ્ટ 3",
  totalQuestions: 40,
  questions: [
    {
      id: 1,
      question: "ગુજરાતમાં ક્રાંતિકારી ચળવળ બાબતે નીચેના વિધાનો ધ્યાને લો.\n1. અરવિંદ ઘોષે ભવાની મંદિર નામના પુસ્તકમાં ક્રાંતિકારી યોજના આલેખી હતી.\n2. ચાંદોદ કરનાળી પાસે ગંગનાથ વિદ્યાલય ની સ્થાપના કરવામાં આવી હતી.\n3. અમદાવાદમાં રાયપુર દરવાજા બહાર વાઇસરોય મિંટો ની બગી પર બોમ્બ નાખવાનો ક્રાંતિકારી બનાવ ગુજરાતમાં બન્યો હતો\nઉપરોક્ત પૈકી સાચા વિધાનો જણાવો",
      options: [
        "ફક્ત 1 અને 3",
        "ફક્ત 2 અને 3",
        "ફક્ત 1 અને 2",
        "આપેલ તમામ"
      ],
      correctAnswer: 3,
      explanation: ""
    },
    {
      id: 2,
      question: "વિદેશમાં ક્રાંતિકારી પ્રવૃત્તિઓ બાબતે નીચેના વિધાનો ધ્યાનમાં લો.\n1. 1907 માં અમેરિકાના કેલિફોર્નિયામાં ઇન્ડિયન ઇન્ડિપેન્ડન્સ લીગની સ્થાપના થઈ હતી.\n2. ઇન્ડિયન ઇન્ડિપેન્ડન્સ લીગ નામની સંસ્થાનું નામ પાછળથી લાલા હરદયાલે ગદર પાર્ટી આપ્યું હતું.\n3. જર્મનીમાં ચંપક રમણ પિલ્લાઇએ હિંદ રાષ્ટ્રીય સ્વયંસેવક દળની રચના કરી હતી.\nઉપરોક્ત પૈકી સાચા વિધાન જણાવો.",
      options: [
        "ફક્ત 1 અને 3",
        "ફક્ત 2 અને 3",
        "ફક્ત 1 અને 2",
        "આપેલ તમામ"
      ],
      correctAnswer: 3,
      explanation: ""
    },
    {
      id: 3,
      question: "નીચેના વિધાનો ધ્યાને લો.\n1. ઇ.સ. 1907 માં ઇંગ્લેન્ડના સ્ટુઅર્ટ ગાર્ડ શહેરમાં યોજાયેલી આંતરરાષ્ટ્રીય સમાજવાદી પરિષદમાં મેડમ કામાએ રાષ્ટ્રધ્વજ ફરકાવ્યો હતો.\n2. બર્મામાં સોહનલાલ પાઠક અને સિંગાપુરમાં પરમાનંદે ક્રાંતિકારી પ્રવૃત્તિઓ કરી હતી.\nઉપરોક્ત પૈકી સાચા વિધાન જણાવો.",
      options: [
        "ફક્ત 1",
        "ફક્ત 2",
        "બંન્ને",
        "એકપણ નહિ"
      ],
      correctAnswer: 1,
      explanation: ""
    },
    {
      id: 4,
      question: "મહાત્મા ગાંધી વિશે નીચેના વિધાનો ચકાસો.\n1. તેમને દક્ષિણ આફ્રિકામાં રંગભેદ વિરુદ્ધ સત્યાગ્રહની લડત ચલાવી હતી.\n2. તેમના રાજકીય ગુરુ શ્રીમદ રાજચંદ્ર હતા.\n3. તેમના આધ્યાત્મિક ગુરુ ગોપાલ કૃષ્ણ ગોખલે હતા.\nઉપરોક્ત પૈકી ખોટા વિધાન જણાવો.",
      options: [
        "ફક્ત 1 અને 3",
        "ફક્ત 2 અને 3",
        "ફક્ત 1 અને 2",
        "આપેલ તમામ"
      ],
      correctAnswer: 1,
      explanation: ""
    },
    {
      id: 5,
      question: "રોલેક્ટ એક્ટ બાબતે નીચેના વિધાનોમાંથી અયોગ્ય વિધાન પસંદ કરો.",
      options: [
        "બ્રિટિશ સરકારે ઇંગ્લેન્ડના ગૃહપ્રધાન રોલેક્ટ ના અધ્યક્ષ પદે રોલેક્ટ એક્ટ 1922 માં કાઢ્યો હતો.",
        "રોલેક્ટ એક્ટ નામના કાયદાએ વાણી સ્વાતંત્ર્ય અને વ્યક્તિસ્વાતંત્ર ને હણી નાખ્યું હતું",
        "રોલેક્ટ એક્ટને કાળા કાયદા તરીકે ઓળખવામાં આવતો હતો.",
        "આ કાયદા મુજબ કોઈપણ શંકાસ્પદ વ્યક્તિને કોઈ પણ સમયે ધરપકડ કરવામાં આવતી હતી."
      ],
      correctAnswer: 0,
      explanation: ""
    },
    {
      id: 6,
      question: "જલિયાંવાલા બાગના હત્યાકાંડ બાબતે નીચેના વિધાનો ચકાસો.\n1. વૈશાખી ના તહેવારના દિવસે પંજાબનાં અમૃતસર ખાતે સભાનું આયોજન કર્યું હતું.\n2. આ બાબતે તપાસ કરવા માટે હંટર કમિશનની નિમણૂક કરવામાં આવે હતી.\n3. 13 એપ્રિલ 1922 ના રોજ આ ઘટના બની હતી.\nઉપરોક્ત પૈકી સાચા વિધાન જણાવો.",
      options: [
        "ફક્ત 1 અને 3",
        "ફક્ત 2 અને 3",
        "ફક્ત 1 અને 2",
        "આપેલ તમામ"
      ],
      correctAnswer: 2,
      explanation: ""
    },
    {
      id: 7,
      question: "નીચેની ઘટનાને યોગ્ય ક્રમ મુજબ ગોઠવો.\n1.મુસ્લિમ લીગની સ્થાપના  2. મોર્લે-મિંટો સુધારા\n3. રોલક્ટ એક્ટ  4. ચૌરા ચૌરી બનાવ",
      options: [
        "2,3,4,1",
        "4,3,2,1",
        "1,2,3,4",
        "2,1,3,4"
      ],
      correctAnswer: 2,
      explanation: ""
    },
    {
      id: 8,
      question: "સ્વરાજ પક્ષની સ્થાપનામાં મુખ્યત્વે કોનો કોનો ફાળો રહેલો છે ?",
      options: [
        "જવાહરલાલ નહેરુ અને ચિતરંજન દાસ",
        "મોતીલાલ નહેરુ અને જવાહરલાલ નહેરુ",
        "મોતીલાલ નેહરુ અને ચિતરંજન દાસ",
        "ગાંધીજી અને મોતીલાલ નહેરુ"
      ],
      correctAnswer: 2,
      explanation: ""
    },
    {
      id: 9,
      question: "ગાંધીજીએ કયા બનાવ પછી કહ્યું કે અહિંસા નું મૂલ્ય નહિ સમજનારા લોકોના હાથમાં સત્યાગ્રહનું શસ્ત્ર મૂકીને મેં હિમાલય જેવડી મોટી ભૂલ કરી છે",
      options: [
        "જલિયાંવાલા બાગના હત્યાકાંડ",
        "અસહકારનું આંદોલન",
        "ચૌરી ચૌરા બનાવ",
        "રોલેટ એક્ટ"
      ],
      correctAnswer: 2,
      explanation: ""
    },
    {
      id: 10,
      question: "નીચેના વિધાનો પૈકી સાચા વિધાન જણાવો\n1. ચૌરી ચૌરા બનાવ બનાવ 5 ફેબ્રુઆરી 1922 ના રોજ થયો હતો.\n2. ચૌરી ચૌરા બનાવમાં 21 પોલીસનો મુત્યુ પામ્યા હતા.\n3. ચૌરી ચૌરા બનાવ પછી અસહકારનું આંદોલન ગાંધીજીએ પાછુ ખેચ્યુ હતુ.",
      options: [
        "ફક્ત 1 અને 3",
        "ફક્ત 2 અને 3",
        "ફકત 3",
        "આપેલ તમામ"
      ],
      correctAnswer: 3,
      explanation: ""
    },
    {
      id: 11,
      question: "નીચેના વિધાનો ધ્યાને લો.\n1. લાલ , બાલ અને પાલની ત્રિપુટીએ જહાલવાદી નીતિ અપનાવી હતી.\n2. શ્રી અરવિંદઘોષે તેમના પુસ્તક ભવાની મંદિરમાં ક્રાંતિકારી યોજના આલેખી હતી.\nઉપરોક્ત પૈકી સાચા વિધાન જણવો.",
      options: [
        "ફક્ત 1",
        "ફક્ત 2",
        "બંન્ને",
        "એકપણ નહિ"
      ],
      correctAnswer: 2,
      explanation: ""
    },
    {
      id: 12,
      question: "1857 ના સંગ્રામ બાબતે નીચેના વિધાનો ધ્યાનમાં લો.\n1. 1857 ના સંગ્રામના ઘણા પરિણામોના કારણે કંપની શાસનનો અંત આવ્યો હતો.\n2. 1857 ના સંગ્રામની ભારતમાં તાજના શાસનની શરૂઆત થઈ હતી.\nઉપરોક્ત પૈકી સાચા વિધાન જણવો.",
      options: [
        "ફક્ત 1",
        "ફક્ત 2",
        "બંન્ને",
        "એકપણ નહિ"
      ],
      correctAnswer: 2,
      explanation: ""
    },
    {
      id: 13,
      question: "નીચેના વિધાનો ધ્યાને લો.\n1. ઈ.સ. 1911માં બંગાળના ભાગલા રદ કરવામાં આવ્યા હતા.\n2. ઈ.સ. 1906માં મુસ્લિમ લીગની સ્થાપના કરવામાં આવી હતી.\nઉપરોક્ત પૈકી સાચા વિધાન જણાવો.",
      options: [
        "ફક્ત 1",
        "ફક્ત 2",
        "બંન્ને",
        "એકપણ નહિ"
      ],
      correctAnswer: 2,
      explanation: ""
    },
    {
      id: 14,
      question: "નીચેના જોડકા જોડો.\n1. ઇ.સ.1905  (A) બંગાળના ભાગલા રદ\n2. ઇ.સ. 1911  (B) ગાંધીજીનું આગમન(ભારતમાં)\n3. ઇ.સ. 1915  (C) ચૌરા ચોરા બનાવ\n4. ઇ.સ.1922  (D) બંગાળના ભાગલા પાડ્યા",
      options: [
        "1-A, 2-B, 3-C, 4-D",
        "1-D, 2-C, 3-B, D-A",
        "1-D, 2-A, 3-B, 4-C",
        "1-D, 2-A, 3-C, 4-B"
      ],
      correctAnswer: 2,
      explanation: ""
    },
    {
      id: 15,
      question: "નીચેના વિધાનો ધ્યાને લો.\n1. ઇ.સ. 1920 થી 1947 ના સમયગાળાને ગાંધીયુગ કહેવામાં આવે છે.\n2. અંગ્રેજ દ્વારા નિમવામાં આવેલ સાયમન કમિશનના કુલ આઠ સભ્યો હતા.\n3. સાયમન કમિશનનાં વિરોધમાં લાલાલજપતરાયનું લાઠીચાર્જ દ્વારા મૃત્યુ થયુ હતુ.\nઉપરોક્ત પૈકી સાચા વિધાન જણાવો.",
      options: [
        "ફક્ત 1 અને 3",
        "ફક્ત 2 અને 3",
        "ફક્ત 3",
        "આપેલ તમામ"
      ],
      correctAnswer: 0,
      explanation: ""
    },
    {
      id: 16,
      question: "નીચેના વિધાનો ચકાસો.\n1. હિન્દી રાષ્ટ્રીય મહાસભા એ મોતીલાલ નહેરુના પ્રમુખ પદે નહેરુ કમિટીની રચના કરી હતી.\n2. રાવી નદીના તટે લાહોર ખાતે જવાહરલાલ નહેરુના અધ્યક્ષપણા નીચે હિન્દી રાષ્ટ્રીય મહાસભામાં પુર્ણસ્વરાજનો ઠરાવ પસાર કર્યો હતો.\nઉપરોક્ત પૈકી સાચા વિધાન જણાવો.",
      options: [
        "ફક્ત 1",
        "ફક્ત 2",
        "બંન્ને",
        "એકપણ નહિ."
      ],
      correctAnswer: 2,
      explanation: ""
    },
    {
      id: 17,
      question: "નીચેના વિધાનો પૈકી કયું/ કયાં વિધાનો સાચા છે ?\n1. ‘’હિન્દ છોડો “આંદોલન દરમિયાન અમદાવાદમાં સાડા ચાર મહિના બજારો બંધ રહયા હતા.\n2. સુભાષચંદ્ર બોઝે કોંગ્રેસ છોડીને “ફોરવર્ડ બ્લોક નામની સંસ્થાની સ્થાપના કરી હતી.\n3. ઇ.સ. 1943માં સુભાષચંદ્ર બોઝે અંદમાન અને નિકોબાર ટાપુઓને અનુક્રમે શહિદ અને ભારતમાતા નામ આપ્યા હતા.",
      options: [
        "ફક્ત 1 અને 3",
        "ફક્ત 2 અને 3",
        "ફક્ત 2",
        "આપેલ તમામ"
      ],
      correctAnswer: 2,
      explanation: ""
    },
    {
      id: 18,
      question: "દાંડીમાર્ચ બાબતે નીચેના વિધાનો ધ્યાને લો.\n1. અમદાવાદમાં સાબરમતી આશ્રમ ખાતેથી 12 માર્ચ 1830 ના રોજ શરૂઆત થઇ હતી.\n2. દાંડીકૂચ દરમિયાન અમદાવાદથી દાંડીનું અંતર આશરે 350 કિમીનું હતુ.\n3. ગાંધીજીએ ‘‘રાસ’’ ગામે કહ્યુ હતુ કે હુ કાગડા કુતરાના મોતે મરિશ પરંતુ સ્વરજ્ય મળે નહિ ત્યાં સુધી આશ્રમમાં પાછો નહિ ફરું\nઉપરોક્ત પૈકી સાચા વિધાન જણાવો.",
      options: [
        "ફક્ત 1 અને 3",
        "ફક્ત 2 અને 3",
        "ફક્ત 3",
        "એકપણ નહિ"
      ],
      correctAnswer: 3,
      explanation: ""
    },
    {
      id: 19,
      question: "દાંડીમાર્ચ બાબતે નીચેના વિધાનો ધ્યાને લો.\n1. ગાંધીજી તેમના સાથીદારો સાથે 24 દિવસની પદયાત્રા બાદ દાંડી પહોચ્યા હતા.\n2. ગાંધીજી તારીખ 5મી એપ્રિલ 1930નાં રોજ દાંડી પહોચ્યા હતા.\n3. મહાદેવભાઇ દેસાઈ દાંડીકૂચને ‘’મહાભિનિષ્ક્રમણ” સાથે સરખાવે છે.\nઉપરોક્ત પૈકી સાચા વિધાન જણાવો.",
      options: [
        "ફક્ત 1 અને 3",
        "ફક્ત 2 અને 3",
        "ફક્ત 3",
        "આપેલ તમામ"
      ],
      correctAnswer: 3,
      explanation: ""
    },
    {
      id: 20,
      question: "નીચેના વિધાનો ધ્યાને લો.\n1. સરહદનાં ગાંધી તરીકે ખાન અબ્દુલ ગફર ખાન ને ઓળખવામાં આવે છે.\n2. સુરતનાં ધરાસણામાં પણ મીઠાનો સત્યાગ્રહ થયો હતો.\n3. અમદાવાદ જિલ્લાનાં વિરમગામ તાલુકામાં પણ મીઠાનો સત્યાગ્રહ થયો હતો.\nઉપરોક્ત પૈકી સાચા વિધાન જણાવો.",
      options: [
        "ફક્ત 1 અને 3",
        "ફક્ત 2 અને 3",
        "ફક્ત 3",
        "આપેલ તમામ"
      ],
      correctAnswer: 3,
      explanation: ""
    },
    {
      id: 21,
      question: "નીચેના વિધાનો ધ્યાને લો .\n1. હિંદ છોડો ચળવળ વર્ષ 1942-43 સાલ દરમિયાન થઇ હતી.\n2. મુંબઇમાં મળેલી કોંગ્રેસ મહાસમિતિની બેઠકમાં ગાંધીજીની આગેવાની હેઠળ 8મી ઓગસ્ટ ,1942ની રાત્રે હિંદ છોડો નો ઠરાવ પસાર કર્યો હતો.\nઉપરોક્ત પૈકી સાચા વિધાનો જણાવો.",
      options: [
        "ફક્ત 1",
        "ફક્ત 2",
        "બંન્ને",
        "એકપણ નહિ"
      ],
      correctAnswer: 2,
      explanation: ""
    },
    {
      id: 22,
      question: "નીચેના વિધાનો ધ્યાને લો.\n1. રાસબિહારી બોઝે આઝાદ હિંદ ફોજના વડા તરીકે સુભાષચંદ્રે બોઝની નિમણૂક કરી હતી.\n2. “જય હિંદ” નુ સુત્ર સુભાષચંદ્ર બોઝ દ્વારા આપવામાં આવી હતી.\n3. અખંડ ભારતના બે ભાગલા પાડવાની આખરી યોજના માઉન્ટ બેટન દ્વારા કરવામાં આવી હ્તી.\nઉપરોક્ત પૈકી સાચા વિધાનો જણાવો.",
      options: [
        "ફક્ત 1 અને 3",
        "ફક્ત 2 અને 3",
        "ફક્ત 3",
        "આપેલ તમામ"
      ],
      correctAnswer: 3,
      explanation: ""
    },
    {
      id: 23,
      question: "સુભાષચંદ્ર બોઝ બાબતે નીચેના વિધાનો ધ્યાને લો.\n1. તેમનો જન્મ ઓડિસા રાજ્યનાં કટકમાં થયો હતો.\n2. તેમના પિતાનું નામ રાયબહાદુર જાનકીનાથ બોઝ કાનુન ક્ષેત્રે વકિલ હતા.\n3. ઇ.સ. 1938માં માત્ર 41 વર્ષની યુવાન વયે હરિપુરા અધિવેશનમાં કોંગ્રેસના અશિવેશન ના પ્રમુખ પદે રહ્યા હતા.\nઉપરોક્ત પૈકી સાચા વિધાન જણાવો",
      options: [
        "ફક્ત 1 અને 3",
        "ફક્ત 2 અને 3",
        "ફક્ત 3",
        "આપેલ તમામ"
      ],
      correctAnswer: 3,
      explanation: ""
    },
    {
      id: 24,
      question: "નીચેના વિધાનો ધ્યાને લો.\n1. જુલાઇ ,1943માં બ્રિટીશ પાર્લામેન્ટે હિંદ સ્વાતંત્ર્ય ધારો પસાર કર્યો હતો.\n2. “તુમ મુઝે ખૂન દો મૈં તુમે આઝાદી દૂંગા” તેવું સુત્ર સુભાષચંદ્ર બોઝે આપ્યું હતું.\nઉપરોક્ત પૈકી સાચા વિધાનો જણાવો.",
      options: [
        "ફક્ત 1",
        "ફક્ત 2",
        "બંન્ને",
        "એકપણ નહિં"
      ],
      correctAnswer: 1,
      explanation: ""
    },
    {
      id: 25,
      question: "નીચેનામાંથી કયાં વ્યક્તિ/રાજાએ બિનજોડાણવાદી ચળવળમાં ભાગ લીધો હતો?\n1. ભારતના વડાપ્રધાન જવાહરલાલ નહેરુ\n2. ઈન્ડોનેશિયાના રાષ્ટ્રપતિ સુકર્ણો\n3. ઈજીપ્તના રાષ્ટ્રપતિ કર્નલ નાસર\n4. યુગોસ્લાવિયાના રાષ્ટ્રપતિ માર્શલ ટીટો",
      options: [
        "ફક્ત 1, 3 અને 4",
        "ફક્ત 2 અને 3",
        "ફક્ત 1, 2 અને 4",
        "1, 2, 3 અને 4"
      ],
      correctAnswer: 3,
      explanation: ""
    },
    {
      id: 26,
      question: "વર્ષ 1961માં બેલગ્રેડના ખાતે યોજાયેલ પરિષદમાં રીતે બિનજોડાણવાદી આંદોલન બાબતે નીચેનામાંથી કઈ સંસ્થાની સ્થાપના થઈ હતી.",
      options: [
        "CENTO",
        "NAM",
        "NATO",
        "આપેલ તમામ"
      ],
      correctAnswer: 1,
      explanation: ""
    },
    {
      id: 27,
      question: "નીચેના વિધાનો ધ્યાનમાં લો.\n1. ભારતે વિશ્વના દેશો સાથે બિનજોડાણવાદી નીતિ અપનાવી ત્યારે ભારતના વડાપ્રધાન જવાહરલાલ નહેરુ હતા.\n2. 13મું શિખર સંમેલન કુઆલાલમ્પુર ખાતે યોજાયું હતું. (2003)\nઉપરોક્ત પૈકી સાચા વિધાન જણાવો.",
      options: [
        "ફક્ત 1",
        "ફક્ત 2",
        "બંન્ને",
        "એકપણ નહિ"
      ],
      correctAnswer: 2,
      explanation: ""
    },
    {
      id: 28,
      question: "ઠંડા યુદ્ધ (1945-1962) ના કારણો બાબતે નીચેનામાંથી કયું/કયાં વિધાન ખોટા છે?\n1. આ યુદ્ધમાં વિશ્વની નેતાગીરી અમેરિકા અને રશિયાએ લીધી હતી.\n2. આ યુદ્ધનાં કારણે બે મહાસત્તાઓ વચ્ચેના સંબંધો સુમેળભર્યા રહ્યા હતા.\n3. આ યુદ્ધમાં ઘણા લોકો મૃત્યુ પામ્યા હતા.\n4. આ યુદ્ધમાં જર્મની, ઈટાલી અને જાપાન આર્થિક રાજકીય અને લશ્કરી બધીજ રીતે નષ્ટ થયા હતાં.",
      options: [
        "ફક્ત 1, 3 અને 4",
        "ફક્ત 2 અને 3",
        "ફક્ત 4",
        "એકપણ નહિ"
      ],
      correctAnswer: 1,
      explanation: ""
    },
    {
      id: 29,
      question: "નીચેના વિધાનો ધ્યાને લો.\n1. રશિયાએ વર્ષ 1949માં અણુબોમ્બનો ધડાકો કર્યો હતો.\n2. રશિયાની પ્રેરણાથી ઉત્તર એટલાન્ટિક મહાસાગરના કિનારે “નાટો” નામના સંગઠનની સ્થાપના થઈ હતી.\nઉપરોક્ત પૈકી સાચા વિધાન જણાવો.",
      options: [
        "ફક્ત 1",
        "ફક્ત 2",
        "બંન્ને",
        "એકપણ નહિ"
      ],
      correctAnswer: 0,
      explanation: ""
    },
    {
      id: 30,
      question: "રશિયા દ્વારા “વોર્સોકરાર” નામે જે સંગઠનની સ્થાપના થઈ તેમાં નીચેનામાંથી કયા દેશનો સમાવેશ થાય છે?\n1. બલ્ગેરિયા  2. પૂર્વ જર્મની\n3. હંગેરી  4. પોલેન્ડ\n5. રુમાનિયા  6. રશિયા",
      options: [
        "ફક્ત 2,3 અને 6",
        "ફક્ત 2, 3, 4 અને 6",
        "ફક્ત 1, 2,3 અને 5",
        "આપેલ તમામ"
      ],
      correctAnswer: 3,
      explanation: ""
    },
    {
      id: 31,
      question: "નીચેનામાંથી કયાં/કયું સંગઠનને ‘બગદાદ કરાર’ તરીકે ઓળખવામાં આવે છે?",
      options: [
        "NATO",
        "SEATO",
        "CENTO",
        "NAM"
      ],
      correctAnswer: 2,
      explanation: ""
    },
    {
      id: 32,
      question: "યોગ્ય જોડકાં બાનવો.\nવિભાગ ‘અ’\n1. રશિયાએ રચેલું લશ્કરી સંગઠન\n2. મધ્ય-પૂર્વના દેશોએ રચેલું લશ્કરી સંગઠન\n3. પૂર્વ જર્મની પર અંકુશ\n4. જર્મનીના નૈઋત્ય ભાગ પર અંકુશ\nવિભાગ ‘બ’\nA. અમેરિકા\nB. વોર્સો કરાર\nC. સોવિયેત યુનિયન\nD. સેન્ટો (CENTO)",
      options: [
        "(1-B), (2-D), (3-C), (4-A)",
        "(1-A), (2-B), (3-C), (4-D)",
        "(1-D), (2-B), (3-C), (4-A)",
        "(1-A), (2-D), (3-C), (4-B)"
      ],
      correctAnswer: 0,
      explanation: ""
    },
    {
      id: 33,
      question: "નીચેના જોડકા જોડો.\nવિભાગ ‘અ’\n1. અમેરિકા અને રશિયા\n2. ક્યુબાની નાકાબંધી\n3. બર્લિનની નાકાબંધી\n4. શ્રીલંકામાં વસવાટ\nવિભાગ ‘બ’\nA. સોવિયેત યુનિયન\nB. તમિલ લોકો\nC. ઠંડું યુદ્ધ\nD. અમેરિકા",
      options: [
        "(1-C), (2-D), (3-A), (4-B)",
        "(1-B), (2-D), (3-A), (4-C)",
        "(1-C), (2-A), (3-D), (4-B)",
        "(1-A), (2-D), (3-C), (4-B)"
      ],
      correctAnswer: 0,
      explanation: ""
    },
    {
      id: 34,
      question: "સંયુક્ત રાષ્ટ્રો(યુ.એન.) ની વિધિવત્ સ્થાપના ક્યારે થઈ?",
      options: [
        "16 ડિસેમ્બર, 1945ના રોજ",
        "24 ઑક્ટોબર, 1945ના રોજ",
        "31 જાન્યુઆરી, 1945ના રોજ",
        "24 ઑગસ્ટ, 1945ના રોજ"
      ],
      correctAnswer: 1,
      explanation: ""
    },
    {
      id: 35,
      question: "ભારતના પાડોસી દેશો સાથેના સંબંધો બાબતે નીચેના વિધાનો ધ્યાને લો.\n1. ભારત અને પાકિસ્તાન વચ્ચે 1948, 1965 અને 1971 માં ત્રણ વાર યુદ્ધ થયા હતા.\n2. ચીને ભારત પર 1962માં આક્રમણ કર્યુ હતું.\n3. ભારત અને ચીન વચ્ચેની રેખાને મેકમોહન રેખા કહે છે.\nનીચેના વિધાનો પૈકી ખોટા વિધાનો જણાવો.",
      options: [
        "ફક્ત 1 અને 3",
        "ફક્ત 2",
        "ફક્ત 2",
        "એકપણ નહિં"
      ],
      correctAnswer: 3,
      explanation: ""
    },
    {
      id: 36,
      question: "હિંદુસ્તાનનાં વિભાજન સમયે ભારતમાં કયાં અંગ્રેજ ગવર્નર જનરલ હતા ?",
      options: [
        "મોન્ટેગ્યુ ચેમ્સફર્ડ",
        "વેલેસ્લી",
        "માઉન્ટ બેટન",
        "ડેલહાઉસી"
      ],
      correctAnswer: 2,
      explanation: ""
    },
    {
      id: 37,
      question: "અંખડ ભારતના બે ભાગલા કરવામાં નીચેનામાથી કઇ યોજનાએ મહત્વનો ફાળો ભજવ્યો હતો ?",
      options: [
        "કેબિનેટ મિશન યોજના",
        "ક્રિપ્સ મિશન યોજના",
        "માઉન્ટ બેટન યોજના",
        "ગાંધી -ઇરવિન કરાર"
      ],
      correctAnswer: 2,
      explanation: ""
    },
    {
      id: 38,
      question: "“કરेंगे યા મરेंगे “ગાંધીજીએ આ સુત્ર ક્યારે ઉચ્ચાર્યુ હતુ?",
      options: [
        "દાંડીયાત્રા વખતે",
        "સવિનય કાનુનભંગની ચળવળ વખતે",
        "હિંદ છોડો ચળવળ",
        "અસહકારના આંદોલન વખતે"
      ],
      correctAnswer: 2,
      explanation: ""
    },
    {
      id: 39,
      question: "અસહકારના આંદોલનની શરૂઆતમાં કોણે પોતાના કેસરે હિન્દની ઉપાધિનો ત્યાગ કર્યો હતો?",
      options: [
        "મહાત્મા ગાંધી",
        "ગોપાલ કૃષ્ણ ગોખલે",
        "શ્રીમદ રાજચંદ્ર",
        "જવાહરલાલ નહેરુ"
      ],
      correctAnswer: 0,
      explanation: ""
    },
    {
      id: 40,
      question: "‘સ્વરાજ મારો જન્મસિદ્ધ હક છે’ અને હું તેને લઈને ઝંપીશ આ વિધાન કોનું છે ?",
      options: [
        "ગોપાલ કૃષ્ણ ગોખલે",
        "લાલા લજપતરાય",
        "બાલ ગંગાધર તિલક",
        "લાલા હરદયાલ"
      ],
      correctAnswer: 2,
      explanation: ""
    }
  ]
};
