import type { TestData } from "@/types";

export const chapter9Test: TestData = {
  chapterId: "chapter-9",
  chapterTitle: "ટેસ્ટ 9",
  totalQuestions: 40,
  questions: [
    {
      id: 1,
      question: "કયુ નૃત્ય સાગરના મોતી કે એ મોજા પર હિલોળા લેતા વહાણ જેવુ દૃશ્ય ખડું કરે છે?",
      options: ["ગોફ ગુંથન","ધમાલ","મેરાયો","પઢાર"],
      correctAnswer: 3,
      explanation: ""
    },
    {
      id: 2,
      question: "માટીકલા બાબતે નીચેના વિધાનો પૈકી કયુ / કયા વિધાન સાચા છે?\n(1) કુંભારનો ચાકડો માટીકલા માટેનું પ્રાચીન ભારતનું પ્રથમ યંત્ર કહેવાય છે.\n(2) દક્ષિણ ભારતના નાગાર્જુનકોંડા અને ગુજરાતના લાંઘણજ ખાતેથી હાથથી બનાવેલા માટીના વાસણોના જૂના અવશેષો મળ્યા છે.",
      options: ["ફક્ત 1","ફક્ત 2","બંન્ને","એકપણ નહિ"],
      correctAnswer: 2,
      explanation: ""
    },
    {
      id: 3,
      question: "ભારતમાં વણાટકલા બાબતે નીચેના વિધાનોમાંથી કયુ/ કયા વિધાન સાચા/ સાચું છે?\n(1) કાશ્મીર-ગાલીચા (2) પાટણ – પટોળા\n(3) કાંજીવરમ, બનારસ, સાડીઓ (4) રાજસ્થાન- બાંધણીઓ",
      options: ["ફક્ત 1,2 અને 4","ફક્ત 2,3 અને 4","ફક્ત 2 અને 4","1,2,3 અને 4"],
      correctAnswer: 3,
      explanation: ""
    },
    {
      id: 4,
      question: "વૈજયંતીમાલા અને હેમામાલિની કઈ નૃત્યશૈલી સાથે જોડાયેલ છે?",
      options: ["મણિપુરી","કૂચીપુડી","કથકલી","ભરતનાટ્યમ"],
      correctAnswer: 3,
      explanation: ""
    },
    {
      id: 5,
      question: "નીચેના વિધાનો પૈકી ખોટા વિધાન જણાવો.\n(1) ગુજરાતમાં વાઘેલા વંશ દરમિયાન પાટણમાં પટોળુ બનાવનાર અનેક સાળવીઓ આવેને વસ્તા હતા.\n(2) પાટણમાં બનતા “બેવડ ઈક્ત” ઈકત વણાટને પટોળુ કહેવામાં આવે છે.\n(3) ગુજરતામાં વાઘેલા વંશને ગુજરાતનો સુવર્ણયુગ કહેવામાં આવે છે.",
      options: ["ફક્ત 1 અને 3","ફક્ત 2 અને 3","ફક્ત 3","એકપણ નહિ"],
      correctAnswer: 0,
      explanation: ""
    },
    {
      id: 6,
      question: "નીચેના જોડકા જોડો.\nવિભાગ-1\n(1) આદિવાસીઓનું નૃત્ય\n(2) સીદીઓનું નૃત્ય\n(3) બનાસકાંઠાના વાવ વિસ્તારનૃત્ય\n(4) સુરેંદ્રનગર વિસ્તારનું નૃત્ય\nવિભાગ-2\n(a) મેરાયો નૃત્ય\n(b) ચાળો નૃત્ય\n(c) પઢારનૃત્ય\n(d) ધમાલ નૃત્ય",
      options: ["1-B, 2-D, 3-A, 4-C","1-A, 2-B, 3-C, 4-D","1-D, 2-C, 3-B, 4-A","1-B, 2-D, 3-C, 4-A"],
      correctAnswer: 0,
      explanation: ""
    },
    {
      id: 7,
      question: "ભરત ગુંથણ કલા બાબતે નીચેના વિધાનો પૈકી કયુ/કયા વિધાનો સાચું/સાચા છે?\n(1) હડપ્પા અને મોહેંજો દડોના ઉત્ખનન દરમિયાન મળેલ મૂર્તિઓ પર અને પુતળના વસ્ત્રો પર ભરત ગૂંથણકામ જોવા મળતુ હતુ.\n(2) સિંધુ સંસ્કૃતિના સમયે સિંધ, સૌરાષ્ટ્ર અને કચ્છની સ્ત્રી પુરુષોના વસ્ત્રો પર ભરતકામ જોવા મળેલુ છે.",
      options: ["ફક્ત 1","ફક્ત 2","બંન્ને","એકપણ નહિ"],
      correctAnswer: 2,
      explanation: ""
    },
    {
      id: 8,
      question: "મીના કારીગરીનું કૌશલ્ય ધરાવતા કારીગરો નીચેનામાંથી કયા વિસ્તારમાં સવિશેષ જોવા મળે છે?\n(1) જયપુર (2) લખનૌ\n(3) દિલ્હી (4) વારાણસી\n(5) હૈદરાબાદ",
      options: ["ફક્ત 1,2 અને 3","ફક્ત 2,3 અને 4","ફક્ત 1,3 અને 4","1,2,3,4 અને 5"],
      correctAnswer: 3,
      explanation: ""
    },
    {
      id: 9,
      question: "નીચેના જોડકા જોડો.\n(1) તાના રીરી મહોત્સવ (A) ભરતમુનિ\n(2) નાટ્યશાસ્ત્ર (B) કુમિન\n(3) લીલા રંગનો ચણિયો (C) અકીક\n(4) સફેદ રંગનો પત્થર (D) વડનગર",
      options: ["1-d, 2-c, 3-b, 4-a","1-d, 2-a, 3-b, 4-c","1-d, 2-a, 3-c, 4-b","1-a, 2-d, 3-b, 4-c"],
      correctAnswer: 1,
      explanation: ""
    },
    {
      id: 10,
      question: "નીચેનામાંથી વિધાનો પૈકી સાચા વિધાન જણાવો.\n(1) ગુજરાતમાં સંખેડાનું ફર્નિચર અને ઈડરના રમકડા જાણીતા છે.\n(2) રાજસ્થાનનું બિકાનેર ઘરેણાના જડતરકામ માટે જાણીતું છે.",
      options: ["ફક્ત 1","ફક્ત 2","બંન્ને","એકપણ નહો"],
      correctAnswer: 2,
      explanation: ""
    },
    {
      id: 11,
      question: "નીચેના જોડકા જોડો\n(અ)\n(1) મૃણાલિની સારાભાઈ\n(2) ગુરુ પ્રહલાદ શર્મા\n(3) કવિ શ્રી વલ્લભથોલ\n(4) પંડિત શ્રી બિરજુ મહારાજ\n(બ)\n(a) કૂચીપુડી\n(b) ભરતનાટ્યમ\n(c) કથક\n(d) કથકલી",
      options: ["1-b, 2-c, 3-c, 3-d","1-d, 2-c, 3-b, 3-a","1-a, 2-b, 3-c, 4-d","1-b, 2-a, 3-d, 4-c"],
      correctAnswer: 3,
      explanation: ""
    },
    {
      id: 12,
      question: "ભારતમાં ચિત્રકલા બાબતે નીચેના વિધાનો પૈકી સાચા વિધાન જણાવો.\n(1) ભારતમાં પાષણયુગના આદિમાનવના ગુફાચિત્રોમાં પશુ પક્ષીઓના આલેખનો જોવા મળે છે.\n(2) હડપ્પાના લોકો પોતાના માટીના વાસણો પર ફૂલછોડ હરણ અનેક ચિત્રો દોરતા\n(3) અજંતા ઈલોરાના ગુફાચિત્રો ભારતીય ચિત્રકલાનો અજોડ નમૂનો છે.",
      options: ["ફક્ત 1 અને 3","ફક્ત 2 અને 3","ફક્ત 3","આપેલ તમામ"],
      correctAnswer: 2,
      explanation: ""
    },
    {
      id: 13,
      question: "ભારતમાં સંગીતકલા બાબતે નીચેના વિધાનો પૈકી કયુ/કયા વિધાનો સાચા છે.?\n(1) સંગીત મકરંદ નામના ગ્રંથમાં 20 પ્રકારની વિણા અને 101 પ્રકારના તાલનું વર્ણન છે.\n(2) પંડિત વિષ્ણુનારાયણ ભાતખંડે “સંગીત રત્નાકર” એ ભારતીય સંગીતનો સૌથી વધુ પ્રમાણભૂત ગ્રંથ ગણાવે છે.",
      options: ["ફક્ત 1","ફક્ત 2","બંન્ને","એકપણ નહિ"],
      correctAnswer: 1,
      explanation: ""
    },
    {
      id: 14,
      question: "નીચેના જોડકા જોડો\n(અ)\n(1) જરીકામ\n(2) જડતરકામ\n(3) અકીકકામ\n(4) લાકડાના હીંચકા\n(બ)\n(A) બિકાનેર\n(B) ખંભાત\n(C) સંખેડા\n(D) સુરત",
      options: ["1-D, 2-A, 3-C, 4-B","1-D, 2-C, 3-B, 4-A","1-D, 2-A, 3-B, 4-C","1-A, 2-D, 3-B, 4-C"],
      correctAnswer: 2,
      explanation: ""
    },
    {
      id: 15,
      question: "ભારતમાં નૃત્યકલા બાબતે નીચેના વિધાનો પૈકી સાચા વિધાન જણાવો.\n(1) કેરળના શ્રી વલ્લથોળ, કલામંડલમ્ કૃષ્ણપ્રસાદ, શિવારમન એ કથકલી નૃત્યસાથે સંકળાયેલ છે.\n(2) બિરજુમહારાજ સિતારા દેવી અને કુમુદિની લાખિયા કથક નૃત્ય સાથે સંકળાયેલ છે.",
      options: ["ફક્ત 1","ફક્ત 2","બંન્ને","એકપણ નહિ"],
      correctAnswer: 2,
      explanation: ""
    },
    {
      id: 16,
      question: "ગુજરાતના સાંસ્કૃતિક વારસાનાં સ્થળો બાબતે નીચેના વિધાનો પૈકી સાચા વિધાન જણાવો.\n1) સમ્રાટ અશોકનો શિલાલેખ જૂનાગઢમાં આવેલ છે.\n2) મોઢેરાનુ સુર્યમંદિર ભીમદેવ-2 દ્વારા બાંધવામાં આવ્યું હતું.",
      options: ["ફક્ત 2","ફક્ત 1","ફક્ત 1 અને 2","એકપણ નહી"],
      correctAnswer: 1,
      explanation: ""
    },
    {
      id: 17,
      question: "ગુજરાતના સાંસ્કૃતિક વારસાના સ્થળો બાબતે નીચેના સ્થળો પૈકી સાચી જોડ પૈકી કઈ /કયું જોડ સાચી છે?\n1) લોથલ -ધોળકા તાલુકો\n2) ધોળાવીરા – કચ્છ જિલ્લો\n3) રોઝડી અને શ્રીનાથગઢ – રાજકોટ\n4) લાખાબાવળ અને આમરા -ભાવનગર",
      options: ["ફક્ત 1, 2 અને 4","ફક્ત 1, 2 અને 3","ફક્ત 1, 3 અને 4","આપેલ તમામ"],
      correctAnswer: 1,
      explanation: ""
    },
    {
      id: 18,
      question: "નીચેનામાંથી કઈ બાબતની શોધ ભારતમાં થઈ છે?\n1) શૂન્યની શોધ 2) યુદ્ધ શાસ્ત્ર\n3) વિધિ-વિધાન 4) વાસ્તુશાસ્ત્ર\n5) પંચાગ",
      options: ["ફક્ત 1, 3, 4 અને 5","ફક્ત 2 અને 3","ફક્ત 1 અને 3","આપેલ તમામ"],
      correctAnswer: 3,
      explanation: ""
    },
    {
      id: 19,
      question: "ભારતમાં વારસામાં વન્યજીવન બાબતે નીચેના વિધાનો પૈકી કયું/કયાં સાચા /સાચું છે?\n1. વિશ્વમાં એશિયાઈ સિંહો માત્ર ગુજરાતના ગીરના જંગલોમાં જોવા મળે છે.\n2. આપણી રાષ્ટ્રમુદ્રામાં વાઘ, ઘોડો, હાથી તથા બળદની આકૃતિ જોવા મળે છે.",
      options: ["ફક્ત 1","ફક્ત 2","બંન્ને","એકપણ નહી"],
      correctAnswer: 0,
      explanation: ""
    },
    {
      id: 20,
      question: "પ્રાચીનકાળ દરમિયાન ભારતીય સંસ્કૃતિ કઈ બે નદીના કિનારે પોષણ પામી હતી એવું માની શકાય છે?",
      options: ["યમુના અને ગંગા","સિંધુ અને ગંગા","સિંધુ અને રાવી","યમુના અને રાવી"],
      correctAnswer: 2,
      explanation: ""
    },
    {
      id: 21,
      question: "ભારતમાં આર્ય પ્રજાતિ બાબતે નીચેના વિધાનો પૈકી સાચા વિધાન જણાવો.\n1. ભારતની આર્ય સભ્યતાના નિર્માતાઓ નોર્ડિક લોકો હતા.\n2. પ્રાચીન સમયમાં પ્રથમ આર્યવસ્તી વાયવ્ય ભારતમાં હતી.\n3. ઉત્તરવૈદિક કાળમાં આર્યાવ્રતનો પુર્વ મિથિલા સુધી અને દક્ષિણમાં વિંધ્યાચલ સુધી વિસ્તાર હતો.\n4. આર્યોએ ઋચાઓની રચના કરી હતી.",
      options: ["ફક્ત 1,2 અને 3","ફક્ત 2,3 અને 4","ફક્ત 1,2 અને 4","1,2,3 અને 4"],
      correctAnswer: 3,
      explanation: ""
    },
    {
      id: 22,
      question: "દ્રવિડો બાબતે નીચેના વિધાનો પૈકી સાચા વિધનો ધ્યાને લો.\n1. દ્રવિડોમાં પિતૃમૂલક કુટુંબ પ્રથા પ્રચલિત હતી.\n2. ભારતમાં પ્રકૃતિની પૂજા, શિવ પૂજા વગેરે દ્રવિડોની ભેટ છે\n3. તેઓ અવકાશી ગ્રહો અને વિવિધ કલાઓના જાણકાર હતા.",
      options: ["ફક્ત 2 અને 3","ફક્ત 1 અને 3","ફક્ત 1 અને 2","આપેલ તમામ"],
      correctAnswer: 0,
      explanation: ""
    },
    {
      id: 23,
      question: "ભારતમાં આવનાર ઓસ્ટ્રેલૉઇડ પ્રજા બાબતે નીચેના વિધાનો ધ્યાને લો.\n1. આ પ્રજા અગ્નિ એશીયામાંથી આવેલી હતી.\n2. ભારતમાં આવેલા આર્યો તેમને નિષાદ કહેતા હતા.\n3. ભારતની કોલ અને મુંડા જાતિ ,અસમની ખાસી પ્રજામાં આ જાતિના લક્ષણો જોવા મળે છે.",
      options: ["ફક્ત 1 અને 3","ફક્ત 2 અને 3","ફક્ત 3","આપેલ તમામ"],
      correctAnswer: 3,
      explanation: ""
    },
    {
      id: 24,
      question: "નીચેના વિધાનો પૈકી સાચા વિધાન જણાવો.\n1. પોળોના જંગલો – સાબરકાંઠા\n2. જૈન તીર્થ પાલીતાણ – ભાવનગર\n3. ઉતરાધ મહોત્સવ – વડનગર\n4. કાંકરીયા કાર્નિવલ – અમદાવાદ",
      options: ["ફક્ત 1, 3 અને 4","ફક્ત 2, 3 અને 4","ફક્ત 1, 2 અને 4","આપેલ તમામ"],
      correctAnswer: 2,
      explanation: ""
    },
    {
      id: 25,
      question: "નીચેના વિધાનો પૈકી સાચા વિધાન જણાવો.\n1. ભાંગુરિયાનો મેળો છોટા ઉદયપુરના કવાંટ ખાતે ભરાય છે.\n2. ગોળ ગધેડાનો મેળો દાહોદના જેસાવાડા ખાતે ભરાય છે.\n3. કાર્તિકી પૂર્ણિમાનો મેળો સોમનાથના ગિરનાર ખાતે ભરાય છે.",
      options: ["ફક્ત 1 અને 2","ફક્ત 1 અને 3","ફક્ત 3","આપેલ તમામ"],
      correctAnswer: 1,
      explanation: ""
    },
    {
      id: 26,
      question: "ગુજરાતમાં ભરાતા મેળાઓ બાબતે નીચેના વિધાનો પૈકી સાચા વિધાનો ધ્યાને લો..\n1. મોઢેરાનો મેળો – શ્રાવણ વદ અમાસ\n2. બહુચરાજીનો મેળો – ચૈત્ર સુદ પુનમ\n3. શામળાજીનો કાળીયા ઠાકરનો મેળો -કારતક સુદ 11થી પૂનમ\n4. ભાદરવી પૂનમનો મેળો- ભાદરવા વદ પૂનમ",
      options: ["ફક્ત 1 અને 4","ફક્ત 2,3 અને 4","ફક્ત 1,2 અને 3","આપેલ તમામ"],
      correctAnswer: 2,
      explanation: ""
    },
    {
      id: 27,
      question: "પ્રાચીન ભારતના નગર આયોજન બાબતે નીચેના વિધાનો પૈકી ખોટા વિધાન જણાવો.\n1) સામાન્ય નગરજનોના આવાસ ધરાવતું નગર નીચલું નગર કહેવાતું.\n2) શાસક અધિકારીઓનો ગઢ ઊંચાઈ પર બાંધવામાં આવતો હતો.",
      options: ["ફક્ત 1","ફક્ત 2","ફક્ત 1 અને 2","એકપણ નહી"],
      correctAnswer: 3,
      explanation: ""
    },
    {
      id: 28,
      question: "પ્રાચીન નગર મોહેં-જો દડો બાબતે નીચેના વિધાનો પૈકી સાચા વિધાન જણાવો.\n1) મોહેં-જો-દડો અર્થ “માટીનો ઢગલો” થાય છે.\n2) આ નગરની રચના ઈ.સ. 1922માં સર જહોન માર્શલ અને કર્નલ મેકના માર્ગદર્શન નીચે રખાલદાસ બેનરજી અને દયારામ સાહનીએ કરી હતી.",
      options: ["ફક્ત 1","ફક્ત 2","બંન્ને","એકપણ નહી"],
      correctAnswer: 1,
      explanation: ""
    },
    {
      id: 29,
      question: "સ્તુપના અંડાકાર ભાગની ટોચની ચારે બાજુ આવેલી રેલિંગને શું કહે છે?",
      options: ["મહેરાબ","હર્મિકા","મેધિ","તોરણ"],
      correctAnswer: 1,
      explanation: ""
    },
    {
      id: 30,
      question: "નીચેના જોડકા જોડો.\nઅ બ\n1) મોહેંજો- દડો (A) કચ્છ\n2) ધોળાવીરા (B) ઉત્તરપ્રદેશ\n3) આલમગીરપુર (C) મરેલાનો ટેકરો\n4) કાલીબંગન (D) રાજસ્થાન",
      options: ["1-A, 2-B, 3-C, 4-D","1-C, 2-A, 3-B, 4-D","1-D, 2-C, 3-B, 4-A","1-C, 2-A, 3-D, 4-B"],
      correctAnswer: 1,
      explanation: ""
    },
    {
      id: 31,
      question: "નીચેના જોડકા જોડો.\nઅ બ\n1) મલાવ તળાવ (A) સિધ્ધપુર\n2) રુદ્ર મહાલય (B) પાટણ\n3) સહસ્ત્રલિંગ તળાવ (C) વડનગર\n4) કીર્તિતોરણ (D) ધોળકા",
      options: ["1-A, 2-B, 3-C, 4-D","1-D, 2-A, 3-c, 4-B","1-D, 2-C, 3-B, 4-A","1-D, 2-A, 3-B, 4-C"],
      correctAnswer: 3,
      explanation: ""
    },
    {
      id: 32,
      question: "લોથલ બાબતે નીચેના વિધાનો પૈકી સાચા વિધાન પૈકી સાચા વિધાન જણાવો.\n1) લોથલ અમદાવાદ જિલ્લાના ધોળકા તાલુકામાં આવે છે.\n2) લોથલ ધોળકા તાલુકાના ભોગાવો અને સાબરમતી નદીઓના પ્રદેશમાં આવેલું છે.\n3) અહીંથી માનવ વસાહતના ત્રણ થર મળ્યા છે.",
      options: ["ફક્ત 1 અને 2","ફક્ત 2 અને 3","ફક્ત 3","આપેલ તમામ"],
      correctAnswer: 3,
      explanation: ""
    },
    {
      id: 33,
      question: "સિંધુ સભ્યતાના નગરો બાબતે નીચેના પૈકી સાચી જોડ પસંદ કરો.\n1) ઉત્તરપ્રદેશના મેરઠ જિલ્લામાં -આલમગીરીપુર\n2) રાજસ્થાન -રોપર\n3) ગુજરાતમાં -ધોળકા તાલુકામાં ધોળાવીરા\n4) કચ્છમાં -દેશલપુર -શિકારગઢ\n5) રાજકોટના ગોંડલ -શ્રીનાથ ગઢ",
      options: ["ફક્ત 1, 2, 3 અને 4","ફક્ત 1, 4 અને 5","ફક્ત 2, 3 અને 5","આપેલ તમામ"],
      correctAnswer: 1,
      explanation: ""
    },
    {
      id: 34,
      question: "નીચેના જોડકાં જોડો.\n(અ) (બ)\n1) કોણાર્કનું સૂર્યમંદિર (A) મદુરાઈ\n2) મીનાક્ષી મંદિર (B) ગુજરાત\n3) મોઢેરાનું સૂર્યમંદિર (C) રાજસ્થાન\n4) દેલવાડાના દેરા (D) ઓડિસા",
      options: ["1-D, 2-A, 3-C, 4-B","1-A, 2-B, 3-C, 4-D","1-D, 2-A, 3-B, 4-C","1-D, 2-C, 3-A, 4-B"],
      correctAnswer: 2,
      explanation: ""
    },
    {
      id: 35,
      question: "સમ્રાટ અશોકના સમયમાં સ્તુપોમાં નીચેનામાંથી કોનો કોનો સમાવેશ થાય છે?\n1) સાંચીનો સ્તુપ 2) સારનાથનો સ્તુપ\n3) બેરતનો સ્તુપ 4) નંદનગઢનો સ્તુપ\n5) પુરુષપુરનો સ્તુપ 6) દેવની મોરીનો સ્તુપ",
      options: ["ફક્ત 1, 2, 3, 5 અને 6","ફક્ત 1, 3, 5 અને 6","ફક્ત 1, 2, 3, 4 અને 6","આપેલ તમામ"],
      correctAnswer: 2,
      explanation: ""
    },
    {
      id: 36,
      question: "સ્તૂપ વિશે નીચેના વિધાનો પૈકી સાચા વિધાન જણાવો\n1) સ્તૂપની ચારે બાજુઓ ઊંચા રચેલા ગોળાકાર રસ્તાને “હર્મિકા” કહે છે.\n2) સ્તૂપના અંડાકાર ભાગની ટોચની બાજુએ આવેલી રેલિંગ વાડને મેધિ કહે છે.",
      options: ["ફક્ત 1","ફક્ત 2","બંન્ને","એકપણ નહી"],
      correctAnswer: 3,
      explanation: ""
    },
    {
      id: 37,
      question: "નીચેના વિધાનો ધ્યાને લઈ સાચાં વિધાન શોધો\n1) ગુજરાતના પાલિતાણાના શેત્રુંજય પર્વત પર જૈન મંદિરો આવેલા છે.\n2) હઠીસિંહના દેરા -અમદાવાદમાં આવેલા છે.",
      options: ["ફક્ત 1","ફક્ત 2","બંન્ને","એકપણ નહી"],
      correctAnswer: 2,
      explanation: ""
    },
    {
      id: 38,
      question: "ગુફા સ્થાપત્ય બાબતે નીચેના વિધાનો પૈકી કયું / કયા વિધાન સાચું/સાચાં છે?\n1) બાબા પ્યારાની ગુફા – જુનાગઢમાં આવેલી છે. જેમાં પહેલી હારમાં ચાર, બીજી હારમાં સાત અને ત્રીજી હારમાં પાંચ ગુફાઓ આવેલીછે.\n2) ખંભાલીડાની ગુફા રાજકોટ ખાતે આવેલી છે. તે ઈ.સ. 1959માં શોધાઈ હતી.\n3) તળાજાની ગુફા જામનગર જિલ્લાના તળાના ડુંગર પર આવેલ છે અને આ ગુફાઓ 30 ગુફાઓનો સમૂહ છે.",
      options: ["ફક્ત 1 અને 2","ફક્ત 2 અને 3","ફક્ત 1 અને 3","આપેલ તમામ"],
      correctAnswer: 0,
      explanation: ""
    },
    {
      id: 39,
      question: "ગુજરાતની ગુફાઓ બાબતે નીચેના પૈકી સાચી જોડ પસંદ કરી યોગ્ય વિકલ્પ પસંદ કરો.\n1) સાણાગુફા - રાજકોટ\n2) ઢાંક ગુફા - રાજકોટ\n3) કડિયા ડુંગરની ગુફા - જામનગર",
      options: ["ફક્ત 1 અને 2","ફક્ત 2","ફક્ત 2 અને 3","આપેલ તમામ"],
      correctAnswer: 1,
      explanation: ""
    },
    {
      id: 40,
      question: "મહાબલિપુરમ્ ના રથમંદિરો બાબતે નીચેના વિધાનો પૈકી ખોટું વિધાન જણાવો.\n1) સૌથી મોટું રથમંદિર ધર્મરાજનું છે.\n2) સૌથી નાનું રથમંદિર દ્રૌપદીનું છે.",
      options: ["ફક્ત 1","ફક્ત 2","બંન્ને","એકપણ નહી"],
      correctAnswer: 2,
      explanation: ""
    }
  ]
};
