import type { TestData } from "@/types";

export const chapter8Test: TestData = {
  chapterId: "chapter-8",
  chapterTitle: "ટેસ્ટ 8",
  totalQuestions: 40,
  questions: [
    {
      id: 1,
      question: "ભારતમાં સૌપ્રથમ યુનિવર્સિટીઓ કયા શહેરમાં શરૂ થઈ?",
      options: [
        "મુંબઈ, દિલ્હી અને કોલકાતા",
        "મુંબઈ, દિલ્હી અને બેંગલુરુ",
        "મુંબઈ, અમદાવાદ અને દિલ્હી",
        "મુંબઈ, ચેન્નઈ, અને કોલકાતા"
      ],
      correctAnswer: 3,
      explanation: "",
      },
    {
      id: 2,
      question: "નીચેનામાંથી કયું વિધાન ખોટું છે?\n1. ઈ.સ. 1757માં પ્લાસીનું યુદ્ધ થયું.\n2. પ્લાસીના યુદ્ધથી કંપનીને બંગાળના 24 પરગણાની જાગીર મળી\n3. બંગાળના નવાબ સિરાજ-ઉદ્-દૌલાએ પ્લાસીના યુદ્ધમાં ભાગ લીધો.\n4. પ્લાસીના યુદ્ધથી કંપનીને બંગાળ, બિહાર અને ઓડિશાની દિવાની સત્તા મળી.",
      options: [
        "ફક્ત 1",
        "ફક્ત 2",
        "ફક્ત 3",
        "ફક્ત 4"
      ],
      correctAnswer: 3,
      explanation: "",
      },
    {
      id: 3,
      question: "કોર્નવોલિસે ટીપુ સુલતાન સાથે કયો વિગ્રહ કર્યો?",
      options: [
        "ત્રીજો મૈસુર વિગ્રહ",
        "બીજો મૈસુર વિગ્રહ",
        "પહેલો મૈસુર વિગ્રહ",
        "ત્રીજો કર્ણાટક વિગ્રહ"
      ],
      correctAnswer: 0,
      explanation: "",},
    {
      id: 4,
      question: "રાષ્ટ્રસંઘ(યુ.એન.) ની વિધિવત્ સ્થાપના ક્યારે થઈ?",
      options: [
        "16 ડિસેમ્બર, 1945ના રોજ",
        "24 ઓક્ટોબર, 1945ના રોજ",
        "31 જાન્યુઆરી, 1945ના રોજ",
        "24 ઑગસ્ટ, 1945ના રોજ"
      ],
      correctAnswer: 1,
      explanation: "",},
    {
      id: 5,
      question: "ડોમેનિયન સ્ટેટ્સ એટલે શુ ?",
      options: [
        "સાંસ્થાનિક સ્વરાજ્ય",
        "સાંપ્રદાયિકતા",
        "પુર્ણ સ્વરાજ્ય",
        "સરમુખત્યારશાહી"
      ],
      correctAnswer: 0,
      explanation: "",},
    {
      id: 6,
      question: "અંખડ ભારતના બે ભાગલા કરવામાં નીચેનામાથી કઇ યોજનાએ મહત્વનો ફાળો ભજવ્યો હતો.",
      options: [
        "કેબિનેટ મિશન યોજના",
        "ક્રિપ્સ મિશન યોજના",
        "માઉન્ટ બેટન યોજના",
        "ગાંધી-ઇરવિન કરાર"
      ],
      correctAnswer: 2,
      explanation: "",},
    {
      id: 7,
      question: "મુંબઇમાં મળેલી કોંગ્રેસ મહાસમિતિએ “હિંદ છોડો” ને લગતો ઐતિહાસિક ઠરાવ ક્યારે પસાર કર્યો હતો?",
      options: [
        "12 માર્ચ, 1940 ના દિવસે",
        "18 જુલાઇ, 1942 ના દિવસે",
        "7 ઓગસ્ટ 1942ના દિવસે",
        "8 ઓગસ્ટ 1942 ના દિવસે"
      ],
      correctAnswer: 3,
      explanation: "",},
    {
      id: 8,
      question: "કરેંગે યા મરેંગે “ગાંધીજીએ આ સુત્ર ક્યારે ઉચ્ચાર્યું હતુ ?",
      options: [
        "દાંડીયાત્રા વખતે",
        "સવિનય કાનુનભંગની ચળવળ વખતે",
        "હિંદ છોડો ચળવળ",
        "અસહકારના આંદોલન વખતે"
      ],
      correctAnswer: 2,
      explanation: "",},
    {
      id: 9,
      question: "હિન્દુ જમીનદારો અને મુસ્લિમ વચ્ચે થયેલો ‘મોપલા બળવો’ કયા વિસ્તારમાં થયો હતો?",
      options: [
        "સૌરાષ્ટ્ર",
        "મલબાર",
        "કોંકણ",
        "આપેલ તમામ"
      ],
      correctAnswer: 1,
      explanation: "",},
    {
      id: 10,
      question: "મહાત્મા ગાંધી વિશે નીચેના વિધાનો ચકાસો.\n1. તેમને દક્ષિણ આફ્રિકામાં રંગભેદ વિરુદ્ધ સત્યાગ્રહની લડત ચલાવી હતી.\n2. તેમના રાજકીય ગુરુ શ્રીમદ રાજચંદ્ર હતા.\n3. તેમના આધ્યાત્મિક ગુરુ ગોપાલ કૃષ્ણ ગોખલે હતા.\nઉપરોક્ત પૈકી ખોટા વિધાન જણાવો.",
      options: [
        "ફક્ત 1 અને 3",
        "ફક્ત 2 અને 3",
        "ફક્ત 1 અને 2",
        "આપેલ તમામ"
      ],
      correctAnswer: 1,
      explanation: "",
      },
    {
      id: 11,
      question: "નીચેની ઘટનાને યોગ્ય ક્રમ મુજબ ગોઠવો.\n1. મુસ્લિમ લીગની સ્થાપના\n2. મોર્લે-મિન્ટો સુધારા\n3. રોલક્ટ એક્ટ\n4. ચૌરા ચૌરી બનાવ",
      options: [
        "2,3,4,1",
        "4,3,2,1",
        "1,2,3,4",
        "2,1,3,4"
      ],
      correctAnswer: 2,
      explanation: "",
      },
    {
      id: 12,
      question: "ભારતીય લોકજીવન બાબતે નીચેના વિધાનો ધ્યાને લો.\n1. રાજસ્થાનના લોકો મુખ્ય ખોરાક તરીકે બાજરી તથા દાળ-બાટી છે.\n2. મહારાષ્ટ્ર અને ગોવાના દરીયા કિનારા વસતા લોકોનો મુખ્ય ખોરાક માછલા અને ભાત છે.\n3. પંજાબ અને મધ્યપ્રદેશના લોકોનો મુખ્ય પાક ઘઉં છે.\nઉપરોક્ત પૈકી સાચા વિધાન જણાવો.",
      options: [
        "ફક્ત 1 અને 3",
        "ફક્ત 2 અને 3",
        "ફક્ત 3",
        "આપેલ તમામ"
      ],
      correctAnswer: 3,
      explanation: "",},
    {
      id: 13,
      question: "વાતાવરણના વિક્ષોભથી રચાતા તોફાની પવનો સંયુક્ત રાજ્ય અમેરીકામાં કયા નામે ઓળખાય છે ?",
      options: [
        "ટોર્નેડો",
        "હરિકેન",
        "(A) અને (B)",
        "વિલિ-વિલિ"
      ],
      correctAnswer: 2,
      explanation: "",},
    {
      id: 14,
      question: "ત્સુનામીની ઉત્પત્તિ મોટા ભાગે .......?",
      options: [
        "સમુદ્રતળના ભૂકંપો દ્વારા જ થાય છે.",
        "સમુદ્રી ટાપુ ડુબી જવાથી જ થાય છે.",
        "ધોધમાર વર્ષાથી જ થાય છે.",
        "પ્રચંડ વાતાવરણીય તોફાનો દ્વારા જ થાય છે."
      ],
      correctAnswer: 0,
      explanation: "",},
    {
      id: 15,
      question: "વાતાવરણના વિક્ષોભથી રચાતા તોફાની પવનો ભારતીય ઉપમહાદ્વીપમાં કયાં નામે ઓળખાય છે ?",
      options: [
        "ટાઈફૂન",
        "ચક્રવાત",
        "હરિકેન",
        "ટોર્નેડો"
      ],
      correctAnswer: 1,
      explanation: "",},
    {
      id: 16,
      question: "વાતાવરણના વિક્ષોભથી રચાતા તોફાની પવનો જાપાનમાં કયા નામે ઓળખાય છે ?",
      options: [
        "ટોર્નેડો",
        "હરિકેન",
        "ટાઈફૂન",
        "ટેરેઝિના"
      ],
      correctAnswer: 2,
      explanation: "",},
    {
      id: 17,
      question: "26 ડિસેમ્બર 2004ના રોજ કયા મહાસાગરમાં આવેલા મહાવિનાશક ત્સુનામીએ આશરે 2 લાખથી વધારે લોકોનાં ભોગ લીધો હતો ?",
      options: [
        "પેસિફિક મહાસાગર",
        "હિંદમહાસાગર",
        "ઉત્તર એટલાન્ટિક મહાસાગર",
        "દક્ષિણ એટલાન્ટિક મહાસાગર"
      ],
      correctAnswer: 1,
      explanation: "",},
    {
      id: 18,
      question: "ભારતમાં બોલાતી વિવિધ ભાષા બાબતે નીચેના વિધાનો ધ્યાને લો.\n1. આસામ – બોડો\n2. મેઘાલય – ગારો, ખાસી\n3. મિઝોરમ – કોંકણી\nઉપરોક્ત પૈકી સાચા વિધાન જણાવો.",
      options: [
        "ફક્ત 1 અને 3",
        "ફક્ત 2",
        "ફક્ત 1 અને 2",
        "આપેલ તમામ"
      ],
      correctAnswer: 2,
      explanation: "",
      },
    {
      id: 19,
      question: "સત્તુ નામની ખવાતી વિશિષ્ટ વાનગી ભારતમાં કયા રાજ્યમાં ખવાય છે ?",
      options: [
        "ઓડીસા",
        "બિહાર",
        "અસમ",
        "ઉત્તરપ્રદેશ"
      ],
      correctAnswer: 1,
      explanation: "",},
    {
      id: 20,
      question: "તહેવારો – ઉત્સવો બાબતે નીચેના વિધાનો ધ્યાને લો.\n1. આંધ્રપ્રદેશ – કથક\n2. કેરળ – કુચીપુડી\n3. કેરળ – કથકલી\n4. તમિલનાડું – ભરતનાટ્યમ\nઉપરોક્ત પૈકી સાચા વિધાન જણાવો.",
      options: [
        "ફક્ત 1, 3 અને 4",
        "ફક્ત 3 અને 4",
        "ફક્ત 2, 3 અને 4",
        "આપેલ તમામ"
      ],
      correctAnswer: 1,
      explanation: "",
      },
    {
      id: 21,
      question: "The League of Nations રાષ્ટ્રસંઘની સ્થાપના ક્યારે કરવામાં આવી હતી?",
      options: [
        "10 ઓગસ્ટ 1920",
        "10 જાન્યુઆરી 1920",
        "10 જુલાઈ 1920",
        "10 જાન્યુઆરી 1945"
      ],
      correctAnswer: 1,
      explanation: "",},
    {
      id: 22,
      question: "રાષ્ટ્રસંઘના ઉદ્દેશોમાં નીચેનામાંથી કોનો સમાવેશ થતો નથી?",
      options: [
        "આંતરરાષ્ટ્રીય શાંતિ અને સલામતીની જાળવણી",
        "દરેક રાષ્ટ્ર અન્ય રાષ્ટ્રની અખંડિતતા જાળવવી",
        "આંતરરાષ્ટ્રીય ઝઘડાઓને શાંતિમય રીતે કે મધ્યસ્થી દ્વારા ઉકેલ લાવવો.",
        "આંતરરાષ્ટ્રીય સંબંધોનો અસ્વીકાર કરવો."
      ],
      correctAnswer: 3,
      explanation: "",},
    {
      id: 23,
      question: "અંગ્રેજ શાસન વખતે કયો નવો પક્ષ સ્થપાતા સ્વરાજ પક્ષની પ્રતિષ્ઠા ઉતરી ગઈ હતી?",
      options: [
        "નેશનલ પાર્ટી",
        "ઇન્ડિયન નેશનલ પાર્ટી",
        "ગદર પાર્ટી",
        "ફ્રીડમ પાર્ટી"
      ],
      correctAnswer: 0,
      explanation: "",},
    {
      id: 24,
      question: "કઈ સ્ટીમરોની ઘટનાને ક્રાંતિકારીઓએ વિદેશમાં અંગ્રેજો વિરુદ્ધ લાગણી જાગૃત કરવામાં પ્રેરકબળ પૂરું પાડ્યું હતું ?",
      options: [
        "સોમામારું અને તોશામારું",
        "સુલામારું અને તોશામારું",
        "કામાગાટામારુ અને તોશામારું",
        "સોલામારુ અને તોશામારું"
      ],
      correctAnswer: 2,
      explanation: "",},
    {
      id: 25,
      question: "ભારતનાં દેશી રાજ્યોનું ભારતસંઘમાં વિલિનીકરણમાં કોને રાજકીય એકતા સિદ્ધ કરી હતી ?",
      options: [
        "ડો. રાજેન્દ્ર પ્રસાદ",
        "ગાંધીજી",
        "સરદાર વલ્લભભાઈ પટેલ",
        "જવાહરલાલ નહેરુ"
      ],
      correctAnswer: 2,
      explanation: "",},
    {
      id: 26,
      question: "નીચેના વિધાનો પૈકી કયું / કયાં વિધાનો સાચા છે જણાવો.\n1. અમેરિકા અને ઈંગ્લેન્ડના નેતૃત્વ હેઠળ નાટો, સિયાટો અને સેન્ટો ની સ્થાપના થઇ હતી.\n2. ઈ.સ. 1955માં ઇન્ડોનેશિયાના બાંડુંગ ખાતે તટસ્થ રાષ્ટ્રોની પરિષદ યોજાઈ હતી.\nઉપરોક્ત પૈકી સાચા વિધાન જણાવો.",
      options: [
        "ફક્ત 1",
        "ફક્ત 2",
        "બંને સાચા",
        "આપેલ તમામ"
      ],
      correctAnswer: 2,
      explanation: "",},
    {
      id: 27,
      question: "નીચેના વિધાનો ધ્યાને લો.\n1. 25મી એપ્રિલ 1960ના રોજ મહારાષ્ટ્ર રાજ્યની રાજધાની મુંબઈ નક્કી કરાઈ હતી.\n2. 1 મે 1961ના રોજ ગુજરાત રાજ્યની સ્થાપના થઈ હતી.\nઉપરોક્ત પૈકી સાચા વિધાન જણાવો.",
      options: [
        "ફક્ત 1",
        "ફક્ત 2",
        "બંને",
        "એકપણ નહિ"
      ],
      correctAnswer: 0,
      explanation: "",
      },
    {
      id: 28,
      question: "લોખંડ, તાંબુ, જસત, સોનું ચાંદી વગેરે ખનીજો કયા ખડકમાંથી મળે છે?",
      options: [
        "રૂપાંતરિત",
        "આગ્નેય",
        "પ્રસ્તર",
        "રાસાયણિક"
      ],
      correctAnswer: 1,
      explanation: "",},
    {
      id: 29,
      question: "બધા જ નાણાકીય ખરડાની સૌપ્રથમ કયા ગૃહમાં રજૂ કરવામાં આવે છે?",
      options: [
        "રાજ્યસભામાં",
        "વિધાન પરિષદમાં",
        "લોકસભામાં",
        "સંસદ"
      ],
      correctAnswer: 2,
      explanation: "",},
    {
      id: 30,
      question: "ભારતના બંધારણમાં તદાર્થ ન્યાયાધીશ ની નિયુક્તિની જોગવાઈ છે.......",
      options: [
        "સર્વોચ્ચ ન્યાયાલયમાં",
        "ઉચ્ચ ન્યાયાલયમાં",
        "સત્ર ન્યાયાલયોમાં",
        "ઉપરોક્ત બધામાં"
      ],
      correctAnswer: 0,
      explanation: "",},
    {
      id: 31,
      question: "સર્વોચ્ચ અદાલતના ન્યાયાધીશો અને વડી અદાલતના ન્યાયાધીશોની નિવૃત્તિ વય કેટલી હોય છે?",
      options: [
        "65 અને 58",
        "65 અને 60",
        "60 અને 65",
        "65 અને 62"
      ],
      correctAnswer: 3,
      explanation: "",},
    {
      id: 32,
      question: "વિશ્વના કયાં ખંડમાથી કર્કવૃત્ત, વિષુવૃત્ત અને મકરવૃત્ત ત્રણેય એકસાથે પસાર થાય છે ?",
      options: [
        "ઉત્તર અમેરીકા",
        "એશિયા",
        "આફ્રિકા",
        "દક્ષિણ અમેરીકા"
      ],
      correctAnswer: 2,
      explanation: "",},
    {
      id: 33,
      question: "ભારતના પૂર્વ અને પશ્ચિમ છેડે આવેલા સ્થળોના સ્થાનિક સમયમાં આશરે કેટલા સમયનો ફેરફાર છે.",
      options: [
        "અડઘા કલાકનો",
        "બે કલાકનો",
        "દોઢ કલાકનો",
        "એક કલાકનો"
      ],
      correctAnswer: 1,
      explanation: "",},
    {
      id: 34,
      question: "ગંગાને મળતી મુખ્ય નદીઓ કઈ કઈ છે ?",
      options: [
        "યમુના, ચંબલ, ઘાઘરા અને કોસી",
        "યમુના, ઘાઘરા, શરાવતી, અને કોસી",
        "નર્મદા, ઘાઘરા, ગંડક અને કોસી",
        "યમુના, ઘાઘરા, ગંડક અને કોસી"
      ],
      correctAnswer: 3,
      explanation: "",},
    {
      id: 35,
      question: "નીચેના વિધાનોમાંથી કયું/કયાં વિધાન સાચું/સાચાં છે?\n1. ભારત અને યુરોપ વચ્ચે વ્યાપાર માત્ર જમીન માર્ગે થતો હતો.\n2. તુર્ક મુસ્લિમોએ કોન્સ્ટેન્ટિનોપલ ઈ.સ. 1453માં જીતી લીધું.\n3. ભારતના મરીમસાલા, મલમલ, રેશમી કાપડ, ગળી વગેરેની યુરોપના દેશોમાં ખૂબ જ માંગ રહેતી.",
      options: [
        "માત્ર 1 અને 2",
        "માત્ર 2 અને 3",
        "1, 2 અને 3",
        "એકપણ નહી"
      ],
      correctAnswer: 1,
      explanation: "",},
    {
      id: 36,
      question: "જોડકા જોડો.\n1. “મીઠા ઝેર” જેવી યોજના \n2. મૈસુરનો વાઘ \n3. બાળલગ્ન પ્રતિબંધક ધારો ઘડનાર \n4. કાલિકટનો રાજા \n(A) ટીપુ સુલતાન \n(B) ડેલહાઉસી \n(C) ઝામોરિન \n(D) વેલેસ્લી",
      options: [
        "1-D, 2-A, 3-B, 4-C",
        "1-B, 2-C, 3-D, 4-A",
        "4-A, 2-D, 3-C, 4-B",
        "1-B, 2-C, 3-A, 4-D"
      ],
      correctAnswer: 0,
      explanation: "",},
    {
      id: 37,
      question: "ઈંગ્લેન્ડે ભારતમાં પગદંડો જમાવ્યા પછી તેના પાડોશી દેશોમાં પણ ઈંગ્લેન્ડે સામ્રાજ્ય સ્થાપ્યું તે અંગેની કઈ ગોઠવણી સાચી છે?",
      options: [
        "શ્રીલંકા, મ્યાનમાર, સિંગાપુર, મલાયા",
        "બાંગ્લાદેશ, નેપાળ, ભૂતાન, ચીન",
        "ઈરાન, ઈરાક, કુવૈત, બેહરિન",
        "મલક્કા, માલદીવ, થાઈલેન્ડ"
      ],
      correctAnswer: 0,
      explanation: "",},
    {
      id: 38,
      question: "વર્સેલ્સની સંધિ બાબતે નીચેના વિધાનો ધ્યાને લો.\n1. ર્હાઈન નદી આંતરરાષ્ટ્રીય જળમાર્ગ માટે ખુલ્લી મુકવામાં આવી હતી.\n2. જર્મનીએ રુહર પ્રાંત જેવા પ્રદેશો ફ્રાન્સને આપવા પડ્યા હતા.\n3. આલ્સેસ અને લોરેન્સ પ્રાંત ફ્રાન્સને પરત કરવામાં આવ્યા હતા.\n4. વર્સેલ્સની સંધિ જુન (1918) માં કરવામાં આવી હતી.\nઉપરોક્ત પૈકી કયું / કયાં વિધાન સાચું / સાચાં છે.",
      options: [
        "ફક્ત 2,3 અને 4",
        "ફક્ત 2 અને 4",
        "ફક્ત 1, 2 અને 3",
        "આપેલ તમામ"
      ],
      correctAnswer: 2,
      explanation: "",
      },
    {
      id: 39,
      question: "ગુજરાતમાં ક્રાંતિકારી ચળવળ બાબતે નીચેના વિધાનો ધ્યાને લો.\n1. અરવિંદ ઘોષે ભવાની મંદિર નામના પુસ્તકમાં ક્રાંતિકારી યોજના આલેખી હતી.\n2. ચાંદોદ કરનાળી પાસે ગંગનાથ વિદ્યાલય ની સ્થાપના કરવામાં આવી હતી.\n3. અમદાવાદમાં રાયપુર દરવાજા બહાર વાઇસરોય મિન્ટો ની બગી પર બૉમ્બ નાખવાનો ક્રાંતિકારી બનાવ ગુજરાતમાં બન્યો હતો.\nઉપરોક્ત પૈકી કયું / કયાં વિધાન સાચું / સાચાં છે.",
      options: [
        "માત્ર 1 સાચું",
        "2 અને 3 સાચાં",
        "1 અને 3 સાચાં",
        "તમામ સાચાં છે."
      ],
      correctAnswer: 3,
      explanation: "",},
    {
      id: 40,
      question: "મુંબઈમાં મળેલી કોંગ્રેસ મહાસમિતિએ “હિંદ છોડો” ને લગતો ઐતિહાસિક ઠરાવ ક્યારે પસાર કર્યો હતો?",
      options: [
        "12 માર્ચ, 1940 ના દિવસે",
        "18 જુલાઇ, 1942 ના દિવસે",
        "7 ઓગસ્ટ 1942ના દિવસે",
        "8 ઓગસ્ટ 1942 ના દિવસે"
      ],
      correctAnswer: 3,
      explanation: "",}
  ]
};
