import type { TestData } from "@/types";

export const chapter4Test: TestData = {
  chapterId: "chapter-4",
  chapterTitle: "ટેસ્ટ 4",
  totalQuestions: 40,
  questions: [
    {
      id: 1,
      question: "નીચેના જોડકા જોડો.\n(A) ભાવનગરના મહારાજા કૃષ્ણકુમારસિંહ (1) કનૈયાલાલ મુનશી\n(B) હૈદરાબાદના જોડાણમાં અગત્યની ભૂમિકા (2) 'જવાબદાર સરકાર' પગલુ\n(C) જૂનાગઢ (3) આરઝી હકૂમત\n(D) 'રાજ્ય પુનરરચનાપંચ'ના સભ્ય (4) હૃદયનાથ કુંઝરુ",
      options: [
        "(1-2), (2-1), (3-3), (4-4)",
        "(1-1), (2-2), (3-3), (4-4)",
        "(1-4), (2-1), (3-3), (4-2)",
        "(1-1), (2-2), (3-3), (4-4)"
      ],
      correctAnswer: 0,
      explanation: "",
      },
    {
      id: 2,
      question: "નીચેના જોડકા જોડો.\n(1) ઈ. સ. 1948 (A) ભારતના રાજ્યબંધારણનો અમલ થયો\n(2) ઈ. સ. 1950 (B) હૈદરાબાદને ભારતીય સંઘમાં ભેળવી દીધું\n(3) ઈ. સ. 1953 (C) હૈદરાબાદ રાજ્યને આંધ્ર પ્રદેશમાં સમાવવામાં આવ્યું\n(4) ઈ. સ. 1956 (D) 'રાજ્ય પુનર્રચનાપંચ'ની રચના થઇ",
      options: [
        "(1-2), (2-1), (3-4), (4-3)",
        "(1-3), (2-1), (3-4), (4-2)",
        "(1-4), (2-1), (3-2), (4-3)",
        "(1-2), (2-4), (3-1), (4-3)"
      ],
      correctAnswer: 0,
      explanation: "",
      },
    {
      id: 3,
      question: "સ્વતંત્રતા મળ્યા બાદ ભારતના તત્કાલીન ગૃહપ્રધાન તરીકે કોની નિમણૂક થઈ હતી?",
      options: [
        "સુભાષચંદ્ર બોઝની",
        "વડોદરાના ગાયકવાડની",
        "સરદાર વલ્લભભાઈ પટેલની",
        "મોતીલાલ નેહરુની"
      ],
      correctAnswer: 2,
      explanation: "",
      },
    {
      id: 4,
      question: "ભારતની ઉત્તર-પૂર્વ દિશામાં રચાયેલાં રાજ્યોને કયા નામે ઓળખવામાં આવે છે?",
      options: [
        "'સેવન સિસ્ટર્સ' (સાત બહેનો)",
        "'ગિરિવૃંદો'",
        "'સપ્તક રાજ્યો'",
        "'ગિરિબહેનો'"
      ],
      correctAnswer: 0,
      explanation: "",
      },
    {
      id: 5,
      question: "નીચેનામાંથી કયાં બે રાજ્યો 'સેવન સિસ્ટર્સ'માંનાં રાજ્યો નથી?",
      options: [
        "મણિપુર, અસમ",
        "ત્રિપુરા, અરુણાચલ પ્રદેશ",
        "મિઝોરમ, નાગાલૅન્ડ",
        "ઉત્તરાખંડ, ઝારખંડ"
      ],
      correctAnswer: 3,
      explanation: "",
      },
    {
      id: 6,
      question: "હૈદરાબાદને ભારતીય સંઘ સાથે વિલીનીકરણ કરવામાં સરદાર પટેલની સાથે કોણે મહત્ત્વની ભૂમિકા ભજવી હતી?",
      options: [
        "કનૈયાલાલ મુનશીએ",
        "લાલબહાદુર શાસ્ત્રીએ",
        "વી. પી. મેનને",
        "જયપ્રકાશજીએ"
      ],
      correctAnswer: 0,
      explanation: "",
      },
    {
      id: 7,
      question: "'આરઝી હકૂમત'ની સ્થાપના કોણે કરી?",
      options: [
        "શામળદાસ ગાંધીએ",
        "ભારત સરકારે",
        "જૂનાગઢના નાગરિકોએ",
        "રતુભાઈ અદાણીએ"
      ],
      correctAnswer: 2,
      explanation: "",
      },
    {
      id: 8,
      question: "નીચેના રાજ્ય અને તેની રાજધાની બાબતે નીચેના વિધાનો ધ્યાને લો.\n1) ઓડિશા - ભુવનેશ્વર\n2) મેઘાલય – શિલોંગ\n3) મિઝોરમ - આઈઝોલ\n4) નાગાલેન્ડ - ઈમ્ફાલ\n5) આંધ્રપ્રદેશ - બેંગલુરુ\n6) તેલંગણા - વિશાખાપટ્ટનમ\nઉપરોક્ત પૈકી સાચા વિધાન જણાવો.",
      options: [
        "ફક્ત 1, 2, 4, 5 અને 6",
        "ફક્ત 1, 2 અને 3",
        "ફક્ત 3, 4, 5 અને 6",
        "1, 2, 3, અને 4"
      ],
      correctAnswer: 1,
      explanation: "",
      },
    {
      id: 9,
      question: "નીચેના વિધાનો પૈકી સાચું વિધાન જણાવો.\n1) આર્યભટ્ટ વર્ષ 1975માં છોડેલ ભારતનો પ્રથમ ઉપગ્રહ હતો.\n2) ભાસ્કર અને રોહિણી નામના ગ્રહો વર્ષ 1979માં છોડેલ હતા.",
      options: [
        "ફક્ત 1",
        "ફક્ત 2",
        "બંને સાચા",
        "એકપણ નહિ"
      ],
      correctAnswer: 2,
      explanation: "",
      },
    {
      id: 10,
      question: "નીચેના વિધાનો પૈકી ખોટા વિધાન જણાવો.\n1) રસાયણશાસ્ત્ર ક્ષેત્રે જાનકી અમ્મા સંકળાયેલ છે.\n2) વનસ્પતિ ક્ષેત્રે અસીમા ચેટરજી સંકળાયેલ છે.\n3) ડૉ. ઈન્દિરા આહુજા તબીબી ક્ષેત્રે સંકળાયેલ છે.",
      options: [
        "ફક્ત 1 અને 2",
        "ફક્ત 2 અને 3",
        "ફક્ત 3",
        "આપેલ તમામ"
      ],
      correctAnswer: 0,
      explanation: "",
      },
    {
      id: 11,
      question: "નીચેના વિધાનો પૈકી સાચા વિધાન જણાવો.\n1) રાજકોટમાં મુંબઈના નાગરિકોએ જૂનાગઢને ભારતસંઘમાં જોડાવા માટે આરઝી હકુમતની સ્થાપના કરી હતી.\n2) હૈદરાબાદ રાજ્યના નિઝામે પોતાના રાજ્યને 15 ઓગસ્ટના રોજ સ્વતંત્ર જાહેર કર્યું હતું.\n3) બ્રિટિશ પાર્લમેન્ટે હિંદ સ્વાતંત્ર્ય ધારો જુલાઈ 1947માં પસાર કર્યો હતો.",
      options: [
        "ફક્ત 1 અને 3",
        "ફક્ત 3",
        "ફક્ત 2 અને 3",
        "આપેલ તમામ"
      ],
      correctAnswer: 2,
      explanation: "",
      },
    {
      id: 12,
      question: "નીચેના વિધાનો ધ્યાને લો.\n1) હૈદરાબાદમાં ભારત સરકારે પોલીસ પગલું ભરી હૈદરાબાદને ભારતીય સંઘમાં ભેળવી દીધું.\n2) જુનાગઢને લોકમત દ્વારા ભારત સંઘમાં સામેલ કરેલ.\n3) ઓપરેશન વિજય દ્વારા ગોવાને ભારત સંઘમાં સામેલ કરેલ.\nઉપરોક્ત પૈકી ખોટા વિધાન જણાવો.",
      options: [
        "ફક્ત 1",
        "ફક્ત 2 અને 3",
        "ફક્ત 2",
        "એકપણ નહિ"
      ],
      correctAnswer: 3,
      explanation: "",
      },
    {
      id: 13,
      question: "નીચેના વિધાનો ધ્યાને લો.\n1) ભારતના બંધારણમાં 12માં સુધારા મુજબ ગોવા, દીવ, દમણ અને દાદરા નગરહવેલી ભારત સંઘમાં જોડી દેવામાં આવ્યા છે.\n2) જૂનાગઢ દિવસ 9 નવેમ્બર 1947ના રોજ ઉજવાય છે.\nઉપરોક્ત પૈકી સાચા વિધાન જણાવો.",
      options: [
        "ફક્ત 1",
        "ફક્ત 2",
        "બંને",
        "એકપણ નહિ"
      ],
      correctAnswer: 2,
      explanation: "",
      },
    {
      id: 14,
      question: "નવા રાજ્યોની રચના બાબતે નીચેના વિધાનો ધ્યાને લો.\n1) ભારત સ્વતંત્ર થયુ ત્યારે (બ) વર્ગના કુલ આઠ રાજ્યો હતા.\n2) ભારત-સ્વતંત્રતા વખતે (ક) વર્ગના કુલ દસ રાજ્યો હતા.\n3) (ડ) વર્ગના રાજ્યોમાં અંદમાન અને નિકોબાર ટાપુનો સમાવેશ થતો હતો.\nઉપરોક્ત પૈકી સાચા વિધાન જણાવો.",
      options: [
        "ફક્ત 1 અને 3",
        "ફક્ત 2 અને 3",
        "ફક્ત 3",
        "આપેલ તમામ"
      ],
      correctAnswer: 3,
      explanation: "",
      },
    {
      id: 15,
      question: "બંધારણ ના આમુખ બાબતે નીચેના વિધાનો ધ્યાને લો.\n1) અમેરિકન પદ્ધતિમાંથી પ્રેરણા લઇને ભારતે તેના આમુખની શરૂઆત કરવાનુ પંસદ કર્યુ છે.\n2) તે ભારતના બંધારણનો આત્મા છે.\n3) તે સરકારના કોઇપણ કાયદા અને કાર્યવાહીની તપાસ અને મુલ્યાંકન કરવા માટે એક ધોરણ પ્રદાન કરે છે.\nઉપરોક્ત પૈકી સાચા વિધાન જણાવો.",
      options: [
        "ફક્ત 1 અને 3",
        "ફક્ત 2 અને 3",
        "ફક્ત 3",
        "આપેલ તમામ"
      ],
      correctAnswer: 3,
      explanation: "",
      },
    {
      id: 16,
      question: "બંધારણીય સુધારા દ્વારા આમુખમાં કયા શબ્દ ઉમેરવામાં આવે છે?",
      options: [
        "સાર્વભૌમ અને લોકશાહી",
        "સમાજવાદી અને બિનસાંપ્રદાયિક",
        "પ્રજાસત્તાક અને અભિન્ન",
        "સ્વતંત્રતા અને સમાનતા"
      ],
      correctAnswer: 1,
      explanation: "",
      },
    {
      id: 17,
      question: "આમુખમાં નીચેનામાંથી કયા ન્યાયનો સમાવેશ થયો છે?\n1) સામાજિક\n2) આર્થિક\n3) રાજકિય\n4) વિચાર\n5) અભિવ્યક્તિ\n6) સમાજવાદી",
      options: [
        "ફક્ત 1, 2 અને 3",
        "ફક્ત 2, 3, 4 અને 6",
        "ફક્ત 1, 2, 3, 4 અને 5",
        "આપેલ તમામ"
      ],
      correctAnswer: 0,
      explanation: "",
      },
    {
      id: 18,
      question: "નીચેના વિધાનો ધ્યાને લો.\n1) બંધારણ એ દેશનાં પાયાનો મહત્વનો દસ્તાવેજ છે.\n2) બંધારણ સભામાં કુલ 389 સભ્યો હતા.\n3) ભારતના બંધારણ ને બનતા બે વર્ષ અગિયાર માસ અને 18 દિવસ નો સમય લાગ્યો હતો.\nઉપરોક્ત પૈકી સાચા વિધાન જણાવો.",
      options: [
        "ફક્ત 1 અને 3",
        "ફક્ત 2 અને 3",
        "ફક્ત 3",
        "આપેલ તમામ"
      ],
      correctAnswer: 3,
      explanation: "",
      },
    {
      id: 19,
      question: "બંધારણની ઘડતર પ્રક્રિયા બાબતે નીચેના વિધાનો ધ્યાને લો.\n1) બંધારણની મુસદ્દા સમિતિના અધ્યક્ષ ડૉ. ભીમરાવ આંબેડકર હતા.\n2) બંધારણની પ્રક્રિયા કુલ 162 બેઠકો દરમિયાન પુરી કરવામાં આવી હતી.\n3) બધારણ પ્રથમ 295 અનુચ્છેદ અને 12 પરિશિષ્ટ હતા.\nઉપરોક્ત પૈકી ખોટા વિધાન જણાવો.",
      options: [
        "ફક્ત 1",
        "ફક્ત 2 અને 3",
        "ફક્ત 1 અને 3",
        "આપેલ તમામ"
      ],
      correctAnswer: 1,
      explanation: "",
      },
    {
      id: 20,
      question: "બંધારણની ઘડતર પ્રક્રિયા બાબતે નીચેના વિધાનો ધ્યાને લો.\n1) ભારતમાં 26મી જાન્યુઆરી 1950માં બંધારણ અમલમાં આવ્યુ હતુ.\n2) ભારતની આઝાદી પહેલા બ્રિટિશ સરકાર દ્વારા 25મી એપ્રિલ 1946ના રોજ ચાર સભ્યોનું કેબિનેટ મિશન ભારતમાં સોપવામાં આવ્યુ હતુ.\nઉપરોક્ત પૈકી સાચા વિધાન જણાવો.",
      options: [
        "ફક્ત 1",
        "ફક્ત 2",
        "બંને",
        "એકપણ નહિ"
      ],
      correctAnswer: 0,
      explanation: "",
      },
    {
      id: 21,
      question: "ભારતના નવા રાજ્યોની રચના બાબતે નીચેના વિધાનો ધ્યાને લો.\n1) મુંબઈ, આસામ, પંજાબ, ઉત્તરપ્રદેશ, બિહાર - (અ) વર્ગના રાજ્યો\n2) હૈદરાબાદના, રાજસ્થાન, સૌરાષ્ટ્ર, ત્રાવણકોર - (બ) વર્ગના રાજ્યો\n3) ત્રિપુરા, મણિપુર, કચ્છ, કૂર્ગ, ભોપાલ - (ક) વર્ગના રાજ્યો\nઉપરોક્ત પૈકી ખોટું વિધાન પસંદ કરો.",
      options: [
        "ફક્ત 1",
        "ફક્ત 2",
        "ફક્ત 3",
        "એકપણ નહી"
      ],
      correctAnswer: 3,
      explanation: "",
      },
    {
      id: 22,
      question: "નીચેના વિધાનો ધ્યાને લો.\n1) ગણિતશાસ્ત્રમાં માનવ સંગણક તરીકે શકુંતલા દેવી નામના ધરાવે છે.\n2) સર. એમ વિશ્વૈશ્વરૈયા ઈજનેરી ક્ષેત્રે મહત્વનો ફાળો ધરાવે છે.\n3) મેટ્રો રેલવે પ્રોજેક્ટને સફળ બનાવનાર ડો. રાજા રમન્ના હતા.\nઉપરોકત પૈકી સાચા વિધાન જણાવો.",
      options: [
        "ફક્ત 1 અને 3",
        "ફક્ત 2 અને 3",
        "ફક્ત 1 અને 2",
        "આપેલ તમામ"
      ],
      correctAnswer: 2,
      explanation: "",
      },
    {
      id: 23,
      question: "રાજ્ય અને તેની રાજધાની બાબતે નીચેના વિધાનો ધ્યાને લો.\n1) ત્રિપુરા - અગરતલા\n2) કેરલ - તિરુવનંતપુરમ\n3) અરુણાચલ પ્રદેશ – ઈટાનગર\n4) ઉત્તરાખંડ – દેહરાદૂન\n5) ઝારખંડ - રાંચી\nઉપરોક્ત પૈકી ખોટા વિધાન જણાવો.",
      options: [
        "ફક્ત 1 અને 5",
        "ફક્ત 1, 3 અને 5",
        "આપેલ તમામ",
        "એકપણ નહી"
      ],
      correctAnswer: 3,
      explanation: "",
      },
    {
      id: 24,
      question: "નવા રાજ્યોની રચના બાબતે નીચેના વિધાનો ધ્યાને લો.\n1) વર્ષ 2000માં બિહારમાંથી ઝારખંડ રાજ્યની રચના\n2) વર્ષ 2000માં મધ્યપ્રદેશમાંથી છત્તીસગઢ રાજ્યની રચના\n3) વર્ષ 2000માં ઉત્તરપ્રદેશમાંથી ઉત્તરાખંડ રાજ્યની રચના\nઉપરોક્ત પૈકી સાચા વિધાન જણાવો.",
      options: [
        "ફક્ત 1 અને 3",
        "ફક્ત 2 અને 3",
        "ફક્ત 3",
        "આપેલ તમામ"
      ],
      correctAnswer: 3,
      explanation: "",
      },
    {
      id: 25,
      question: "નીચેના વિધાનો ધ્યાને લો.\n1) 25મી એપ્રિલ 1960ના રોજ મહારાષ્ટ્ર રાજ્યની રાજધાની મુંબઈ નક્કી કરાઈ હતી.\n2) 1 મે 1961ના રોજ ગુજરાત રાજ્યની સ્થાપના થઈ હતી.\nઉપરોક્ત પૈકી સાચા વિધાન જણાવો.",
      options: [
        "ફક્ત 1",
        "ફક્ત 2",
        "બંને",
        "એકપણ નહિ"
      ],
      correctAnswer: 0,
      explanation: "",
      },
    {
      id: 26,
      question: "માનવ હકો બાબતે નીચેના વિધાનો ધ્યાને લો.\n(1) માનવ હકો લોકશાહી દેશના તેના નાગરિકોને આપવામાં આવ્યા છે અને કોઈ પણ નાગરિક ભોગવી શકે છે.\n(2) વ્યક્તિનો મનુષ્ય તરીકે જન્મ થતાંની સાથે જ તે કેટલાક હકોનો હકદાર બને છે.\n(3) માનવહકો મૂળભૂત માનવ અધિકારો અને લોકશાહી શાસનપ્રથાની પાયાની ઓળખ છે.\nઉપરોક્ત પૈકી સાચા વિધાન જણાવો.",
      options: [
        "ફક્ત 1 અને 3",
        "ફક્ત 2 અને 3",
        "ફક્ત 1 અને 2",
        "આપેલ તમામ"
      ],
      correctAnswer: 3,
      explanation: "",
      },
    {
      id: 27,
      question: "ડૉ.બાબાસાહેબે કયા હકને બંધારરણનો આત્મા કહ્યો છે?",
      options: [
        "સાંસ્કૃતિક અને શૈક્ષણિક હક",
        "વાણી સ્વાતંત્ર્યનો હક",
        "માહિતી મેળવવાનો હક",
        "બંધારણીય ઈલાજોનો હક"
      ],
      correctAnswer: 3,
      explanation: "",
      },
    {
      id: 28,
      question: "14 કે તેથી ઓછી ઉંમરનો બાળકને જોખમકાર્ય જગ્યાએ મજુરીએ રાખવામાં આવે તો ક્યા કાનુન હેઠળ સજાપાત્ર ગુનો બને છે?",
      options: [
        "નાગરિક વિરોધી કાનુન",
        "શિક્ષણ વિરોધી કાનુન",
        "બાળમજુરી કાનુન",
        "માનવતા વિરોધી કાનુન"
      ],
      correctAnswer: 2,
      explanation: "",
      },
    {
      id: 29,
      question: "મૂળભૂત હકો બાબતે નીચેના વિધાનો પૈકી કયુ/કયાં વિધાન સાચા છે?\n(1) કાયદા સમક્ષ સમાનતા અને કાયદાનું સમાન રક્ષણ આ બે ખ્યાલો સમાનતાના હકમાં ઉમેરાયેલ છે.\n(2) રાષ્ટ્રની સ્થિરતા, વ્યક્તિ સ્વાતંત્રતાના રક્ષણ તથા સરમુખત્યાર શાહીના રક્ષણ માટે મૂળભૂત હકો જરૂરી છે.\n(3) બંધારણ દ્વારા ભારતીય નાગરિકોને આઠ પ્રકારની સ્વતંત્રાઓ બક્ષવામાં આવી છે.",
      options: [
        "ફક્ત 1 અને 3",
        "ફક્ત 1 અને 2",
        "ફક્ત 3",
        "આપેલ તમામ"
      ],
      correctAnswer: 1,
      explanation: "",
      },
    {
      id: 30,
      question: "દર વર્ષે 10 ડિસેમ્બરને ક્યા દિન તરીકે ઉજવવામાં આવે છે?",
      options: [
        "સાક્ષરતા દિન",
        "માનવ દિન",
        "માનવહક દિન",
        "મહિલા વિકાસદિન"
      ],
      correctAnswer: 2,
      explanation: "",
      },
    {
      id: 31,
      question: "મૂળભૂત હકોમાં નીચેનામાંથી કોનો કોનો સમાવેશ થાય છે?\n(1) સમાનતાનો હક\n(2) સ્વતંત્રતાનો હક\n(3) મિલકતનો હક\n(4) શોષણ સામેનો હક\n(5) સાંસ્કૃતિક અને શૈક્ષણિક હક\n(6) બંધારણીય ઈલાજોનો હક",
      options: [
        "ફક્ત 1, 2, 3 અને 4",
        "ફક્ત 2, 3, 4 અને 5",
        "ફક્ત 1, 2, 4, 5 અને 6",
        "આપેલ તમામ"
      ],
      correctAnswer: 2,
      explanation: "",
      },
    {
      id: 32,
      question: "દર વર્ષે ક્યા દિવસને 'મૂળભૂત ફરજદિન' તરીકે ઉજવવાનું નક્કી કરવામાં આવ્યુ છે?",
      options: [
        "12 માર્ચના દિવસને",
        "18 ફેબ્રુઆરીના દિવસને",
        "10 ડિસેમ્બરના દિવસને",
        "6 જાન્યુઆરીના દિવસને"
      ],
      correctAnswer: 3,
      explanation: "",
      },
    {
      id: 33,
      question: "નીચેના વિધાનો ધ્યાને લો.\n(1) મૂળભૂત હકોની ભૂમિકા કાનૂની છે.\n(2) મૂળભૂત હકોને અદાલત દ્વારા રક્ષણ નથી મળતુ\n(3) રાજ્યનીતિના – માર્ગદર્શક સિદ્ધાંતને અદાલત દ્વારા રક્ષણ મળે છે.\nઉપરોક્ત પૈકી ખોટા વિધાન જણાવો.",
      options: [
        "ફક્ત 3",
        "ફક્ત 2",
        "ફક્ત 2 અને 3",
        "આપેલ તમામ"
      ],
      correctAnswer: 2,
      explanation: "",
      },
    {
      id: 34,
      question: "કોના મતે રાજ્યનીતિના માર્ગદર્શક સિદ્ધાંતો દેશના પાયારૂપ સિદ્ધાંતો છે?",
      options: [
        "જવાહરલાલ નહેરુ",
        "ડૉ. રાજેન્દ્ર પ્રસાદ",
        "ડૉ. બાબાસાહેબ આંબેડકર",
        "મોતીલાલ નહેરુ"
      ],
      correctAnswer: 2,
      explanation: "",
      },
    {
      id: 35,
      question: "નીચેના વિધાનો ધ્યાને લો.\n(1) રાજ્યનીતિના માર્ગદર્શક સિદ્ધાંતોને રાજ્ય અમલ કરવા બંધાયેલ છે.\n(2) મૂળભૂત હકોને કટોકટીની સ્થિતિમાં મોકૂફ રાખી શકાય છે અને તેના પર નિયંત્રણ મુકી શકાય છે.\nઉપરોક્ત પૈકી સાચા વિધાન જણાવો.",
      options: [
        "ફક્ત 1",
        "ફક્ત 2",
        "બંને",
        "એકપણ નહિ"
      ],
      correctAnswer: 1,
      explanation: "",
      },
    {
      id: 36,
      question: "ઉત્તરપ્રદેશ રાજ્ય નીચેનામાંથી ક્યાં ક્યાં રાજ્યની સરહદ ધરાવે છે?",
      options: [
        "બિહાર, ઝારખંડ, છત્તીસગઢ, મધ્યપ્રદેશ, પંજાબ, રાજસ્થાન",
        "બિહાર, છત્તીસગઢ, ઝારખંડ, મધ્યપ્રદેશ, રાજસ્થાન, હરિયાણા",
        "ઝારખંડ, ગુજરાત, છત્તીસગઢ, મધ્યપ્રદેશ, રાજસ્થાન, હરિયાણા",
        "પંજાબ, હરિયાણા, ઝારખંડ, છત્તીસગઢ, રાજસ્થાન"
      ],
      correctAnswer: 1,
      explanation: "",
      },
    {
      id: 37,
      question: "'કરૈંગે યા મરૈંગે' ગાંધીજીએ આ સુત્ર ક્યારે ઉચ્ચાર્યું હતુ?",
      options: [
        "દાંડીયાત્રા વખતે",
        "સવિનય કાનુનભંગની ચળવળ વખતે",
        "હિંદ છોડો ચળવળ",
        "અસહકારના આંદોલન વખતે"
      ],
      correctAnswer: 2,
      explanation: "",
      },
    {
      id: 38,
      question: "નીચેની ઘટનાને યોગ્ય ક્રમ મુજબ ગોઠવો.\n1) મુસ્લિમ લીગની સ્થાપના\n2) મોર્લે-મિન્ટો સુધારા\n3) રોલક્ટ એક્ટ\n4) ચૌરી ચૌરા બનાવ",
      options: [
        "2, 3, 4, 1",
        "4, 3, 2, 1",
        "1, 2, 3, 4",
        "2, 1, 3, 4"
      ],
      correctAnswer: 2,
      explanation: "",
      },
    {
      id: 39,
      question: "ભારતીય બંધારણ બાબતે નીચેના વિધાનો ધ્યાને લો.\n1) 42મા બંધારણીય સુધારા 1976માં આમુખમાં બિનસાંપ્રદાયિક શબ્દ ઉમેરાયો હતો.\n2) સંયુક્ત રાષ્ટ્રોની મહાસભાએ તારીખ 10 ડિસેમ્બર 1948ના રોજ માનવ અધિકારો જાહેર કર્યા હતા.\nઉપરોક્ત પૈકી સાચા વિધાન જણાવો.",
      options: [
        "ફક્ત 1",
        "ફક્ત 2",
        "બંને સાચા",
        "એકપણ નહિ"
      ],
      correctAnswer: 2,
      explanation: "",
      },
    {
      id: 40,
      question: "બંધારણીય જોગવાઈ બાબતે નીચેના વિધાનો ધ્યાને લો.\n1) ભારતના વડાનું સ્થાન વંશપરંપરાગત કે રાજાશાહીની જેમ હોતુ નથી.\n2) આપણા બંધારણમાં સંઘીય શાસન-વ્યવસ્થાની જોગવાઈ કરેલી છે.\n3) દેશના મહત્વના કાર્યો રાજ્ય સરકારને સોંપવામાં આવ્યા છે.\nઉપરોક્ત પૈકી સાચા વિધાન જણાવો.",
      options: [
        "ફક્ત 1 અને 3",
        "ફક્ત 2 અને 3",
        "ફક્ત 1 અને 2",
        "આપેલ તમામ"
      ],
      correctAnswer: 2,
      explanation: "",
      }
  ]
};
