import type { TestData } from "@/types";

export const chapter10Test: TestData = {
  chapterId: "chapter-10",
  chapterTitle: "ટેસ્ટ 10",
  totalQuestions: 41,
  questions: [
    {
      id: 1,
      question: "પ્રાચીન ભારતના વેદો બાબતે નીચેના વિધાનો ધ્યાને લો.\n1. ભારતીય સાહિત્યનું પ્રાચીનતમ પુસ્તક ઋગ્વેદ 12 ભાગમાં વહેંચાયેલ અદભૂત ગ્રંથ છે.\n2. ઋગ્વેદ ગ્રંથ સપ્તસિંધુ પ્રદેશમાં વસેલા આર્યોની રાજકીય, સામાજિક ધાર્મિક તેમજ આર્થિક બાબતોનું વર્ણન કરે છે.",
      options: [
        "ફક્ત 1",
        "ફક્ત 2",
        "બન્ને",
        "એકપણ નહી"
      ],
      correctAnswer: 1,
      explanation: "",
      },
    {
      id: 2,
      question: "5 મી સદીમાં કયા ચીની પ્રવાસીએ તક્ષશિલા વિદ્યાપીઠની મુલાકાત લીધી હતી?",
      options: [
        "હાન-શુઈએ",
        "યુઅન-શ્વાંગે",
        "ઈત્સિંગે",
        "ફાહિયાને"
      ],
      correctAnswer: 3,
      explanation: "",
      },
    {
      id: 3,
      question: "નીચેના જોડકા જોડો.\nકવિ\n1) કાલિદાસ\n2) ભવભૂતિ\n3) ભારવિ\n4) વિશાખાદત્ત\nકૃતિ\n(A) ઉત્તરરામચરિત\n(B) મુદ્રારાક્ષસ\n(C) અભિજ્ઞાન શાકુન્તલમ્\n(D) કિરાતાર્જુનીયમ",
      options: [
        "1-A, 2-B, 3-C, 4-D",
        "1-C, 2-A, 3-D, 4-B",
        "1-D, 2-C, 3-B, 4-A",
        "1-C, 2-A, 3-B, 4-D"
      ],
      correctAnswer: 1,
      explanation: "",
      },
    {
      id: 4,
      question: "ભારતમાં કઈ વિદ્યાપીઠો પ્રસિદ્ધ વિદ્વાનોનાં નામ દરવાજા પર લખવામાં આવતા?",
      options: [
        "વારાણસી",
        "નાલંદા",
        "વલભી",
        "તક્ષશિલા"
      ],
      correctAnswer: 2,
      explanation: "",
      },
    {
      id: 5,
      question: "નીચેના વિધાનો પૈકી કઈ બાબત અસંગત છે?",
      options: [
        "વેદોના મંત્રોનો અર્થ સમજવા માટે તેના પદ સ્વરૂપમાં રચાયેલી ટીકાઓનો સમાવેશ બ્રાહ્મણગ્રંથોમાં સમાવેશ થાય છે.",
        "વેદાંગ સાહિત્યમાં કર્મકાંડો ઉપરાંત જ્યોતિષ, વ્યાકરણ અને ખગોળશાસ્ત્રનો સમાવેશ થાય છે.",
        "ઉપનિષદમાં બૃહદારણ્ય અને છાંદોગ્ય અંતના ઉપનિષદો છે.",
        "અથર્વવેદમાં અનેક પ્રકારના કર્મકાંડો અને સંસ્કારોનું વર્ણન કરવામાં આવ્યું છે?"
      ],
      correctAnswer: 2,
      explanation: "",
      },
    {
      id: 6,
      question: "પ્રાચીન ભારતીય સાહિત્ય બાબતે નીચેના વિધાનો ધ્યાને લો.\n1) ઋગ્વેદમાં 1028 ઋચાઓ સંગ્રહ છે.\n2) સામવેદ ઋગ્વેદની ઋચાઓનું ગાન કરવા માટે રચાયો છે.\n3) અથર્વવેદમાં ગદ્ય અને પદ્ય સ્વરૂપે રચાયેલ રચના છે.\n4) યજુર્વેદમાં અનેક પ્રકારના કર્મકાંડો અને સંસ્કારોનું વર્ણન કરવામાં આવ્યું છે.\nઉપરોક્ત પૈકી સાચા વિધાન જણાવો.",
      options: [
        "ફક્ત 1 અને 2",
        "ફક્ત 1, 2 અને 3",
        "ફક્ત 2, 3 અને 4",
        "આપેલ તમામ"
      ],
      correctAnswer: 0,
      explanation: "",
      },
    {
      id: 7,
      question: "ગુજરાતમાં આવેલું લોથલ નીચેનામાંથી કઈ પ્રાચીન સંસ્કૃતિ સાથે સંબંધિત છે?",
      options: [
        "વૈદિક સંસ્કૃતિ",
        "હડપ્પીય સંસ્કૃતિ",
        "મૌર્ય સંસ્કૃતિ",
        "ગુપ્ત સંસ્કૃતિ"
      ],
      correctAnswer: 1,
      explanation: "",
      },
    {
      id: 8,
      question: "દાર્શનિક પ્રશ્નોનું વિવેચન ક્યાં કરવામાં આવ્યું છે?",
      options: [
        "ઋગ્વેદમાં",
        "સામવેદમાં",
        "ઉપનિષદમાં",
        "બ્રાહ્મણગ્રંથોમાં"
      ],
      correctAnswer: 2,
      explanation: "",
      },
    {
      id: 9,
      question: "પ્રાચીન ભારતીય સાહિત્ય બાબતે નીચેના વિધાનો પૈકી સાચા વિધાન જણાવો.\n1) મહાભારત વિશ્વનો સૌથી મોટો કાવ્યગ્રંથ છે.\n2) શ્રીમદ્ ભગવતગીતામાં મોક્ષ પ્રાપ્તિના ત્રણ માર્ગોનું વિવેચન કરવામાં આવ્યું છે.\n3) કૌટિલ્યનું અર્થશાસ્ત્ર વહીવટી વિજ્ઞાનની કૃતિ છે.",
      options: [
        "ફક્ત 1 અને 3",
        "ફક્ત 2 અને 3",
        "ફક્ત 3",
        "આપેલ તમામ"
      ],
      correctAnswer: 3,
      explanation: "",
      },
    {
      id: 10,
      question: "કવિ ચંદબરદાઈનો કયો ગ્રંથ હિંદી સાહિત્યનો પ્રારંભિક ગ્રંથ છે?",
      options: [
        "પૃથ્વીરાજરાસો",
        "વિક્રમાંકદેવચરિત",
        "કવિરાજમાર્ગ",
        "ચંદ્રાયન"
      ],
      correctAnswer: 0,
      explanation: "",
      },
    {
      id: 11,
      question: "વલભી વિદ્યાપીઠ બાબતે નીચેના પૈકી કયું/કયાં વિધાન સાચું છે?\n1) વલભી બૌદ્ધ ધર્મમાં મહાયાન પંથનું કેન્દ્ર હતું.\n2) પ્રસિદ્ધ વિદ્યાધામ બનાવવામાં મૈત્રક વંશના તાત્કાલીન શાસકો અને નાગરિકોનો મોટો ફાળો હતો.\n3) સાતમાં શતકમાં પ્રસિદ્ધ બૌદ્ધ વિદ્વાનો સ્થિરમતી અને ગુણમતી વલભીના અગ્રણી આચાર્યો હતા.",
      options: [
        "ફક્ત 1 અને 3",
        "ફક્ત 1 અને 2",
        "ફક્ત 2 અને 3",
        "આપેલ તમામ"
      ],
      correctAnswer: 2,
      explanation: "",
      },
    {
      id: 12,
      question: "નીચેના વિધાનો પૈકી સાચા વિધાન જણાવો.\n1) ગુપ્તવંશને સંસ્કૃત કાવ્ય અને નાટકના વિકાસનો સુવર્ણયુગ કહેવામાં આવે છે.\n2) બૌદ્ધ ધર્મના પવિત્ર ગ્રંથને આગમગ્રંથો કહેવાય છે.",
      options: [
        "ફક્ત 1",
        "ફક્ત 2",
        "બન્ને",
        "એકપણ નહી"
      ],
      correctAnswer: 0,
      explanation: "",
      },
    {
      id: 13,
      question: "નીચે આપેલી જોડ પૈકી ખોટી જોડ પસંદ કરો.\n1) હર્ષચરિત - હર્ષવર્ધન\n2) કાદમ્બરી - બાણભટ્ટ\n3) ઉત્તરરામચરિત - ભવભૂતિ\n4) કિરાતાર્જુનિયમ - શુદ્રક",
      options: [
        "ફક્ત 1 અને 4",
        "ફક્ત 2, 3 અને 4",
        "ફક્ત 1, 2 અને 3",
        "એકપણ નહી"
      ],
      correctAnswer: 0,
      explanation: "",
      },
    {
      id: 14,
      question: "વારાણસી વિદ્યાપીઠ બાબતે નીચેના વિધાનો ધ્યાને લો.\n1) વ્યાસ સંહિતામાં મહર્ષિ વેદવ્યાસનો આશ્રમ અહીં હોવાનો ઉલ્લેખ જોવા મળે છે.\n2) ભગવાન બુદ્ધે પોતાના મતના પ્રચાર અને પ્રસાર માટે વારાણસી પર પસંદગી ઉતારી હતી.\nઉપરોક્ત પૈકી સાચા વિધાન જણાવો.",
      options: [
        "ફક્ત 1",
        "ફક્ત 2",
        "બન્ને",
        "એકપણ નહી"
      ],
      correctAnswer: 2,
      explanation: "",
      },
    {
      id: 15,
      question: "તક્ષશિલા વિદ્યાપીઠ બાબતે નીચેના વિધાનો પૈકી સાચા વિધાન જણાવો.\n1) તે પ્રાચીન ગાંધાર પ્રદેશની રાજધાનીનું શહેર હતું.\n2) આ વિદ્યાપીઠમાં 64 વિદ્યાઓનું શિક્ષણ અપાતું હતું.\n3) ભગવાન બુદ્ધના શિષ્ય જીવકે અહીં આયુર્વેદના પાઠ શીખ્યા હતા.\n4) ચંદ્રગુપ્ત મૌર્યના ગુરુ ચાણક્યે અને ખુદ ચંદ્રગુપ્ત મૌર્યએ અહીં શિક્ષણ લીધું હતું.",
      options: [
        "ફક્ત 1, 3 અને 4",
        "ફક્ત 2, 3 અને 4",
        "ફક્ત 1, 2 અને 3",
        "આપેલ તમામ"
      ],
      correctAnswer: 3,
      explanation: "",
      },
    {
      id: 16,
      question: "અમીર ખુશરોની કૃતિઓમાં નીચે આપેલ પૈકી કઈ કૃતિનો સમાવેશ થતો થાય છે?\n1. આશિકા\n2. નૂર\n3. સિપિહર\n4. કિરાતુલ સદાયન",
      options: [
        "ફક્ત 1, 3 અને 4",
        "ફક્ત 1, 2 અને 4",
        "ફક્ત 1 અને 4",
        "આપેલ તમામ"
      ],
      correctAnswer: 3,
      explanation: "",
      },
    {
      id: 17,
      question: "નાલંદા વિદ્યાપીઠ બાબતે નીચેના વિધાનો પૈકી સાચા વિધાન જણાવો.\n1. પાંચમી સદી દરમિયાન કુમારગુપ્તે અહિં એક વિહાર બંધાવેલ હતો.\n2. અહીંનો ગ્રંથાલયવાળો વિસ્તાર 'ધર્મગંજ' તરીકે ઓળખાતો હતો.\n3. બિહારના પટણા જિલ્લાનાં બડગાવ નામના પાસે નાલંદા વિદ્યાપીઠ આવેલ છે.\n4. અહિંયાં બૌદ્ધ ધર્મ અને જૈન ધર્મનું હતું.",
      options: [
        "ફક્ત 1, 3 અને 4",
        "ફક્ત 1, 2 અને 4",
        "ફક્ત 1 અને 4",
        "આપેલ તમામ"
      ],
      correctAnswer: 3,
      explanation: "",
      },
    {
      id: 18,
      question: "નીચેના વિધાનો ચકાસી સાચા વિધાનો જણાવો?\n1. સિંધુ સભ્યતાના લોકો લોખંડથી અજાણ હતા.\n2. ધાતુની નર્તકીની મૂર્તિ સિંધુ સભ્યતાની ધાતુવિદ્યામાં નિપુણતાનું ઉદાહરણ છે.\n3. નૃત્યકલાનાં ઉત્કૃષ્ટ નમૂનારૂપ મહાદેવ નટરાજનું શિલ્પ હૈદરાબાદ સંગ્રહાલયમાં સંકળાયેલું છે.",
      options: [
        "માત્ર 1",
        "1 અને 3",
        "1 અને 2",
        "આપેલ તમામ"
      ],
      correctAnswer: 2,
      explanation: "",
      },
    {
      id: 19,
      question: "નીચેના વિધાનો ચકાસી સાચા વિધાનો જણાવો?\n1. નાલંદા વિદ્યાપીઠના સ્થાપક સ્કંદગુપ્ત હતા.\n2. આચાર્ય નાગાર્જુન નાલંદા વિદ્યાપીઠના આચાર્ય હતા.\n3. નાગાર્જુનને રસાયણશાસ્ત્રના પિતા ગણવામાં આવે છે.\n4. નાગાર્જુને રત્નાવલી અને આરોગ્યમંજરી પુસ્તકની રચના કરી છે.",
      options: [
        "2, 3 અને 4",
        "1, 2 અને 3",
        "2 અને 3",
        "આપેલ તમામ"
      ],
      correctAnswer: 0,
      explanation: "",
      },
    {
      id: 20,
      question: "ભારતની રસાયણ વિદ્યાના ઉત્કૃષ્ટ નમૂના વિશે નીચેનામાંથી સાચા વિધાન જણાવો?\n1. ભગવાન બુદ્ધની 7 1/2 ફૂટ ઊંચી, 1 ટન વજન ધરાવતી તામ્રમૂર્તિ સુલતાનગંજ ઉત્તરપ્રદેશમાંથી મળી આવેલ છે.\n2. 18 ફૂટ ઊંચી ભગવાન બુદ્ધની મૂર્તિ નાલંદામાંથી મળી આવી છે.\n3. 7 ટન વજન ધરાવતો અને 24 ફૂટ ઊંચો સમ્રાટ ચંદ્રગુપ્ત બીજા દ્વારા બંધાયેલ વિજય સ્તંભ દિલ્લીમાં આવેલ છે.",
      options: [
        "આપેલ તમામ",
        "1 અને 2",
        "2 અને 3",
        "1 અને 3"
      ],
      correctAnswer: 2,
      explanation: "",
      },
    {
      id: 21,
      question: "નીચેના વિધાનો ચકાસી સાચા વિધાનો પસંદ કરો?\n1. મહર્ષિ ચરક દ્વારા આયુર્વેદ માટે 'ચરકસંહિતા' નામનો ગ્રંથ લખવામાં આવ્યો છે.\n2. મહર્ષિ સુશ્રુત દ્વારા શલ્ય ચિકિત્સા માટે 'સુશ્રુત સંહિતા' નામે ગ્રંથ લખ્યો છે.\n3. વાગ્ભટ્ટ દ્વારા આયુર્વેદ માટે 'વાગ્ભટ્ટસંહિતા' નામનો ગ્રંથ લખવામાં આવેલ છે.",
      options: [
        "1 અને 2",
        "2 અને 3",
        "1 અને 3",
        "આપેલ તમામ"
      ],
      correctAnswer: 0,
      explanation: "",
      },
    {
      id: 22,
      question: "નીચેનામાંથી ખોટા વિધાન જણાવો?\n1. પ્રાચીન સમય પ્રાણી રોગોના શાસ્ત્રોનો પણ વિકાસ થયો હતો.\n2. પ્રાણી રોગો માટેના મહત્વના ગ્રંથોમાં હસ્તી આયુર્વેદ અને શાલિહોત્રનું અશ્વ શાસ્ત્રનો પણ સમાવેશ થાય છે.\n3. વાગ્ભટ્ટે નિદાનક્ષેત્રે 'અષ્ટાંગહૃદય' નામે ગ્રંથ લખેલ છે.",
      options: [
        "1 અને 3",
        "માત્ર 1",
        "માત્ર 3",
        "એક પણ નહીં"
      ],
      correctAnswer: 3,
      explanation: "",
      },
    {
      id: 23,
      question: "નીચેના વિધાનોમાંથી સાચા વિધાન જણાવો?\n1. પ્રજનનશાસ્ત્ર નામનો ગ્રંથ બ્રાભવ્ય પાંચાલ દ્વારા લખવામાં આવેલ છે.\n2. કામસૂત્ર નામનો ગ્રંથ ચક્રપાણિદત્ત દ્વારા લખવામાં આવેલ છે.\n3. ચિકિત્સાસંગ્રહ નામનો ગ્રંથ વાત્સ્યાયન દ્વારા લખવામાં આવેલ છે.",
      options: [
        "માત્ર 1",
        "1 અને 2",
        "1 અને 3",
        "આપેલ તમામ"
      ],
      correctAnswer: 0,
      explanation: "",
      },
    {
      id: 24,
      question: "નીચેના વિધાનોમાંથી સાચા વિધાન જણાવો?\n1. વૃક્ષ આયુર્વેદ નામનો ગ્રંથ મહામુનિ પરાશર દ્વારા લખવામાં આવેલ છે.\n2. યોગ શાસ્ત્ર નામનો ગ્રંથ મહર્ષિ પતંજલિ દ્વારા લખવામાં આવેલ છે.\n3. યંત્ર સર્વસ્વ નામનો ગ્રંથ મહર્ષિ ભારદ્વાજ દ્વારા લખવામાં આવેલ છે.",
      options: [
        "માત્ર 1 અને 2",
        "માત્ર 2 અને 3",
        "માત્ર 1 અને 3",
        "આપેલ તમામ"
      ],
      correctAnswer: 3,
      explanation: "",
      },
    {
      id: 25,
      question: "નીચેનામાંથી કઈ શોધ ભારત દ્વારા કરવામાં આવેલી છે?\n1. શૂન્યની શોધ\n2. દશાંશ પદ્ધતિ\n3. બીજ ગણિત\n4. બોધાયાનનો પ્રમેય\n5. રેખા ગણિત",
      options: [
        "1, 2 અને 3",
        "1, 2, 3 અને 5",
        "1, 3, 4 અને 5",
        "આપેલ તમામ"
      ],
      correctAnswer: 3,
      explanation: "",
      },
    {
      id: 26,
      question: "નીચેના વિધાનો ચકાસી સાચા વિધાનો જણાવો?\n1. શૂન્યની શોધ આર્યભટ્ટે કરી હતી.\n2. આંકડાની પાછળ શૂન્ય લગાવીને લખવાની પ્રક્રિયાના શોધક 'ગૃત્સમદ' નામના ઋષિ હતા.\n3. 'મોહેં-જો-દડો' અને 'હડપ્પા'ના અવશેષોમાં તોલમાપના સાધનોમાં 'દશાંશ પદ્ધતિ' જોવા મળી છે.",
      options: [
        "1 અને 2",
        "2 અને 3",
        "1 અને 3",
        "આપેલ તમામ"
      ],
      correctAnswer: 3,
      explanation: "",
      },
    {
      id: 27,
      question: "નીચેના વિધાનો ચકાસી સાચા વિધાનો જણાવો?\n1. ભાસ્કરાચાર્યે 'લીલાવતી ગણિત' અને 'બીજ ગણિત' નામના ગ્રંથો લખ્યા.\n2. આર્યભટ્ટે 'આર્યભટ્ટીયમ' નામનો ગ્રંથ લખ્યો હતો.\n3. ભાસ્કરાચાર્ય ગણિતશાસ્ત્રના પિતા તરીકે ઓળખવામાં આવે છે.",
      options: [
        "1 અને 3",
        "1 અને 2",
        "2 અને 3",
        "આપેલ તમામ"
      ],
      correctAnswer: 1,
      explanation: "",
      },
    {
      id: 28,
      question: "નીચેનામાંથી ખોટા વિધાનો જણાવો?\n1. પૃથ્વી પોતાની ધરી પર ફરે છે તથા ચંદ્રગ્રહણનું સાચુ કારણ પૃથ્વીનો પડછાયો છે, તેવું વરાહમિહિર દ્વારા સાબિત કરવામાં આવ્યું હતું.\n2. જ્યોતિષશાસ્ત્રને 'તંત્ર', 'હોરા' અને 'સંહિતા' એમ ત્રણ ભાગમાં આર્યભટ્ટ દ્વારા વહેંચવામાં આવેલા છે.\n3. 'બૃહદસંહિતા' નામના ગ્રંથની રચના વરાહમિહિર દ્વારા કરવામાં આવી હતી.",
      options: [
        "1 અને 2",
        "2 અને 3",
        "માત્ર 1",
        "આપેલ તમામ"
      ],
      correctAnswer: 0,
      explanation: "",
      },
    {
      id: 29,
      question: "નીચેના વિધાનો ચકાસી સાચા વિધાનો જણાવો?\n1. વાસ્તુશાસ્ત્ર એ જ્યોતિષશાસ્ત્રનું અવિભાજ્ય અંગ છે.\n2. વાસ્તુશાસ્ત્રમાં રહેવાની જગ્યા, મહેલ, અશ્વશાળા, કિલ્લા, શસ્ત્રાગાર, નગર વગેરેની રચના કેવી રીતે કરવી તેનો ઉલ્લેખ કરવામાં આવેલો છે.\n3. પ્રાચીન ભારતમાં બ્રહ્મા, નારદ, બૃહસ્પતિ, ભૃગુ, વશિષ્ટ, વિશ્વકર્મા જેવા વિદ્વાનોનું વાસ્તુશાસ્ત્રમાં અનોખું પ્રદાન છે.",
      options: [
        "1 અને 2",
        "2 અને 3",
        "1 અને 3",
        "આપેલ તમામ"
      ],
      correctAnswer: 3,
      explanation: "",
      },
    {
      id: 30,
      question: "ભારતના ઐતિહાસિક સ્થળોને ઉત્તરથી દક્ષિણના ક્રમમાં ગોઠવતા કયો ક્રમ સાચો ગણાય?",
      options: [
        "તાજમહલ, ખજૂરાહોનાં મંદિર, બૃહદેશ્વર મંદિર, ઈલોરાની ગુફા",
        "ઈલોરાની ગુફા, તાજમહેલ, ખજૂરાહોના મંદિર, બૃહદેશ્વર મંદિર",
        "તાજમહલ, બૃહદેશ્વર મંદિર, ખજૂરાહોનાં મંદિર, ઈલોરાની ગુફા",
        "તાજમહલ, ખજૂરાહોનાં મંદિર, ઈલોરાની ગુફા, બૃહદેશ્વર મંદિર"
      ],
      correctAnswer: 3,
      explanation: "",
      },
    {
      id: 31,
      question: "નીચે આપેલા જોડકા જોડી યોગ્ય વિકલ્પ પસંદ કરો.\nસ્થાપત્ય\n1) રાણી સિપ્રીની વાવ\n2) અડીકડીની વાવ\n3) રૂદ્રમહાલય\n4) રાણીની વાવ\nજિલ્લો\n(A) પાટણ\n(B) સિદ્ધપુર\n(C) જૂનાગઢ\n(D) અમદાવાદ",
      options: [
        "1-D, 2-C, 3-B, 4-A",
        "1-A, 2-B, 3-C, 4-D",
        "1-D, 2-C, 3-A, 4-B",
        "1-B, 2-A, 3-D, 4-C"
      ],
      correctAnswer: 0,
      explanation: "",
      },
    {
      id: 32,
      question: "કોણાર્કના સૂર્યમંદિર બાબતે નીચેના પૈકી કયું/કયાં વિધાન સાચું/સાચા છે?\n1) આ મંદિરનું નિર્માણ 13મી સદીના ગંગવંશના રાજા નરસિંહવર્મન-બીજાના સમયમાં થયું હતું.\n2) આ મંદિર ઓડિસા રાજ્યના પુરી જિલ્લામાં બંગાળના અખાત પાસે આવેલું છે.\n3) આ મંદિરનું નિર્માણ કાળા પથ્થરમાંથી થયું હોવાથી તેને 'કાળા પેગોડા' તરીકે ઓળખવામાં આવે છે.",
      options: [
        "ફક્ત 1 અને 3",
        "ફક્ત 1 અને 2",
        "ફક્ત 2 અને 3",
        "આપેલ તમામ"
      ],
      correctAnswer: 2,
      explanation: "",
      },
    {
      id: 33,
      question: "પટ્ટદકલ મંદિર સ્થાપત્ય બાબતે નીચેના વિધાનો પૈકી કયું/કયાં વિધાનો સાચું /સાચાં છે?\n1) પટ્ટદકલ પલ્લવ વંશની રાજધાનીનું નગર હતું.\n2) સાતમી આઠમી સદીના નિર્માણ થયેલા આ મંદિરમાં નાગર અને દ્રવિડ શૈલીનો ઉપયોગ જોવા મળે છે.\n3) પટ્ટદકલનું સૌથી મોટું મંદિર વિરૂપાક્ષ (શિવ)નું મંદિર છે.",
      options: [
        "ફક્ત 1 અને 3",
        "ફક્ત 2 અને 3",
        "ફક્ત 3",
        "આપેલ તમામ"
      ],
      correctAnswer: 1,
      explanation: "",
      },
    {
      id: 34,
      question: "એલિફન્ટાની ગુફાઓ બાબતે નીચેનામાંથી કયું વિધાન અયોગ્ય છે?",
      options: [
        "મહારાષ્ટ્ર રાજ્યમાં મુંબઈથી 12 કિમી દુર અરબસાગરમાં ગુફાઓ આવેલી છે.",
        "એલિફન્ટાની ગુફાઓની કુલ સંખ્યા 7 છે.",
        "ઈ.સ.1987માં યુનેસ્કો દ્વારા વૈશ્વિક વારસામાં એલિફન્ટાને સ્થાન આપવામાં આવ્યું છે.",
        "તેમાં આવેલી ત્રિમૂર્તિ (બ્રહ્મા, વિષ્ણુ અને મહેશ) એ ગુફા નંબર-7 માં આવેલી છે."
      ],
      correctAnswer: 3,
      explanation: "",
      },
    {
      id: 35,
      question: "ઈલોરાની ગુફાઓ બાબતે નીચેના વિધાનો પૈકી કયું/કયાં વિધાન સાચું/સાચા છે?\n1) ઈલોરાની ગુફાઓમાં બૌદ્ધ ધર્મની લગતી ગુફાઓ 1 થી 12 નંબરની છે.\n2) ઈલોરાની ગુફાઓમાં હિન્દુ ધર્મની લગતી ગુફાઓ 13 થી 29 નંબરની છે.\n3) ઈલોરાની ગુફાઓમાં જૈન ધર્મની લગતી ગુફાઓ 30 થી 34 નંબરની છે.",
      options: [
        "ફક્ત 1 અને 2",
        "ફક્ત 2 અને 3",
        "ફક્ત 1 અને 3",
        "આપેલ તમામ"
      ],
      correctAnswer: 3,
      explanation: "",
      },
    {
      id: 36,
      question: "શાહજહાંએ જિંદગીના આખરી દિવસો કયા કિલ્લામાં વિતાવ્યા હતા?",
      options: [
        "આગરાના કિલ્લામાં",
        "શાહી કિલ્લામાં",
        "દિલ્હીના લાલ કિલ્લામાં",
        "લાહોરી કિલ્લામાં"
      ],
      correctAnswer: 0,
      explanation: "",
      },
    {
      id: 37,
      question: "નીચેના જોડકા જોડો.\n1) તાજમહેલ\n2) ફતેહપુર સિક્રી\n3) કીર્તિતોરણ\n4) ધોળાવીરા\n(A) બુલંદ દરવાજો\n(B) ખદીરબેટ\n(C) સુંદર અષ્ટકોણીય જાળી\n(D) વડનગર",
      options: [
        "1-A, 2-B, 3-C, 4-D",
        "1-C, 2-A, 3-D, 4-B",
        "1-D, 2-C, 3-B, 4-A",
        "1-C, 2-A, 3-B, 4-D"
      ],
      correctAnswer: 1,
      explanation: "",
      },
    {
      id: 38,
      question: "મહાબલિપુરમ બાબતે નીચેના વિધાનો પૈકી કયું /કયા વિધાન સાચું /સાચા છે?\n1) દક્ષિણના ભારતના પલ્લવરાજા નરસિંહવર્મન પ્રથમના ઉપનામથી મહામલ્લ પરથી આ નગર નું નામ મહાબલિપુરમ રાખ્યું હતું.\n2) તમિલનાડુ રાજ્યના ચેન્નાઈથી 60 કિમી દુર મહાબલિપુરમ આવેલું છે.",
      options: [
        "ફક્ત 1",
        "ફક્ત 2",
        "બન્ને",
        "એકપણ નહી"
      ],
      correctAnswer: 2,
      explanation: "",
      },
    {
      id: 39,
      question: "નીચે આપેલા ભારતના કયાં સ્થાપત્યમાં હાસ્યમુદ્રામાં વિષ્ણુની મૂર્તિ તથા મહિષાસુરનો વધ કરતી દુર્ગાદેવીનું શિલ્પ જોવા મળે છે?",
      options: [
        "ખજૂરાહોના મંદિરોમાં",
        "મહાબલિપુરમમાં",
        "કોણાર્કના સૂર્યમંદિરોમાં",
        "બૃહદેશ્વર મંદિરમાં"
      ],
      correctAnswer: 1,
      explanation: "",
      },
    {
      id: 40,
      question: "બૃહદેશ્વરના મંદિર બાબતે નીચેનામાંથી કયું વિધાન અયોગ્ય છે?",
      options: [
        "તમિલનાડુના તાંજોર (થંજાવુરમાં) બૃહદેશ્વર મંદિર આવેલું છે.",
        "આ મંદિર પલ્લવ રાજવી રાજા રાજ પ્રથમે બંધાવ્યું હતું.",
        "આ મંદિરને રાજેશ્વર મંદિર પણ કહે છે.",
        "આ મંદિરનું નિર્માણ દ્રવિડ શૈલીમાં થયું હતું."
      ],
      correctAnswer: 1,
      explanation: "",
      },
    {
      id: 41,
      question: "કુતુબમિનાર બાબતે નીચેના વિધાનો પૈકી કયું /કયાં વિધાન સાચું /સાચાં છે?\n1) એનું નિર્માણ 12મી સદીમાં ગુલામ વંશના સ્થાપક કુતબુદ્દીન ઐબકે શરૂ કરાવ્યું હતું.\n2) કુતુબ મિનારનું કામ પૂર્ણ કરાવનાર શાસક ઈલ્તુત્મીશ હતો.",
      options: [
        "ફક્ત 1",
        "ફક્ત 2",
        "બન્ને",
        "એકપણ નહી"
      ],
      correctAnswer: 2,
      explanation: "",
      }
  ]
};
