import type { TestData } from "@/types";

export const chapter16Test: TestData = {
  chapterId: "chapter-16",
  chapterTitle: "ટેસ્ટ 16",
  totalQuestions: 30,
  questions: [
    {
      id: 1,
      question: "નીચેનામાંથી કયું લક્ષણ ખનીજનું નથી?",
      options: [
        "તેઓ કુદરતી પ્રક્રિયાઓ દ્વારા બનેલાં હોય છે.",
        "તેમનું એક ચોક્કસ રાસાયણિક બંધારણ હોય છે.",
        "તેઓ અપ્રાપ્ય હોય છે.",
        "તેમનું વિવરણ અસમાન હોય છે."
      ],
      correctAnswer: 0,
      explanation: "",
      },
    {
      id: 2,
      question: "લોખંડ પોલાદાનાં ઉત્પાદનમાં વિશ્વમાં ભારત કયુ સ્થાન ધરાવે છે?",
      options: [
        "પાંચમું",
        "ત્રીજુ",
        "બીજુ",
        "દશમું"
      ],
      correctAnswer: 0,
      explanation: "",
      },
    {
      id: 3,
      question: "નીચેના પૈકી કયા ખનીજનો ઉપયોગ સ્ટોરેજ બેટરી અને ઝિંક ઓક્સાઈડમાં થાય છે?",
      options: [
        "સીસાનો",
        "ફ્લોરસ્પા૨નો",
        "જસતનો",
        "અબરખનો"
      ],
      correctAnswer: 0,
      explanation: "",
      },
    {
      id: 4,
      question: "'કથન કરે સો કથક કહાવે' આ ઉક્તિ કયા નૃત્યના વિકાસ સાથે જોડાયેલી રહી છે?",
      options: [
        "ભરતનાટ્યમ",
        "મણિપુરી",
        "કથકલી",
        "કથક"
      ],
      correctAnswer: 3,
      explanation: "",
      },
    {
      id: 5,
      question: "કઈ કલામાં સાક્ષર, નિરક્ષર અને આબાલવૃદ્ધ સૌને મનોરંજન પૂરુ પાડવાની ક્ષમતા છે?",
      options: [
        "સંગીતકલા",
        "નાટ્યકલા",
        "ચિત્રકલા",
        "નૃત્યકલા"
      ],
      correctAnswer: 1,
      explanation: "",
      },
    {
      id: 6,
      question: "નીચેના જોડકા જોડો.\n(અ) (બ)\n(1) સંગીત મકરંદ (A) પંડીત સારંગદેવ\n(2) સંગીત રત્નાકર (B) પંડિત નારદ\n(3) સંગીત પારિજાત (C) શિવ નટરાજ\n(4) નૃત્યકલા આદિદેવ (D) પંડિત અહોબલ",
      options: [
        "1-A, 2-B, 3-C, 4-D",
        "1-B, 2-A, 3-D, 4-C",
        "1-D, 2-C, 3-B, 4-A",
        "1-B, 2-C, 3-A, 4-D"
      ],
      correctAnswer: 1,
      explanation: "",
      },
    {
      id: 7,
      question: "મોહેં-જો-દડોની નગર રચના બાબતે નીચેના વિધાનો પૈકી સાચા વિધાન જણાવો.\n1) મકાનો પુર અને ભેજથી બચવા ઉંચી પ્લિંથ (પીઠિકા) ઉપર બાંધવામાં આવતાં હતાં.\n2) શ્રીમંતોના મકાનો બે માળવાળા અને પાંચ કે સાત ઓરડાવાળા હતા.\n3) સમગ્ર નગરની ફરતે દીવાલની રચના કરવામાં આવી હતી.",
      options: [
        "ફક્ત 1 અને 4",
        "ફક્ત 2 અને 3",
        "ફક્ત 1",
        "આપેલ તમામ"
      ],
      correctAnswer: 3,
      explanation: "",
      },
    {
      id: 8,
      question: "પ્રાચીન ભારતના નગર આયોજન વિશે નીચેના વિધાનો પૈકી સાચા વિધાન જણાવો.\n1) મકાનના દરવાજા રસ્તાઓને બદલે ગલીમાં અંદર પડતા હતા.\n2) હવાઉજાસ માટે બારી-બારણાંની વ્યવસ્થા હતી.\n3) મોટા ભાગે રસ્તાઓ 9.75 મીટર પહોળા હતા.\n4) રસ્તાઓ માટે રાત્રિપ્રકાશ માટે થાંભલા હોવાનું પણ અનુમાન છે.",
      options: [
        "ફક્ત 1, 2 અને 3",
        "ફક્ત 2, 3 અને 4",
        "ફક્ત 1 અને 4",
        "આપેલ તમામ"
      ],
      correctAnswer: 3,
      explanation: "",
      },
    {
      id: 9,
      question: "પ્રાચીન યુગમાં રચાયેલી વહીવટી વિજ્ઞાનની કૃતિ કઈ છે?",
      options: [
        "અષ્ટાધ્યાયી",
        "મિલિન્દ પન્હો",
        "કૌટિલ્યનું અર્થશાસ્ત્ર",
        "મિલેન્ડરનું અર્થશાસ્ત્ર"
      ],
      correctAnswer: 2,
      explanation: "",
      },
    {
      id: 10,
      question: "નીચે આપેલી જોડ પૈકી સાચી જોડ પસંદ કરો.\n1) શુદ્રક -મૃચ્છકટિકમ્\n2) ભારવિ –કિરાતાર્જુનિયમ્\n3) બાણભટ્ટ-કાદમ્બરી\n4) વિશાખાદત્ત -દશકુમારચરિત",
      options: [
        "ફક્ત 1, 2 અને 4",
        "1, 3 અને 4",
        "ફક્ત 1, 2 અને 3",
        "આપેલ તમામ"
      ],
      correctAnswer: 2,
      explanation: "",
      },
    {
      id: 11,
      question: "નીચેનામાંથી કઈ કૃતિઓ કાલિદાસ દ્વારા લખવામાં આવેલી છે?\n1) કુમારસંભવ\n2) મેઘદૂત\n3) કિરાતાર્જુનીયમ\n4) ઋતુસંહાર\n5) અભિજ્ઞાનશાકુંતલમ્",
      options: [
        "ફક્ત 1, 2, 3 અને 5",
        "ફક્ત 2, 3, 4 અને 5",
        "ફક્ત 1, 2, 4 અને 5",
        "1, 2, 3, 4 અને 5"
      ],
      correctAnswer: 2,
      explanation: "",
      },
    {
      id: 12,
      question: "નીચેનામાંથી સાચાં વિધાન જણાવો?\n1. ભાસ્કરાચાર્યે સરવાળા તથા બાદબાકીનું સંશોધન કર્યું.\n2. આર્યભટ્ટે π ની કિંમત 22/7 (3.14) જેટલી થાય છે તેવો ઉલ્લેખ કરેલો છે.\n3. આર્યભટ્ટે 'આર્ય સિધ્ધાંત' માં જ્યોતિષ શાસ્ત્રના મૂળ સિધ્ધાંતોનું સંક્ષેપમાં વર્ણન આપેલું છે.",
      options: [
        "1 અને 2",
        "2 અને 3",
        "1 અને 3",
        "આપેલ તમામ"
      ],
      correctAnswer: 3,
      explanation: "",
      },
    {
      id: 13,
      question: "નીચેના જોડકાં જોડો.\nમંદિર - રાજ્ય\n1) કોર્ણાકનું સૂર્યમંદિર (A) મધ્યપ્રદેશ\n2) વિરૂપાક્ષનું મંદિર (B) તમિલનાડું\n3) બૃહદેશ્વરનું મંદિર (C) કર્ણાટક\n4) ખજૂરાહોનાં મંદિર (D) ઓડિશા",
      options: [
        "1-D, 2-C, 3-A, 4-B",
        "1-A, 2-B, 3-C, 4-D",
        "1-D, 2-C, 3-B, 4-A",
        "1-D, 2-B, 3-A, 4-C"
      ],
      correctAnswer: 2,
      explanation: "",
      },
    {
      id: 14,
      question: "ઇલોરાની ગુફાઓ બાબતે નીચેના વિધાનો પૈકી સાચા વિધાન જણાવો..\n1) મહારાષ્ટ્ર રાજ્યનાં ઔરંગાબાદ પાસે આ ગુફાઓ આવેલી છે.\n2) રાષ્ટ્રકૂટ રાજ્યોના સમયમાં હિન્દુ ધર્મની ગુફાઓનું નિર્માણ થયું હતું.\n3) અહીં ગુફાનંબર 16માં કૈલાશ મંદિર આવેલું છે.\n4) અહીં કુલ 34 ગુફાઓ આવેલી છે.",
      options: [
        "ફક્ત 1 અને 4",
        "ફક્ત 2, 3 અને 4",
        "ફક્ત 1, 3 અને 4",
        "આપેલ તમામ"
      ],
      correctAnswer: 3,
      explanation: "",
      },
    {
      id: 15,
      question: "નીચેની જોડ બાબતે નીચેના વિધાનો ધ્યાને લઈ યોગ્ય વિકલ્પ પસંદ કરો.\n1) રુદ્રમહાલય- સિદ્ધપુર\n2) મલાવ તળાવ- વિરમગામ\n3) મુનસર તળાવ- ધોળકા\n4) હઠી સિંહના દેરા -અમદાવાદ\n5) સહસ્ત્રલિંગ તળાવ- પાટણ",
      options: [
        "ફક્ત 1, 2, 3 અને 5 સાચા",
        "ફક્ત 1, 3, 4 અને 5 સાચા",
        "ફક્ત 1, 4 અને 5 સાચા",
        "આપેલ તમામ સાચા"
      ],
      correctAnswer: 2,
      explanation: "",
      },
    {
      id: 16,
      question: "હૈદરાબાદમાં કયું સંગ્રહાલય આવેલું છે?",
      options: [
        "સુલતાનગંજ સંગ્રાલય",
        "સાલારગંજ સંગ્રહાલય",
        "આબાદગંજ સંગ્રહાલય",
        "નિઝામ સંગ્રહાલય"
      ],
      correctAnswer: 1,
      explanation: "",
      },
    {
      id: 17,
      question: "નીચેના પૈકી કયું/કયાં સંશાધન વિરલ સંસાધન છે?\n1) કોલસો\n2) ખનીજતેલ\n3) યૂરેનિયમ\n4) ક્રાયોલાઈટ",
      options: [
        "ફક્ત 1, 3 અને 4",
        "ફક્ત 3 અને 4",
        "ફક્ત 1, 2 અને 3",
        "આપેલ તમામ"
      ],
      correctAnswer: 2,
      explanation: "",
      },
    {
      id: 18,
      question: "અસમ, દાર્જીલિંગ, ઉત્તરાખંડ, હિમાચલ પ્રદેશ અને કશ્મીરમાં નીચેનામાંથી કેવી જમીન જોવા મળે છે?",
      options: [
        "જંગલ પ્રકારની જમીન",
        "દલ દલ કે પીટ પ્રકારની જમીન",
        "રણ-પ્રકારની જમીન",
        "પર્વતીય જમીન"
      ],
      correctAnswer: 3,
      explanation: "",
      },
    {
      id: 19,
      question: "લેટેરાઈટ કે પડખાઉ જમીનમાં મુખ્યત્વે નીચેનામાંથી કયાં કયાં તત્વો સામેલ હોય છે?",
      options: [
        "લોહતત્વ, પોટાશ અને એલ્યુમિનિયમ",
        "ચૂનો, પોટાશ અને એલ્યુમિનિયમ",
        "મેગ્નેશિયમ, ફૉસ્ફેટ અને નાઈટ્રોજન",
        "પોટાશ અને ફૉસ્ફરિક એસિડ"
      ],
      correctAnswer: 0,
      explanation: "",
      },
    {
      id: 20,
      question: "કાળી જમીન બાબતે નીચેના વિધાનો પૈકી ખોટા વિધાન જણાવો.\n1. આ જમીનની ભેજ સંગ્રહણ શક્તિ ઘણી વધારે હોય છે.\n2. જ્યારે ભેજ સૂકાય ત્યારે તેમાં ફાટો કે તિરાડો પડી જાય છે.\n3. આ જમીન કપાસના પાકને વિશેષ અનુકુળ હોવાથી આ જમીનને કપાસની જમીન ઓળખાય છે.",
      options: [
        "ફક્ત 1",
        "ફક્ત 2",
        "ફક્ત 3",
        "એકપણ નહી"
      ],
      correctAnswer: 3,
      explanation: "",
      },
    {
      id: 21,
      question: "ભારતના કુલ ક્ષેત્રફળના લગભગ કેટલા ટકા વિસ્તારમાં રાતી અથવા લાલ જમીન જોવા મળે છે?",
      options: [
        "43%",
        "22%",
        "19%",
        "29%"
      ],
      correctAnswer: 2,
      explanation: "",
      },
    {
      id: 22,
      question: "એતુર નાગરમ વન્ય જીવ અભ્યારણ નીચેનામાંથી કયાં રાજ્યમાં આવેલ છે?",
      options: [
        "કર્ણાટક",
        "તેલંગણા",
        "ઓડિસા",
        "આંધ્રપ્રદેશ"
      ],
      correctAnswer: 1,
      explanation: "",
      },
    {
      id: 23,
      question: "ગુજરાત એનર્જી ડેવલપમેન્ટ એજન્સી (GEDA) એ વડોદરા પાસે કયા સ્થળે 10 ટનની ક્ષમતાવાળું સૌત શીતાગાર સ્થાપ્યું છે?",
      options: [
        "પાદરા",
        "માંડવી",
        "છાણી",
        "ચારણકા"
      ],
      correctAnswer: 2,
      explanation: "",
      },
    {
      id: 24,
      question: "નીચેના વિધાનો ધ્યાને લઈ નીચેનામાંથી સાચું /સાચા વિધાન જણાવો.\n1. રાષ્ટ્રીય ઉત્પાદનમાં કૃષિનો લગભગ 25% જેટલો હિસ્સો છે.\n2. ગુજરાતના ભાલ પ્રદેશમાં ચોમાસું પુરું થયા બાદ ભેજવાળી જમીનમાં ઘઉં અને ચણાનો પાક લેવામાં આવે છે.\n3. ઝૂમ ખેતીને વ્યાપારી ખેતી કહેવામાં આવે છે.",
      options: [
        "ફક્ત 1 અને 2",
        "ફક્ત 2 અને 3",
        "ફક્ત 2",
        "આપેલ તમામ"
      ],
      correctAnswer: 2,
      explanation: "",
      },
    {
      id: 25,
      question: "ખેતીના પાક બાબતે નીચેના વિધાનો કયાં પાકને લગતા છે?\n1. આ પાકને હળવો વરસાદ અનુકુળ છે.\n2. આ પાકને તૈયાર થતા 6 થી 8 માસ જેટલો સમય લાગે છે.\n3. આ પાકને કાળી જમીન અનુકૂળ આવે છે.\n4. આ પાક તૈયાર થાય ત્યારે આકાશ ચોખ્ખુ હોવું જોઈએ.",
      options: [
        "મગફળી",
        "કપાસ",
        "ડાંગર",
        "ઘઉં"
      ],
      correctAnswer: 1,
      explanation: "",
      },
    {
      id: 26,
      question: "નીચેના વિધાનો પૈકી સાચા વિધાન જણાવો..\n1. સ્થળાંતરિત ખેતીને 'ઝૂમ ખેતી' કહે છે.\n2. પર્વતીય જમીનનો સ્તર પાતળો અને અપરિપકવ હોય છે.\n3. રાતી જમીન પ્રમાણમાં છિદ્રવાળું અને ચીકણી હોય છે.\n4. કાંપની જમીન ચીકણી અને લાલ રંગની હોય છે.",
      options: [
        "ફક્ત 1 અને 2",
        "ફક્ત 1, 3 અને 4",
        "ફક્ત 2,3 અને 4",
        "આપેલ તમામ"
      ],
      correctAnswer: 0,
      explanation: "",
      },
    {
      id: 27,
      question: "જળ સંસાધન બાબતે નીચેના વિધાનો પૈકી સાચા વિધાન જણાવો.\n1. જળસ્ત્રોતના બધાજ સ્ત્રોતો વૃષ્ટિને આભારી છે.\n2. પૃષ્ટીય જળ સ્ત્રોતનો મુખ્ય સ્ત્રોતમાં નદીઓનો સમાવેશ થાય છે.\n3. ભારતનાં મેદાની વિસ્તારમાં 42% વિસ્તારમાં ભૂમિગત જળ પ્રાપ્ત થાય છે.",
      options: [
        "ફક્ત 1 અને 3",
        "ફક્ત 2 અને 3",
        "ફક્ત 3",
        "આપેલ તમામ"
      ],
      correctAnswer: 3,
      explanation: "",
      },
    {
      id: 28,
      question: "બંધારણના કયાં અનુચ્છેદમાં મૂળભૂત ફરજોની જોગવાઈ કરેલ છે?",
      options: [
        "અનુચ્છેદ -21",
        "અનુચ્છેદ- 51",
        "અનુચ્છેદ 51-A",
        "અનુચ્છેદ-32"
      ],
      correctAnswer: 2,
      explanation: "",
      },
    {
      id: 29,
      question: "ગુજરાતમાં ભરાતા મેળા બાબતે નીચેના વિધાનો પૈકી સાચા વિધાન જણાવો.\n1. ડાંગ દરબાર આહવા ખાતે ફાગણ સુદ પુનમનાં દિવસે ભરાય છે.\n2. મીરા દાતારનો મેળો મહેસાણાના ઉનાવા ખાતે રજત માસની તારીખ 16થી 22 દરમિયાન ભરાય છે.",
      options: [
        "ફક્ત 1",
        "ફક્ત 2",
        "બંન્ને",
        "એકપણ નહિ"
      ],
      correctAnswer: 2,
      explanation: "",
      },
    {
      id: 30,
      question: "ગુજરાતમાં ભરાતા મેળા બાબતે નીચેના વિધાનો પૈકી સાચા વિધાનો ધ્યાને લો.\n1. ભવનાથનો મેળો -ગિરનાર (જૂનાગઢ)\n2. તરણેતરનો મેળો – તરણેતર (સુરેન્દ્રનગર )\n3. ભડીયાદનો મેળો – બોટાદ",
      options: [
        "ફક્ત 1 અને 3",
        "ફક્ત 2 અને 3",
        "ફક્ત 1 અને 2",
        "આપેલ તમામ"
      ],
      correctAnswer: 2,
      explanation: "",
      }
  ]
};
