import type { TestData } from "@/types";

export const chapter6Test: TestData = {
  chapterId: "chapter-6",
  chapterTitle: "ટેસ્ટ 6",
  totalQuestions: 40,
  questions: [
    {
      id: 1,
      question: "ભારતની ભૌગોલિક દ્રષ્ટિએ નીચેના વિધાનો ધ્યાને લો.\n1) ભારતનો મુખ્ય ભૂમિખંડોના વ્યાપ 8.4 થી 37.6 ઉત્તર અક્ષાંશવૃત વિસ્તરેલો છે.\n2) ભારત મુખ્ય ભૂમિખંડનો 68.7 થી 97.25 પૂર્વ રેખાંશવવૃત વચ્ચે આવેલો છે.\nઉપરોક્ત પૈકી સાચા વિધાન જણાવો.",
      options: [
        "ફકત 1",
        "ફકત 2",
        "બંન્ને",
        "એકપણ નહિ"
      ],
      correctAnswer: 2,
      explanation: "",
      },
    {
      id: 2,
      question: "ભારતની ભૌગોલિક રચના બાબતે નીચેના વિધાનો ધ્યાને લો.\n1) ભારતની મધ્યમાંથી કર્કવૃત્ત પસાર થાય છે જે 23.30 ઉત્તર અક્ષાંશવૃત પર આવેલ છે.\n2) ભારતનો ઉત્તર ભાગ વધુ પૂર્વ પશ્ચિમ દિશાઓમાં ફેલાયેલો છે.\n3) ભારતના કર્કવૃત્તથી દક્ષિણે આવેલું ક્ષેત્ર ત્રિકોણ ધરાવે છે.\nઉપરોક્ત પૈકી ખોટા વિધાન જણાવો.",
      options: [
        "ફકત 1",
        "ફકત 2 અને 3",
        "ફકત 3",
        "એકપણ નહિ"
      ],
      correctAnswer: 3,
      explanation: "",
      },
    {
      id: 3,
      question: "ભારતના કદ અને વિસ્તાર બાબતે નીચેના વિધાનો ધ્યાને લો.\n1) ભારતનો દક્ષિણ તરફનો ભૂ-ભાગ સાંકડો થતો જાય છે.\n2) ભારત લદ્દાખથી કન્યાકુમારી ઉત્તરથી દક્ષિણની લંબાઈ 3214 કિ.મી છે.\n3) પશ્ચિમે ગુજરાતથી શરૂ કરી પૂર્વ અરુણાચલ પ્રદેશ સુધીનો વિસ્તાર 2933 કિ.મી છે.\nઉપરોક્ત પૈકી સાચા વિધાન જણાવો.",
      options: [
        "ફકત 1 અને 3",
        "ફકત 2 અને 3",
        "ફકત 3",
        "આપેલ તમામ"
      ],
      correctAnswer: 3,
      explanation: "",
      },
    {
      id: 4,
      question: "ભારતની ભૌગોલિક દ્રષ્ટિએ નીચેના વિધાનો પૈકી સાચા વિધાન જણાવો.\n1) ભારતના પૂર્વ તથા પશ્ચિમે આવેલા દૂરના સ્થળોનો સ્થાનિક સમય આશરે 2 કલાકનો તફાવત છે.\n2) ભારતનો પ્રમાણ સમયની રેખા 82.30 પૂર્વ રેખાંશવૃત્ત છે, જે ચાર રાજ્યોમાંથી પસાર થાય છે.",
      options: [
        "ફકત 1",
        "ફકત 2",
        "બંન્ને",
        "એકપણ નહિ"
      ],
      correctAnswer: 0,
      explanation: "",
      },
    {
      id: 5,
      question: "ભારતના પાડોશી દેશોના સંદર્ભે કઈ જોડ અયોગ્ય છે?",
      options: [
        "અફઘાનિસ્તાન - ઉત્તર-પશ્ચિમ",
        "નેપાળ - ઉત્તરપૂર્વ",
        "ચીન - ઉત્તર",
        "બાંગ્લા દેશ - પશ્ચિમ"
      ],
      correctAnswer: 3,
      explanation: "",
      },
    {
      id: 6,
      question: "નીચે આપેલા રાજ્યોનો પશ્ચિમથી પૂર્વ દિશા તરફનો સાચો ક્રમ જણાવો.",
      options: [
        "રાજસ્થાન, ઉત્તરપ્રદેશ, બિહાર, મેઘાલય",
        "બિહાર, ઉત્તરપ્રદેશ, રાજસ્થાન, મેઘાલય",
        "મેઘાલય, બિહાર, ઉત્તરપ્રદેશ, રાજસ્થાન",
        "રાજસ્થાન, મેઘાલય, બિહાર, ઉત્તરપ્રદેશ"
      ],
      correctAnswer: 0,
      explanation: "",
      },
    {
      id: 7,
      question: "ઈન્ડો ઓસ્ટ્રેલિયન પ્લેટ અને યુરેશિયન પ્લેટના ટકરાવથી ટેથિસ સમુદ્રમાંથી કઈ પર્વતશ્રેણીનું નિર્માણ થયું હતું?",
      options: [
        "હિમાલય",
        "એન્ડીઝ",
        "રોકીઝ",
        "આલ્પ્સ"
      ],
      correctAnswer: 0,
      explanation: "",
      },
    {
      id: 8,
      question: "ભારતની ભૌગોલિક દ્રષ્ટિએ નીચેના વિધાનો પૈકી સાચા વિધાન જણાવો.\n1) ભારતનો કુલ વિસ્તાર 32.8 લાખ ચો. કી.મી છે.\n2) ક્ષેત્રફળની દ્રષ્ટિએ ભારત વિશ્વમાં આઠમા ક્રમે છે.\n3) ભારત વિશ્વના ભૂમિભાગ ક્ષેત્રના કેવળ 2.42 ટકા ભાગ ધરાવે છે.",
      options: [
        "ફકત 1 અને 2",
        "ફકત 2 અને 3",
        "ફકત 1 અને 3",
        "આપેલ તમામ"
      ],
      correctAnswer: 2,
      explanation: "",
      },
    {
      id: 9,
      question: "ક્ષેત્રફળની દ્રષ્ટિએ વિશ્વના સૌથી મોટા દેશોને ઉતરતા ક્રમમાં ગોઠવતા કયો ક્રમ સાચો છે?",
      options: [
        "રશિયા, યુ.એસ., કેનેડા, ચીન, બ્રાઝિલ, ઓસ્ટ્રેલિયા, ભારત",
        "રશિયા, કેનેડા, યુ.એસ, બ્રાઝીલ, ચીન, ઓસ્ટ્રેલિયા, ભારત",
        "રશિયા, કેનેડા, યુ.એસ., ચીન, બ્રાઝીલ, ઓસ્ટ્રેલિયા, ભારત",
        "રશિયા, કેનેડા, યુ.એસ, ચીન, ઓસ્ટ્રેલિયા, બ્રાઝિલ, ભારત"
      ],
      correctAnswer: 2,
      explanation: "",
      },
    {
      id: 10,
      question: "કઈ પ્લેટો પર આવેલા ભૂમિખંડો નિરંતર ખસતા રહે છે?",
      options: [
        "અગ્નિકૃત ખડકો",
        "પ્રસ્તર પ્લેટો",
        "રૂપાંતરિત પ્લેટો",
        "વિકૃત પ્લેટો"
      ],
      correctAnswer: 2,
      explanation: ""
    },
    {
      id: 11,
      question: "ભારતની ભૌગોલિક દ્રષ્ટિએ નીચેના વિધાનો પૈકી કયું વિધાન સાચા છે?\n1) ભારતનો ભૂમિભાગ એશિયાખંડની દક્ષિણ તરફ આવેલો છે.\n2) ભારતની ઉત્તરમાં ઊંચી પર્વત શ્રેણીઓ સેંકડો કિલોમીટર લંબાઇમાં પશ્ચિમથી પૂર્વ દિશામાં પથરાયેલી છે.\n3) દક્ષિણમાં ભારતીય દ્વીપકલ્પની પશ્ચિમમાં બંગાળાની ખાડી અને પૂર્વમાં અરબસાગર આવેલ છે.",
      options: [
        "ફકત 1 અને 3",
        "ફકત 2 અને 3",
        "ફકત 1 અને 2",
        "આપેલ તમામ"
      ],
      correctAnswer: 2,
      explanation: "",
      },
    {
      id: 12,
      question: "ભારત કરોડો વર્ષ પહેલા કયા પ્રાચીન વિશાળ ભૂમિખંડનો ભાગ હતો?",
      options: [
        "અપસારી પ્લેટ",
        "યુરેશિયન પ્લેટ",
        "અભિસારી પ્લેટ",
        "ગોંડવાના લેન્ડ"
      ],
      correctAnswer: 3,
      explanation: "",
      },
    {
      id: 13,
      question: "ભારતના અક્ષાંશીય અને રેખાંશીય વિસ્તારો આશરે કેટલા અંશ જેટલા હોય છે?",
      options: [
        "30°",
        "35°",
        "25°",
        "20°"
      ],
      correctAnswer: 0,
      explanation: "",
      },
    {
      id: 14,
      question: "નીચેના જોડકા જોડો.\n(અ) 1. ભારતનો પ્રમાણ સમય, 2. કર્કવૃત્ત, 3. ઈન્ડોનેશિયા, 4. ભારતનો પ્રાચીનતમ પ્રદેશ\n(બ) (A) 23.30 ઉત્તર અક્ષાંશવૃત્ત, (B) 82.30 પૂર્વ રેખાંશવૃત્ત, (C) દક્ષિણનો દ્વીપકલ્પીય પ્રદેશ, (D) મલાકાની સામુદ્રધુની",
      options: [
        "1-A, 2-B, 3-C, 4-D",
        "1-B, 2-A, 3-D, 4-C",
        "1-D, 2-C, 3-B, 4-A",
        "1-B, 2-A, 3-C, 4-D"
      ],
      correctAnswer: 1,
      explanation: "",
      },
    {
      id: 15,
      question: "નીચે આપેલા રાજ્યોને ઉત્તરથી દક્ષિણ દિશા તરફ સાચો ક્રમ જણાવો.",
      options: [
        "કેરળ, આંધ્રપ્રદેશ, દિલ્હી, મધ્યપ્રદેશ, ઉત્તરાખંડ",
        "આંધ્રપ્રદેશ, મધ્યપ્રદેશ, ઉત્તરાખંડ, દિલ્હી, કેરલ",
        "કેરલ, આંધ્રપ્રદેશ, મધ્યપ્રદેશ, દિલ્હી, ઉત્તરાખંડ",
        "ઉત્તરાખંડ, દિલ્હી, મધ્યપ્રદેશ, આંધ્રપ્રદેશ, કેરળ"
      ],
      correctAnswer: 3,
      explanation: "",
      },
    {
      id: 16,
      question: "હિમાલય બાબતે નીચેના વિધાનો ધ્યાને લો.\n1) પીરપંજાલ, મહાભારત અને નાગટીબા શ્રેણી બૃહદ હિમાલયમાં આવેલી છે.\n2) કુલ્લુ, કાંગડા તથા કાશ્મીર મધ્ય હિમાલયના અત્યંત રમણીય સ્થળો છે.\n3) શિવાલિક શ્રેણીને (બાહ્ય હિમાલય) તરીકે ઓળખવામાં આવે છે.\nઉપરોક્ત પૈકી સાચા વિધાન જણાવો.",
      options: [
        "ફકત 1 અને 2",
        "ફકત 2 અને 3",
        "ફકત 3",
        "આપેલ તમામ"
      ],
      correctAnswer: 1,
      explanation: "",
      },
    {
      id: 17,
      question: "હિમાલયની ભૌગોલિક રચના બાબતે નીચેના વિધાનો ધ્યાને લો.\n1) શિવાલિક શ્રેણીમાં દૂન અને દ્વાર આવેલા છે.\n2) શિવાલિક શ્રેણી 10થી 15 કિમી પહોળાઈ ધરાવે છે.\n3) અલમૌડા, નૈનિતાલ અને દાર્જીલીંગ મધ્ય હિમાલયમાં આવેલા સ્થળો છે.\nઉપરોક્ત પૈકી સાચા વિધાન જણાવો.",
      options: [
        "ફકત 1 અને 3",
        "ફકત 1 અને 2",
        "ફકત 2 અને 3",
        "આપેલ તમામ"
      ],
      correctAnswer: 3,
      explanation: "",
      },
    {
      id: 18,
      question: "નીચેના જોડકા જોડો.\n(1) ઘોડાની નાળ જેવા પરવાળા દ્વીપો (A) આગ્નેય ખડકો\n(2) અંદમાન નિકોબાર ટાપુઓ (B) પરવાળાના દ્વીપો (એટોલ)\n(3) પ્રાથમિક ખડકો (C) બંગાળાની ખાડી\n(4) આરસપહાણ (D) રૂપાંતરિત ખડક",
      options: [
        "1-A, 2-B, 3-C, 4-D",
        "1-B, 2-C, 3-A, 4-D",
        "1-D, 2-C, 3-B, 4-A",
        "1-B, 2-C, 3-D, 4-A"
      ],
      correctAnswer: 1,
      explanation: "",
      },
    {
      id: 19,
      question: "નીચેના વિધાનો ધ્યાને લો.\n1) અંદમાન અને નિકોબાર દ્વીપસમૂહોને આવેલ બેરન ભારતનો એકમાત્ર સુષુપ્ત જ્વાળામુખી છે.\n2) અંદમાન-નિકોબારમાં આવેલ નારકોન્ડમ ભારતનો સક્રિય જ્વાળામુખી છે.\nઉપરોક્ત પૈકી સાચા વિધાન જણાવો.",
      options: [
        "ફકત 1",
        "ફકત 2",
        "બંન્ને",
        "એકપણ નહિ"
      ],
      correctAnswer: 3,
      explanation: "",
      },
    {
      id: 20,
      question: "નીચેના વિધાનો ધ્યાને લો.\n1) માળવાના ઉચ્ચપ્રદેશના ઉત્તર-પશ્ચિમ ભાગમાં અરવલ્લીની ગિરિમાળા આવેલી છે.\n2) અરવલ્લી વિશ્વની પ્રાચીનતમ ગિરિમાળા પૈકીની અવશિષ્ટ પર્વત સંરચના ધરાવે છે.\nઉપરોક્ત પૈકી સાચા વિધાન જણાવો.",
      options: [
        "ફકત 1",
        "ફકત 2",
        "બંન્ને",
        "એકપણ નહિ"
      ],
      correctAnswer: 0,
      explanation: ""
    },
    {
      id: 21,
      question: "નીચેના જોડ બાબતે નીચેના વિધાનો ધ્યાને લો.\n1) પતકાઈ ટેકરીઓ – નાગાલેન્ડમાં આવેલી છે.\n2) નાગા ટેકરીઓ - મિઝોરમમાં આવેલ છે.\n3) લુસાઈ ટેકરીઓ - નાગાલેન્ડમાં આવેલી છે.\nઉપરોક્ત પૈકી સાચા વિધાન જણાવો.",
      options: [
        "ફકત 1 અને 3",
        "ફકત 2 અને 3",
        "ફકત 1 અને 2",
        "એકપણ નહિ"
      ],
      correctAnswer: 3,
      explanation: "",
      },
    {
      id: 22,
      question: "દક્ષિણથી શરૂ કરી ઉત્તર તરફ આવેલા પહાડોનો સાચો ક્રમ કયો છે?",
      options: [
        "નીલગિરિ, સહ્યાદ્રી, અન્નામલાઈ",
        "અન્નામલાઈ, સહ્યાદ્રી, નીલગિરિ",
        "અન્નામલાઈ, નીલગિરિ, સહ્યાદ્રી",
        "સહ્યાદ્રી, અન્નામલાઈ, નીલગિરિ"
      ],
      correctAnswer: 2,
      explanation: ""
    },
    {
      id: 23,
      question: "નીચેના વિધાનો પૈકી સાચા વિધાન જણાવો.\n1) દિલ્હીની પશ્ચિમ બાજુએ સતલજનું અને પૂર્વ બાજુએ ગંગાનું મેદાન આવેલું છે.\n2) દિલ્હીને ગંગાના મેદાનનું-પ્રવેશદ્વાર કહેવામાં આવે છે.\n3) સિંધુ નદી પશ્ચિમ તરફ વહીને ઝડપી વળાંક લઈને દક્ષિણ તરફ વહી અરબસાગરને મળે છે.",
      options: [
        "ફકત 1 અને 3",
        "ફકત 2 અને 3",
        "ફકત 1 અને 2",
        "આપેલ તમામ"
      ],
      correctAnswer: 3,
      explanation: "",
      },
    {
      id: 24,
      question: "ભારતના મેદાની પ્રદેશ બાબતે નીચેના વિધાનો પૈકી સાચા વિધાન જણાવો.\n1) સિંધુ નદી અને તિસ્તા નદી વચ્ચેના મેદાનને બાંગરના મેદાન કહે છે.\n2) મેદાનોમાં જુના કાંપને ભાબર કહે છે.\n3) પુરના મેદાનોમાં નવો કાંપ “ખદર” કહેવાય છે.",
      options: [
        "ફકત 1 અને 3",
        "ફકત 2 અને 3",
        "ફકત 3",
        "આપેલ તમામ"
      ],
      correctAnswer: 2,
      explanation: "",
      },
    {
      id: 25,
      question: "નીચેના વિધાનો પૈકી સાચા વિધાન જણાવો.\n1) વિશ્વનું સૌથી ઉંચુ શિખર માઉન્ટ એવરેસ્ટ બૃહદ હિમાલયમાં આવેલ છે.\n2) માઉન્ટ એવરેસ્ટ નેપાળ-ચીનની સરહદે આવેલ છે.\n3) માઉન્ટ એવરેસ્ટને ચીનમાં સાગર મથ્થા તરીકે ઓળખવામાં આવે છે.",
      options: [
        "ફકત 1 અને 2",
        "ફકત 2 અને 3",
        "ફકત 3",
        "આપેલ તમામ"
      ],
      correctAnswer: 0,
      explanation: "",
      },
    {
      id: 26,
      question: "ખનીજો બાબતે નીચેના જોડ પૈકી સાચી જોડ ધ્યાને લો.\n1. કિંમતી ધાતુમય ખનિજો – સોનું, ચાંદી, પ્લેટિનમ\n2. હલકી ખનિજો – મેગ્નેશિયમ, બોક્સાઈડ, ટીટાનિયમ\n3. મિશ્ર ખનિજો – ક્રોમિયમ, મેંગેનીઝ, ટંગસ્ટન",
      options: [
        "ફકત 1 અને 3",
        "ફકત 2 અને 3",
        "ફકત 3",
        "આપેલ તમામ"
      ],
      correctAnswer: 3,
      explanation: "",
      },
    {
      id: 27,
      question: "અધાતુમય ખનિજોમાં નીચેનામાંથી કોનો સમાવેશ થાય છે?\n1. ચૂનાના ખડક 2. એસ્બેસ્ટોસ\n3. અબરખ 4. ફ્લોરોસ્પાર\n5. જિપ્સમ 6. બોક્સાઈડ",
      options: [
        "ફકત 2,3,4,5 અને 6",
        "ફકત 1,2,3,4 અને 5",
        "ફકત 3,4,5 અને 6",
        "આપેલ તમામ"
      ],
      correctAnswer: 1,
      explanation: "",
      },
    {
      id: 28,
      question: "ભારતમાં જમીનોના પ્રકારો બાબતે નીચેના પૈકી કયું/ કયા વિધનો સાચા છે?\n1. આગ્નેય અને રૂપાંતરીત ખડકો ધરાવતા ક્ષેત્રોમાં કાળી જમીન આવેલી હોય છે.\n2. કાળી જમીનને “રેગુર” નામે પણ ઓળખવામાં આવે છે.",
      options: [
        "ફકત 1",
        "ફકત 2",
        "બંન્ને",
        "એકપણ નહિ"
      ],
      correctAnswer: 1,
      explanation: ""
    },
    {
      id: 29,
      question: "તટીય મેદાનો બાબતે નીચેના વિધાન પૈકી સાચા વિધાનો જણાવો.\n1. પશ્ચિમનું તટીય મેદાન ગુજરાતથી કેરળ સુધી ફેલાયેલ છે.\n2. ગોવાથી દક્ષિણ ના મેદાનને મલબાર તટ કહેવામાં આવે છે.\n3. પુર્વ તટીય મેદાન પશ્ચિમના તટીય મેદાન કરતાં પ્રમાણમાં વધારે પહોળું છે.",
      options: [
        "ફકત 1 અને 3",
        "ફકત 2 અને 3",
        "ફકત 2",
        "આપેલ તમામ"
      ],
      correctAnswer: 3,
      explanation: "",
      },
    {
      id: 30,
      question: "કઇ ગિરિમાળા વિશ્વની પ્રાચીનતમ ગિરિમાળાઓ પૈકીની એક છે?",
      options: [
        "વિંધ્યાંચળ",
        "સહ્યાદ્રી",
        "નીલગિરિ",
        "અરવલ્લી"
      ],
      correctAnswer: 3,
      explanation: "",
      },
    {
      id: 31,
      question: "જળ-પરિવાહ બાબતે નીચેના વિધાનો પૈકી સાચા વિધાન જણાવો.\n(1) વિશ્વ સૌથી મોટો નદી-બેસીન નાઈલ નદીનો છે\n(2) ભારતમાં સૌથી મોટો નદી-બેસીન ગંગા નદીનો છે.",
      options: [
        "ફકત 1",
        "ફકત 2",
        "બંન્ને",
        "એકપણ નહિ"
      ],
      correctAnswer: 1,
      explanation: "",
      },
    {
      id: 32,
      question: "ગંગાને મળતી મુખ્ય નદીઓ કઈ કઈ છે?",
      options: [
        "યમુના, ઘાઘરા, ગંડક અને કોસી",
        "યમુના, ચંબલ, ઘાઘરા અને કોસી",
        "યમુના, ઘાઘરા, શરાવતી, અને કોસી",
        "નર્મદા, ઘાઘરા, ગંડક અને કોસી"
      ],
      correctAnswer: 0,
      explanation: "",
      },
    {
      id: 33,
      question: "સિંધુ નદી બાબતે નીચેના વિધાનો પૈકી સાચા વિધાન જણાવો.\n(1) સિંધુ નદીની લંબાઈ 2900 કિમી લાંબી છે.\n(2) સિંધુનદીના પાણીની વહેચણી 1960માં કરવામાં આવી હતી.\n(3) ભારતમાં સિંધુનદીના 30% હિસ્સો વાપરવાનો હક છે.",
      options: [
        "ફકત 1 અને 2",
        "ફકત 2 અને 3",
        "ફકત 1 અને 3",
        "આપેલ તમામ"
      ],
      correctAnswer: 0,
      explanation: "",
      },
    {
      id: 34,
      question: "ગંગાનદી તંત્ર બાબતે નીચેના વિધાનો પૈકી સાચા વિધાન જણાવો\n(1) ગંગાનદી ગંગોત્રી હિમનદીમાંથી નીકળેલ ભગીરથી અને અલકનંદા રુદ્રપ્રયાગ પાસે પરસ્પર મળે છે.\n(2) યમુના નદી ગંગાને ડાબીબાજુથી વહીને અલાહાબાદ પાસે ગંગામાં ભળી જાય છે.",
      options: [
        "ફકત 1",
        "ફકત 2",
        "બંન્ને",
        "એકપણ નહિ"
      ],
      correctAnswer: 3,
      explanation: "",
      },
    {
      id: 35,
      question: "ગંગાનદી તંત્ર બાબતે નીચેના વિધાનો પૈકી સાચા વિધાન જણાવો?\n(1) ગંગાના ઉત્તરના મેદાનોમાં પુરનો પ્રકોપ જોવા મળે છે.\n(2) ચંબલ અને બેતવા નદી ગંગા તથા શોણનદી યમુનાને મળે છે.\n(3) ઘાઘરા, ગંડક અને કોસીના મુળ ચીનમાં છે.",
      options: [
        "ફકત 1",
        "ફકત 1 અને 2",
        "ફકત 2 અને 3",
        "આપેલ તમામ"
      ],
      correctAnswer: 0,
      explanation: ""
    },
    {
      id: 36,
      question: "નીચેના વિધાનો પૈકી સાચા વિધાન જણાવો.\n(1) ગંગાના મુખત્રિકોણ પ્રદેશને સુંદરવન કહેવામાં આવે છે.\n(2) ગંગાના સંદર્ભે સુંદરવન મુખપ્રદેશ એ મેન્ગ્રુવના જંગલોનાં અત્યંત જાણીતો છે.\n(3) ગંગા અને સિંધુનદીને જળ વિભાજનનું કાર્ય અંબાલા શહેર કરે છે.",
      options: [
        "ફકત 1 અને 3",
        "ફકત 2 અને 3",
        "ફકત 1 અને 3",
        "આપેલ તમામ"
      ],
      correctAnswer: 3,
      explanation: "",
      },
    {
      id: 37,
      question: "બ્રહ્મપુત્રા નદી તંત્ર વિશે નીચેના વિધાનો પૈકી સાચા વિધાન જણાવો.\n(1) બ્રહ્મપુત્રા નદી તિબ્બતના માનસરોવરની પૂર્વમાંથી તથા સિંધુ અને સતલુજના મુળની નજીકથી નીકળે છે.\n(2) તેની વધુ પ્રવાહ લંબાઈ ભારતની બહાર છે.\n(3) આ નદી હિમાલયની શ્રેણીને સમાંતર પશ્ચિમમાં વહે છે.",
      options: [
        "ફકત 1 અને 2",
        "ફકત 2 અને 3",
        "ફકત 3",
        "આપેલ તમામ"
      ],
      correctAnswer: 0,
      explanation: ""
    },
    {
      id: 38,
      question: "નીચેના જોડકા જોડો.\n(અ) 1. સિંધુનદીની એક શાખા, 2. બાંગ્લાદેશમાં ગંગાનો પ્રવાહ, 3. ધુંઆધાર ધોધ, 4. દ્વીપકલ્પિય નદીઓમાં મોટી નદી\n(બ) (A) બિયાસ, (B) પદ્મા, (C) નર્મદાનદી, (D) ગોદાવરી",
      options: [
        "1-D, 2-C, 3-B, 4-A",
        "1-A, 2-B, 3-C, 4-D",
        "1-A, 2-B, 3-D, 4-C",
        "1-D, 2-B, 3-A, 4-A"
      ],
      correctAnswer: 1,
      explanation: "",
      },
    {
      id: 39,
      question: "દ્વીપકલ્પીય નદીઓ બાબતે નીચેના વિધાનો પૈકી સાચા વિધાન જણાવો.\n(1) પશ્ચિમઘાટ દક્ષિણ ભારતના પશ્ચિમ કિનારે દક્ષિણથી ઉત્તરદિશામાં વ્યાપ્ત છે.\n(2) મહાનદી, ગોદાવરી, કૃષ્ણા મુખ્યત્વે, મુખ્‍ય ત્રિકોણ પ્રદેશ (ડેલ્ટા) ધરાવે છે.\n(3) નર્મદા અને તાપી જેવી નદી પશ્ચિમથી પૂર્વ તરફ વહે છે.",
      options: [
        "ફકત 2 અને 3",
        "ફકત 1 અને 3",
        "ફકત 1 અને 2",
        "આપેલ તમામ"
      ],
      correctAnswer: 2,
      explanation: "",
      },
    {
      id: 40,
      question: "નર્મદાબેસીન વિશે નીચેના વિધાનો પૈકી કયું / કયાં વિધાન સાચા છે?\n(1) નર્મદા નદી મહારાષ્ટ્રના અમરકંટક પાસેથી નીકળે છે.\n(2) જબલપુર પાસે ધુંઆધાર નામના ધોધની રચના થાય છે.\n(3) નર્મદાનદીનો બેસીન વિસ્તાર મધ્યપ્રદેશ અને ગુજરાતમાં વ્યાપ્ત છે.\n(4) નર્મદા નદીની લંબાઈ 1312 કિમી છે.",
      options: [
        "ફકત 1, 2 અને 3",
        "ફકત 2, 3 અને 4",
        "ફકત 1, 3 અને 3",
        "આપેલ તમામ"
      ],
      correctAnswer: 1,
      explanation: "",
      }
  ]
};
