import type { TestData } from "@/types";

export const chapter2Test: TestData = {
  chapterId: "chapter-2",
  chapterTitle: "ટેસ્ટ 2",
  totalQuestions: 40,
  questions: [
    {
      id: 1,
      question: "નીચેના વિધાનોમાંથી કયું/કયાં વિધાન/વિધાનો સાચા છે?\n1. ભારત અને યુરોપ વચ્ચે વ્યાપાર માત્ર જમીન માર્ગે થતો હતો.\n2. તુર્ક મુસ્લિમોએ કોન્સ્ટેન્ટિનોપલ ઈ.સ. 1453માં જીતી લીધુ.\n3. ભારતના મરીમસાલા, મલમલ, રેશમી કાપડ, ગળી વગેરેની યુરોપના દેશોમાં ખૂબ જ માંગ રહેતી.",
      options: [
        "માત્ર 1 અને 2",
        "માત્ર 2 અને 3",
        "1, 2 અને 3",
        "એકપણ નહિ"
      ],
      correctAnswer: 1,
      explanation: "",
      },
    {
      id: 2,
      question: "નીચેના વિધાનોમાંથી કયુ/કયા વિધાન /વિધાનો ખોટા છે?\n1. બાર્થોલોમ્યુ ડાયઝે “કેપ ઓફ ગુડ હોપ” ભૂશિરની શોધ કરી.\n2. પોર્ટુગીઝ નાવિક વાસ્કો-દ-ગામાએ ઈ.સ. 1500માં ભારત આવવાના જળમાર્ગની શોધ કરી.",
      options: [
        "માત્ર 1",
        "માત્ર 2",
        "માત્ર 1, 2",
        "એકપણ નહિ"
      ],
      correctAnswer: 1,
      explanation: "",
      },
    {
      id: 3,
      question: "નીચેના વિધાનો ધ્યાને લો.\n1. નિયામક ધારા પ્રમાણે સૌપ્રથમ વોરન હેસ્ટિંગ ભારતનો ગવર્નર હતો.\n2. ભારતમાં મુંબઇ, ચેન્નાઇ અને કોલકતામાં યુનિવર્સિટીઓ ચાર્લ્સવુડ ની ભલામણથી શરુ થઇ હતી.\nઉપરોક્ત પૈકી સાચા વિધાન જણાવો.",
      options: [
        "ફકત 1",
        "ફકત 2",
        "બંને સાચા",
        "એકપણ નહિ"
      ],
      correctAnswer: 2,
      explanation: "",
      },
    {
      id: 4,
      question: "નીચેનામાંથી કયા /કયુ વિધાન /વિધાનો સાચુ /સાચા છે?\n1. ભારતમાં વેપાર કરવા સૌપ્રથમ ફિરંગી પ્રજા આવી.\n2. ફિરંગીઓએ દીવ, દમણ, ગોવા, કોચીન, મલાક્કા પ્રદેશો પોતાના નિયંત્રણમાં લાવી દીધા.\n3. ભારતમાં ડેનિશ પ્રજા હોલેન્ડથી આવી હતી.",
      options: [
        "માત્ર 1, 2",
        "1, 2 અને 3",
        "માત્ર 2, 3",
        "એકપણ નહી"
      ],
      correctAnswer: 0,
      explanation: "",
      },
    {
      id: 5,
      question: "નીચેનામાંથી કયા /કયુ વિધાન /વિધાનો સાચુ /સાચા છે?\n1. મછલીપટ્ટમ – આંધ્રપ્રદેશ\n2. સેંન્ટ જ્યોર્જ – ચેન્નાઇ\n3. ફોટૅ વિલિયમ - કોલકાતા",
      options: [
        "ફકત 1 અને 3 સાચા",
        "ફકત 2 અને 3",
        "ફકત 3",
        "આપેલ તમામ"
      ],
      correctAnswer: 3,
      explanation: "",
      },
    {
      id: 6,
      question: "નીચેનામાંથી કયું/કયા વિધાન /વિધાનો સાચુ /સાચા છે?\n1. ઈ.સ. 1600માં કંપનીનું પ્રથમ વહાણ કપ્તાન વિલિયમ હોકિન્સની આગેવાની હેઠળ સુરત આવ્યું.\n2. ઇસ્ટ ઇન્ડિયા કંપનીને ઝામોરિન રાજા તરફથી વેપાર કરવાની પરવાનગી મળી હતી.",
      options: [
        "ફકત 1",
        "ફકત 2",
        "બંને",
        "એકપણ નહિ"
      ],
      correctAnswer: 3,
      explanation: "",
      },
    {
      id: 7,
      question: "નીચેના વિધાનો પૈકી સાચા વિધાનો જણાવો.\n1. ગવર્નર જનરલ હેસ્ટીંગ્સે ગુરખાઓને લશ્કરમાં દાખલ કર્યા હતા.\n2. રોબર્ટ ક્લાઇવના કાવતરાથી પ્લાસીનું યુધ્ધ માત્ર બે દિવસમાં પુરુ થયુ હતુ.",
      options: [
        "ફકત 1",
        "ફકત 2",
        "બંને",
        "એકપણ નહિ"
      ],
      correctAnswer: 0,
      explanation: "",
      },
    {
      id: 8,
      question: "કોર્નવોલિસે ટીપુ સુલતાન સાથે કયો વિગ્રહ કર્યો હતો?",
      options: [
        "પહેલો મૈસુર વિગ્રહ",
        "બીજો મૈસુર વિગ્રહ",
        "ત્રીજો મૈસુર વિગ્રહ",
        "ત્રીજો કર્ણાટક વિગ્રહ"
      ],
      correctAnswer: 2,
      explanation: "",
      },
    {
      id: 9,
      question: "પ્લાસીના યુદ્ધ માટે નીચેના વિધાનો માંથી કયું/કયા સાચુ/ સાચા છે?\n1. પ્લાસીનું યુદ્ધ 23 જૂન 1757ના રોજ લડાયુ.\n2. પ્લાસીનું યુદ્ધ અંગ્રેજો તરફથી કેપ્ટન હોકિન્સની આગેવાની હેઠળ થયુ.\n3. પ્લાસીના યુદ્ધથી ઈસ્ટ ઈન્ડિયા કંપનીને ચોવીસ પરગણાની જાગીર મળી.",
      options: [
        "માત્ર 1 , 2",
        "માત્ર 1 , 3",
        "માત્ર 2, 3",
        "ઉપરના તમામ"
      ],
      correctAnswer: 1,
      explanation: "",
      },
    {
      id: 10,
      question: "જોડકા જોડો.\n1. “મીઠા ઝેર” જેવી યોજના (A) ટીપુ સુલતાન\n2. મૌસુરનો વાઘ (B) ડેલહાઉસી\n3. બાળલગ્ન પ્રતિબંધક ધારો ઘડનાર (C) ઝામોરિન\n4. કાલિકટનો રાજા (D) વેલેસ્લી",
      options: [
        "1-D, 2-A, 3-B, 4-C",
        "1-B, 2-C, 3-D, 4-A",
        "4-A, 2-D, 3-C, 4-B",
        "1-B, 2-C, 3-A, 4-D"
      ],
      correctAnswer: 0,
      explanation: "",
      },
    {
      id: 11,
      question: "બકસરના યુદ્ધ વિશે નીચેનામાંથી કયું/કયા વિધાન/ વિધાનો સાચુ/સાચા છે?\n1. બકસરનું યુદ્ધ 22, October 1764 ના રોજ થયુ હતું.\n2. બકસરના યુદ્ધમાં સંયુક્ત સેનાની જીત થઈ.\n3. બકસરના યુદ્ધથી કંપનીને બંગાળ, બિહાર અને ઓરિસ્સાની દિવાની સત્તા મળી.",
      options: [
        "માત્ર 2, 3",
        "માત્ર 1, 2",
        "માત્ર 1 અને 3",
        "એકપણ નહી"
      ],
      correctAnswer: 2,
      explanation: "",
      },
    {
      id: 12,
      question: "નીચેના વિધાનોમાંથી કયુ/કયા વિધાન/વિધાનો ખોટુ/ ખોટા છે?\n1. બંગાળમાં સિરાજ-ઉદ્-દૌલાનું શાસન હતું.\n2. પ્લાસીની યુદ્ધથી ઈસ્ટ ઈન્ડિયા કંપનીને 24 પરગણાની જાગીર મળી.\n3. પ્લાસીના યુદ્ધ દ્વારા ભારતમાં કંપનીનો પાયો નંખાયો.",
      options: [
        "માત્ર 1 અને 2",
        "માત્ર 2 અને 3",
        "1, 2 અને 3",
        "એકપણ નહી"
      ],
      correctAnswer: 3,
      explanation: "",
      },
    {
      id: 13,
      question: "અમેરિકાના કયા રાષ્ટ્રપતિનું રાષ્ટ્રસંઘની સ્થાપનામાં વિશેષ યોગદાન આપ્યું હતું?",
      options: [
        "ક્લેમેન્સો",
        "જયોર્જ વોશિંગ્ટન",
        "ઓરલેન્ડો",
        "વુડ્રો વિલ્સન"
      ],
      correctAnswer: 3,
      explanation: "",
      },
    {
      id: 14,
      question: "પશ્ચિમ યુરોપ અને એશિયા અને આફ્રિકામાં સંસ્થાનવાદ બાબતે નીચેના વિધાનો પૈકી સાચા વિધાન જણાવો.\n1. એશિયા અને આફ્રિકામાં સંસ્થાનો સ્થાપવામાં પશ્ચિમ યુરોપના રાષ્ટ્રો મુખ્ય હતા.\n2. નેધરલેન્ડ, બેલ્જિયમ અને લક્ઝમબર્ગ પર સ્પેનનો કબજો હતો.",
      options: [
        "ફકત 1",
        "ફકત 2",
        "બંને સાચા",
        "એકપણ નહી"
      ],
      correctAnswer: 2,
      explanation: "",
      },
    {
      id: 15,
      question: "પ્રથમ વિશ્વયુદ્ધ દુરગામી પરિણામોમાં એકનો સમાવેશ થતો નથી?",
      options: [
        "સામ્યવાદી રશિયાને રાષ્ટ્રમાં સ્થાન આપ્યું ન હતું.",
        "અમેરિકા રાષ્ટ્રસંઘમાં જોડાયું નહિ",
        "જગતમાં શાંતિ સ્થપાઈ નહી.",
        "રાષ્ટ્રસંઘમાં બળવાખોર રાષ્ટ્રો પ્રવેશી શક્યા નહી."
      ],
      correctAnswer: 3,
      explanation: "",
      },
    {
      id: 16,
      question: "કઈ સાલમાં ઈંગ્લેન્ડ અને ચીન વચ્ચે યુદ્ધ થયા હતા. જેને ઇતિહાસમાં ‘અફીણ વિગ્રહો’ થયા હતા?",
      options: [
        "ઈ.સ 1839-42",
        "ઈ.સ. 1939-42",
        "ઈ. સ. 1842-44",
        "એકપણ નહી"
      ],
      correctAnswer: 0,
      explanation: "",
      },
    {
      id: 17,
      question: "આફ્રિકામાં સંસ્થાનવાદ બાબતે નીચેના વિધાનો પૈકી સાચા વિધાન જણાવો.\n1. આફ્રિકાના દક્ષિણ ભાગમાં સૌપ્રથમ ડચ પ્રજાએ સંસ્થાન સ્થાપ્યું હતું.\n2. ઈંગ્લેન્ડે કેપમાં અને ફ્રાન્સે ઉત્તર આફ્રિકામાં અલ્જિરિયામાં વેપારી મથકો સ્થાપ્યા હતા.\n3. બેલ્જિયમના રાજા લિયોપોલ્ડે કોંગોંનો વિશાળ પ્રદેશ કબજે કરી પોતાની સત્તા સ્થાપી હતી.",
      options: [
        "ફકત 1 , 3",
        "ફકત 2",
        "ફકત 2 અને 3",
        "આપેલ તમામ"
      ],
      correctAnswer: 3,
      explanation: "",
      },
    {
      id: 18,
      question: "પ્રથમ વિશ્વયુદ્ધને અંતે રાષ્ટ્રસંઘની સ્થાપનામાં કોનું વિશેષ યોગદાન હતું?",
      options: [
        "અમેરિકાના રાષ્ટ્રપ્રમુખ જયોર્જ વોશિંગ્ટનનું",
        "બ્રિટનના વડાપ્રધાન વિન્ટન ચર્ચિલનું",
        "અમેરિકાના રાષ્ટ્રપ્રમુખ અબ્રાહમ લિંકનનું",
        "અમેરિકાના રાષ્ટ્રપ્રમુખ વુડ્રો વિલ્સનનું"
      ],
      correctAnswer: 3,
      explanation: "",
      },
    {
      id: 19,
      question: "નીચેના જોડકા જોડો.\n1. ઓગસ્ટ 1914 (A) વર્સેલ્સની સંધિ\n2. નવેમ્બર 1917 (B) પ્રથમ વિશ્વયુદ્ધની શરૂઆત\n3. જુન 1919 (C) રશિયાની બોલ્શેવિક ક્રાંતિ\n4. 10 જાન્યુઆરી 1920 (D) રાષ્ટ્રસંઘની રચના",
      options: [
        "1-A, 2-B, 3-C, 4-D",
        "1-B, 2-C, 3-A, 4-D",
        "1-D, 2-C, 3-B, 4-A",
        "1-B, 2-C, 3-D, 4-A"
      ],
      correctAnswer: 1,
      explanation: "",
      },
    {
      id: 20,
      question: "પ્રથમ વિશ્વયુદ્ધ બાબતે અયોગ્ય વિધાન પસંદ કરો.",
      options: [
        "ફ્રેન્ક ફર્ટની સંધિ જ પ્રથમ વિશ્વયુદ્ધનું કારણ બન્યું હતું.",
        "પ્રથમ વિશ્વયુદ્ધ ઈ.સ. 1914-1918 દરમિયાન થયું હતું.",
        "ફ્રેન્ક ફર્ટની સંધિ ઈ.સ. 1875માં થઈ હતી.",
        "પ્રથમ વિશ્વયુદ્ધના અંતમાં જ બીજા વિશ્વયુદ્ધના બીજ રોપાઈ ગયાં હતાં"
      ],
      correctAnswer: 2,
      explanation: "",
      },
    {
      id: 21,
      question: "પ્રથમ વિશ્વયુદ્ધને અંતે કઈ સંધિ કરવામાં આવી હતી?",
      options: [
        "ફ્રેન્કફર્ટની સંધિ",
        "બેટર્નની સંધિ",
        "વર્સેલ્સની સંધિ",
        "ગુપ્ત સંધિ"
      ],
      correctAnswer: 2,
      explanation: "",
      },
    {
      id: 22,
      question: "નીચેના વિધાનો પૈકી સાચા વિધાન જણાવો.\n1. પ્રથમ વિશ્વયુદ્ધમાં મિત્ર રાષ્ટ્રપક્ષે 24 અને ધરી રાષ્ટ્રોને 4 રાષ્ટ્રોએ યુદ્ધમાં ભાગ લીધો હતો.\n2. જર્મનીએ પ્રથમ વિશ્વયુદ્ધ દરમિયાન એક સ્ટીમર લ્યુસિટાનિયાને ડૂબાડી દીધી હતી.\n3. જર્મન પ્રજાસત્તાકે 11 નવેમ્બર 1918ના રોજ મિત્ર રાષ્ટ્રોની શરણાગતિ સ્વીકારી અને પ્રથમ વિશ્વયુદ્ધનો અંત આવ્યો.",
      options: [
        "ફકત 1 અને 2",
        "ફકત 2 અને 3",
        "ફકત 3",
        "આપેલ તમામ"
      ],
      correctAnswer: 3,
      explanation: "",
      },
    {
      id: 23,
      question: "વર્સેલ્સની સંધિ બાબતે નીચેના વિધાનો પૈકી સાચા વિધાન જણાવો.\n1. રહાઇન નદી આંતરરાષ્ટ્રીય જળમાર્ગ માટે ખુલ્લી મુકવામાં આવી હતી.\n2. જર્મનીએ રુહુર પ્રાંત જેવા પ્રદેશો ફ્રાન્સને આપવા પડ્યા હતા.\n3. આલ્સેસ અને લોરેન્સ પ્રાંત ફ્રાન્સને પરત કરવામાં આવ્યા હતા.\n4. વર્સેલ્સની સંધિ જુન (1918) માં કરવામાં આવી હતી.",
      options: [
        "ફકત 2,3 અને 4",
        "ફકત 2 અને 4",
        "ફકત 1, 2 અને 3",
        "આપેલ તમામ"
      ],
      correctAnswer: 2,
      explanation: "",
      },
    {
      id: 24,
      question: "રશિયાની બોલ્શેવિક ક્રાંતિ બાબતે નીચેના વિધાનો પૈકી સાચા વિધાન જણાવો.\n1. રશિયામાં પરંપરાગત આવનાર ઝાર રાજાઓ આપખુદ અને નિરંકુશ શાસન ભોગવતા હતા.\n2. 22મી જાન્યુઆરી 1905 ઈતિહાસમાં લોહિયાળ રવિવાર કહેવામાં આવે છે.",
      options: [
        "ફકત 1",
        "ફકત 2",
        "બંને",
        "એકપણ નહી"
      ],
      correctAnswer: 2,
      explanation: "",
      },
    {
      id: 25,
      question: "નીચેનામાંથી કયા વિધાન સાચાં છે?\n1. જર્મનીમાં નાઝીવાદની પક્ષની સ્થાપના કરનાર હિટલર હતો.\n2. ઈટાલીમાં ફાસિસ્ટ પક્ષની સ્થાપના મુસોલીની દ્વારા કરવામાં આવી હતી.",
      options: [
        "માત્ર વિધાન 1",
        "માત્ર વિધાન 2",
        "વિધાન 1 અને 2",
        "કોઈ નહી"
      ],
      correctAnswer: 2,
      explanation: "",
      },
    {
      id: 26,
      question: "નીચેનામાંથી કયા વિધાન સાચાં છે?\n1. સંયુક્ત રાષ્ટ્રની સ્થાપના 1949માં કરવામાં આવી.\n2. સંયુક્ત રાષ્ટ્રનું સૌથી મોટું અંગ સામાન્ય સભા છે.",
      options: [
        "માત્ર 1",
        "માત્ર 2",
        "વિધાન 1 અને 2",
        "એકપણ નહી"
      ],
      correctAnswer: 1,
      explanation: "",
      },
    {
      id: 27,
      question: "સ્પેન દેશનો કબજો કયા કયા રાષ્ટ્રો પર હતો?\n1. નેધરલેન્ડ 2. બેલ્જિયમ\n3. લક્ઝમબર્ગ 4. સ્વિટઝરલેન્ડ",
      options: [
        "ફકત 1, 2 અને 4",
        "ફકત 2, 3 અને 4",
        "ફકત 1, 2 અને 3",
        "આપેલ તમામ"
      ],
      correctAnswer: 2,
      explanation: "",
      },
    {
      id: 28,
      question: "‘અફીણ વિગ્રહો’ તરીકે જાણીતા યુદ્ધો કયા રાષ્ટ્રો વચ્ચે થયા હતા?",
      options: [
        "ઈંગ્લેન્ડ અને જાપાન",
        "ઈંગ્લેન્ડ અને ચીન",
        "બેલ્જિયમ અને નેધરલેન્ડ",
        "બેલ્જિયમ અને ગ્રીસ"
      ],
      correctAnswer: 1,
      explanation: "",
      },
    {
      id: 29,
      question: "આફ્રિકામાં સંસ્થાનવાદ બાબતે નીચેના વિધાનો પૈકી સાચા વિધાન જણાવો.\n1. ઈંગ્લેન્ડે ઈજિપ્ત, પૂર્વ આફ્રિકાના કેટલાક વિસ્તારો તેમજ દક્ષિણ આફ્રિકાના દેશો, પ્રદેશોમાં પોતાના મથકો સ્થાપ્યાં હતા.\n2. ફ્રાન્સે ટ્યુનિસિયા, મોરાક્કો અને પશ્ચિમ આફ્રિકાના પ્રદેશોમાં પોતાનું રાજ્ય સ્થાપ્યું હતું.",
      options: [
        "ફકત 1",
        "ફકત 2",
        "બંને સાચા",
        "એકપણ નહિ"
      ],
      correctAnswer: 2,
      explanation: "",
      },
    {
      id: 30,
      question: "આધુનિક વિશ્વની એક હ્રદયદ્રાવક અને અવિસ્મરણીય ઘટના કઈ છે?",
      options: [
        "પ્રથમ વિશ્વયુદ્ધ",
        "સંસ્થાનવાદ",
        "ઔદ્યોગિક ક્રાંતિ",
        "રશિયન ક્રાંતિ"
      ],
      correctAnswer: 0,
      explanation: "",
      },
    {
      id: 31,
      question: "જોડકા જોડો.\n1. અમેરિકાના પ્રમુખ (A) વુડ્રો વિલ્સન\n2. બ્રિટિશના વડાપ્રધાન (B) લોર્ડ જયોર્જ\n3. ફ્રાન્સના વડાપ્રધાન (C) ક્લેમેન્સો\n4. મેન્શેવિકના નેતા (D) કેરેન્સ્કી",
      options: [
        "1-D, 2-C, 3-B, 4-A",
        "1-A, 2-B, 3-C, 4-D",
        "1-D, 2-C, 3-A, 4-B",
        "1-A, 2-B, 3-D, 4-C"
      ],
      correctAnswer: 1,
      explanation: "",
      },
    {
      id: 32,
      question: "આફ્રિકામાં સંસ્થાનવાદ બાબતે પ્રાદેશિક વિસ્તારો મેળવવાની સ્પર્ધા વચ્ચે બર્લિન ખાતે યુરોપિયન રાજ્યોની પરિષદ કઈ સાલમાં મળી હતી?",
      options: [
        "1885-99",
        "1884-85",
        "1892-95",
        "1839 -42"
      ],
      correctAnswer: 1,
      explanation: "",
      },
    {
      id: 33,
      question: "પ્રથમ વિશ્વયુદ્ધ બાબતે નીચેના વિધાનો ધ્યાને લો.\n1. પ્રથમ વિશ્વયુદ્ધનો પ્રારંભ 1 જાન્યુઆરી 1914ના રોજ થયો હતો.\n2. જર્મનીએ સેડાનની લડાઈમાં ફ્રાંસને પરાજય આપ્યો તેથી ફ્રાંસને ફ્રેન્ક ફર્ટની સંધિ કરવી પડી હતી.\n3. આ યુદ્ધથી આલ્સેસ અને લોરેન્સ પ્રદેશો જર્મનીને આપવા પડ્યા હતા.\nઉપરોક્ત પૈકી સાચા વિધાન જણાવો.",
      options: [
        "ફકત 1 અને 3",
        "ફકત 2 અને 3",
        "ફકત 2",
        "આપેલ તમામ"
      ],
      correctAnswer: 1,
      explanation: "",
      },
    {
      id: 34,
      question: "તુર્ક મુસ્લિમોએ કોન્સ્ટેન્ટિનોપલ જીતી લીધુ તે સમયે પોર્ટુગલમા કયા રાજાનું શાસન હતું?",
      options: [
        "પ્રિન્સ જોનીફર",
        "પ્રિન્સ હેનરી",
        "પ્રિન્સ બાર્થોલોમ્યુ ડાયઝ",
        "એકપણ નહી"
      ],
      correctAnswer: 1,
      explanation: "",
      },
    {
      id: 35,
      question: "ઈસ્ટ ઈન્ડિયા કંપની વિષયમાં નીચેના વિધાનોમાંથી કયું/ કયા સાચુ/સાચા છે?\n1. ઈસ્ટ ઈન્ડિયા કંપનીની વેપારી કોઠી 1613માં સ્થપાઈ.\n2. ઈસ્ટ ઈન્ડિયા કંપનીએ મુંબઈ ખાતે વડુમથક સ્થાપ્યુ.\n3. ઈસ્ટ ઈન્ડિયા કંપનીએ સુરત, ભરૂચ, અમદાવાદમાં વેપારી મથકો સ્થાપ્યા.",
      options: [
        "માત્ર 1, 2",
        "માત્ર 2, 3",
        "માત્ર 1 , 3",
        "ઉપર આપેલ તમામ"
      ],
      correctAnswer: 3,
      explanation: "",
      },
    {
      id: 36,
      question: "જોડકાં જોડો.\n1. ફ્રેન્ચ ઈસ્ટ ઈન્ડિયા કંપની a. 1968\n2. બ્રિટિશ ઈસ્ટ ઈન્ડિયા કંપની b. 1668\n3. પ્લાસીનું યુદ્ધ c. 1773\n4. બકસરનું યુદ્ધ d. 1757",
      options: [
        "1-C, 2-b, 3-a, 4-d",
        "1-b, 2-a, 3-d, 4-c",
        "1-a, 2-c, 3-b, 4-d",
        "1-d, 2-b, 3-a, 4-c"
      ],
      correctAnswer: 1,
      explanation: "",
      },
    {
      id: 37,
      question: "નીચેનામાંથી કયા ધારા હેઠળ બંગાળના ગવર્નર ને ગવર્નર જનરલ બનાવી કંપનીના વ્યાપારી અને રાજકીય હિતો તથા પ્રવૃત્તિઓને તેના અંકુશ નીચે મૂક્યા?",
      options: [
        "ચાર્ટર એક્ટ -1793",
        "પિટ્સ ઇન્ડિયા એક્ટ-1784",
        "નિયામક ધારો -1773",
        "બંગાળનિયામક ધારો- 1818"
      ],
      correctAnswer: 2,
      explanation: "",
      },
    {
      id: 38,
      question: "નીચેનામાંથી કયુ/કયા વિધાન/વિધાનો સાચુ/સાચા છે?\n1. વોરન હેસ્ટિંગ્સ ભારતનો પ્રથમ ગવર્નર જનરલ બન્યો.\n2. ‘મૈસુરના વાઘ’ તરીકે ટીપુ સુલતાન જાણીતો હતો.\n3. ભારતનો દ્વિતીય ગવર્નર જનરલ કોર્નવોલિસ હતો.",
      options: [
        "1, 2 અને 3",
        "1 અને 2",
        "1 અને 3",
        "એકપણ નહી"
      ],
      correctAnswer: 0,
      explanation: "",
      },
    {
      id: 39,
      question: "નીચે આપેલ ભારતના ગવર્નર જનરલને યોગ્ય ક્રમમાં ગોઠવો.",
      options: [
        "કોર્નવોલિસ, જહોન શોર, વોરન હેસ્ટિંગ્સ, વેલેસ્લી",
        "વોરન હેસ્ટિંગ્સ, કોર્નવોલિસ, જહોન શોર, વેલેસ્લી",
        "વેલેસ્લી, કોર્નવોલિસ, જહોન શોર, હેસ્ટિંગ્સ",
        "કોર્નવોલિસ, જહોન શોર, વોરન હેસ્ટિંગ્સ, વેલેસ્લી"
      ],
      correctAnswer: 1,
      explanation: "",
      },
    {
      id: 40,
      question: "સહાયકારી યોજનાની શરતોમાંથી કયુ/કયા ખોટુ/ખોટા છે?\n1. કંપનીની પરવાનગી વિના રાજ્ય અન્ય રાજ્ય સાથે યુદ્ધ કે સંધિ નહિ કરી શકે.\n2. રાજ્યના તમામ દરબારમાં એક પ્રતિનિધિ અંગ્રેજ રાખવો.\n3. કંપની સરકાર તાલીમ પામેલુ સૈન્ય યોજના સ્વીકારનાર રાજ્યને આપશે.",
      options: [
        "માત્ર 1, 2",
        "માત્ર 1, 2 અને 4",
        "1, 2, 3 અને 4",
        "બધા સાચા"
      ],
      correctAnswer: 3,
      explanation: "",
      }
  ]
};
