import type { TestData } from "@/types";

export const chapter1Test: TestData = {
  chapterId: "chapter-1",
  chapterTitle: "ટેસ્ટ 1",
  totalQuestions: 40,
  questions: [
    {
      id: 1,
      question: "ભારતમાં આવનાર યુરોપિયન પ્રજા વિશે યોગ્ય ક્રમ પસંદ કરો.",
      options: [
        "વલંદા-ફિરંગી- ડેનિસ-અંગ્રેજો-ફ્રેન્ચો",
        "ફિરંગી- ડેનિસ-વલંદા- અંગ્રેજો-ફ્રેન્ચો",
        "ફિરંગી-વલંદા-ડેનિસ- અંગ્રેજો -ફ્રેન્ચો",
        "ફ્રેન્ચો-ફિર્નગી-ડચ -અંગ્રેજો-ડેનિસ"
      ],
      correctAnswer: 2,
      explanation: "",
      },
    {
      id: 2,
      question: "યુરોપમાં કઈ સાલ દરમિયાન ઈંગ્લેન્ડ અને હોલેન્ડ (ડચ) વચ્ચે મોટા યુદ્ધ થયા હતા?",
      options: [
        "1635",
        "1650",
        "1530",
        "1630"
      ],
      correctAnswer: 1,
      explanation: "",
      },
    {
      id: 3,
      question: "નીચેના વિધાન પૈકી સાચા વિધાન જણાવો.\n1. ડેનિશ પ્રજા બંગાળના સીરામપુરમાં કોઠીની સ્થાપના કરી.\n2. અંગ્રેજોએ બંગાળમાં પોતાની પ્રથમ કોઠી ઇ.સ.1651 માં સ્થાપી હતી.",
      options: [
        "ફક્ત 1",
        "ફક્ત 2",
        "બંને સાચા",
        "એકપણ નહી"
      ],
      correctAnswer: 2,
      explanation: "",
      },
    {
      id: 4,
      question: "ભારતમાં યુરોપિયન પ્રજાના આગમન બાબતે નીચેના વિધાનો પૈકી સાચા વિધાન જણાવો.\n1. અંગ્રેજોને ભારતમાં 1698માં સુલતની, કાલીઘાટ અને ગોવિંદપુરની ત્રણ ગામોની જમીનદારી મળી હતી.\n2. પોર્ટુગીઝોએ અહમદનગર, કાલિકટ અને બીજાપુરના સુલતાનોને હરાવ્યા હતા.",
      options: [
        "ફક્ત 1",
        "ફક્ત 2",
        "બંને સાચા",
        "એકપણ નહી"
      ],
      correctAnswer: 2,
      explanation: "",
      },
    {
      id: 5,
      question: "નીચેના વિધાનો પૈકી સાચા વિધાન જણાવો.\n1. ઝારખંડના હઝારીબાગ આસપાસના વિસ્તારમાં સંથાલ આદિવાસીનો સમૂહ રહેતો હતો.\n2. આદિવાસીઓ બિરસા મુંડાના નેતૃત્વમાં મુંડારાજ સ્થાપિત કરવા ઈચ્છતા હતા.\n3. કોયા ચળવળ ઈ.સ. 1879-89 દરમિયાન આંધ્રપ્રદેશના પૂર્વ ગોદાવરી વિસ્તારમાં કોયા બળવો થયો હતો.",
      options: [
        "ફક્ત 1 અને 2",
        "ફક્ત 2 અને 3",
        "આપેલ તમામ",
        "એકપણ નહી"
      ],
      correctAnswer: 2,
      explanation: "",
      },
    {
      id: 6,
      question: "ઈ.સ 1820માં કયા બે પ્રાંતોમાં રૈયતવારી પદ્ધતિ લાગુ કરવામાં આવી હતી?",
      options: [
        "કોલકતા અને મુંબઈમાં",
        "મુંબઈ અને મદ્રાસમાં",
        "દિલ્હી અને કલકત્તામાં",
        "કલકત્તા અને મદ્રાસમાં"
      ],
      correctAnswer: 1,
      explanation: "",
      },
    {
      id: 7,
      question: "નીચેના જોડકા જોડો.\nઅ\n1. શાહઆલમ બીજો\n2. લોર્ડ કોર્નવોલિસ\n3. થોમસ મુનરો\n4. હોલ્ટ મેકેન્ઝી\nબ\n(A) મહાલવારી પદ્ધતિ\n(B) રૈયતવારી પદ્ધતિ\n(C) કાયમી જમાબંધી\n(D) મુઘલ બાદશાહ",
      options: [
        "1-D, 2-C, 3-A, 4-B",
        "1-D, 2-A, 3-C, 4-B",
        "1-D, 2-A, 3-B, 4-C",
        "1-D, 2-C, 3-B, 4-A"
      ],
      correctAnswer: 3,
      explanation: "",
      },
    {
      id: 8,
      question: "મહાલવારી પદ્ધતિ બાબતે નીચેના વિધાનો પૈકી ખોટા વિધાન જણાવો.\n1. મહાલવારી પદ્ધતિનો અમલ ઉત્તર-પશ્ચિમ પ્રાંત અને મધ્યભારતના કેટલાક પ્રદેશમાં થયો હતો.\n2. આ પદ્ધતિ ઈ.સ. 1793માં દાખલ કરવામાં આવી હતી.\n3. જમીન મહેસૂલ વસૂલ કરવાની જવાબદારી ગામના રાજાને સોંપવામાં આવતી હતી.",
      options: [
        "ફક્ત 1 અને 2",
        "ફક્ત 2 અને 3",
        "ફક્ત 1 અને 3",
        "આપેલ તમામ"
      ],
      correctAnswer: 1,
      explanation: "",
      },
    {
      id: 9,
      question: "1857ના સંગ્રામ બાબતે નીચેના વિધાનો પૈકી સાચા વિધાન જણાવો.\n1. 1857ના પ્લાસીના યુદ્ધથી અંગ્રેજોએ ભારતમાં શાસન સ્થાપવાની શરૂઆત કરી હતી.\n2. બ્રિટિશરોએ કપાસ, ગળી, રેશમ વગેરે ફરજિયાત ઉત્પાદન કરે તેવી નીતિ અપનાવી હતી.\n3. બ્રિટિશરો ભારતીયોને ગંદા રોગિષ્ઠ અને નિમ્નકોટિના છે. તેવું માનતા હતા.",
      options: [
        "ફક્ત 1",
        "ફક્ત 2 અને 3",
        "ફક્ત 3",
        "આપેલ તમામ"
      ],
      correctAnswer: 3,
      explanation: "",
      },
    {
      id: 10,
      question: "1857ના સંગ્રામના કારણો વિશે નીચેના વિધાનો પૈકી સાચા વિધાન જણાવો.\n1. સેનામાં જૂની બ્રાઉન બેઝ રાઈફલની જગ્યાએ નવી એનફિલ્ડ રાઈફલનો ઉપયોગ\n2. ફરજીયાત ધર્મ પરીવર્તન કરવા માટે બ્રિટિશરો દ્વારા જુલમ\n3. મસ્જિદો અને મિલકતો પર નાખેલ કરવેરા\n4. ન્યાયતંત્ર ખર્ચાળ અને પોલીસ તંત્ર નિષ્ક્રિય",
      options: [
        "ફક્ત 1, 2 અને 4",
        "1, 2, 3 અને 4",
        "ફક્ત 2, 3 અને 4",
        "ફક્ત 2 અને 4"
      ],
      correctAnswer: 1,
      explanation: "",
      },
    {
      id: 11,
      question: "નીચેના વિધાનો પૈકી સાચા વિધાન જણાવો.\n1. બકસરના યુદ્ધથી ભારતમાં દ્વિમુખી શાસન પદ્ધતિ અમલમાં આવી હતી.\n2. ખાલસાનીતિથી અનેક રાજ્યોને બ્રિટિશ સામ્રાજ્યમાં ભેળવી દેનાર અંગ્રેજ વેલેસ્લી હતાં.",
      options: [
        "ફક્ત 1",
        "ફક્ત 2",
        "બંને",
        "એકપણ નહી"
      ],
      correctAnswer: 0,
      explanation: "",
      },
    {
      id: 12,
      question: "1857ના સંગ્રામના સ્થળો બાબતે નીચેના વિધાનો પૈકી સાચા વિધાન જણાવો.\n1. લખનૌના સંગ્રામનું નેતૃત્વ બેગમ હજરત મહલે લીધું હતું.\n2. ઝાંસીકી રાણી લક્ષ્મીબાઈએ કાલપી અને ગ્વાલિયર જેવા સ્થળોએ અંગ્રેજો સામે યુદ્ધ કર્યુ હતું.\n3. બરેલીના બહાદુરખાન મુખ્ય નેતા હતા.",
      options: [
        "ફક્ત 1 અને 2",
        "ફક્ત 2 અને 3",
        "ફક્ત 1",
        "આપેલ તમામ"
      ],
      correctAnswer: 3,
      explanation: "",
      },
    {
      id: 13,
      question: "અંગ્રેજ શાસન સમયના શહેરો બાબતે નીચેના વિધાન ધ્યાને લો.\n1. અંગ્રેજ સમયમાં જુના શહેરોમાં પરિવર્તન અને વિકાસ થયો હતો.\n2. આજનું મુંબઈ એક સમયનો ટાપુ હતો.\n3. અંગ્રેજ શાસન વખતે પોર્ટુગીઝોએ મુંબઈ ટાપુ દહેજમાં આપ્યો હતો.\nઉપરોક્ત પૈકી ખોટા વિધાન જણાવો.",
      options: [
        "ફક્ત 1",
        "ફક્ત 2",
        "ફક્ત 3",
        "એકપણ નહી"
      ],
      correctAnswer: 3,
      explanation: "",
      },
    {
      id: 14,
      question: "અંગ્રેજ સમયના શહેરો બાબતે નીચેના વિધાનો ધ્યાને લો.\n1. અંગ્રેજ શાસન દરમિયાન સુરતમાં જરીકામ થતું હતું.\n2. અંગ્રેજોએ ભારતના સુરતમાં કોઠી અઢારમી સદી દરમિયાન કોઠી સ્થાપી હતી.\n3. ઈ.સ. 1640માં અંગ્રેજોએ ફોર્ટ સેન્ટ જ્યોર્જની સ્થાપના મદ્રાસ ખાતે કરી હતી.\nઉપરોક્ત પૈકી સાચા વિધાન જણાવો.",
      options: [
        "ફક્ત 1 અને 3",
        "ફક્ત 2 અને 3",
        "ફક્ત 3",
        "આપેલ તમામ"
      ],
      correctAnswer: 3,
      explanation: "",
      },
    {
      id: 15,
      question: "કેટલાક અંગ્રેજ સુધારાવાદીઓ કોને આધુનિક ભારતનો નિર્માતા કહે છે?",
      options: [
        "લોર્ડ વેલેસ્લીને",
        "લોર્ડ વિલિયમ બેન્ટિંકને",
        "લોર્ડ ડેલહાઉસીને",
        "લોર્ડ વોરન હેસ્ટિંગ્સને"
      ],
      correctAnswer: 2,
      explanation: "",
      },
    {
      id: 16,
      question: "અંગ્રેજોએ ભારતના પૂર્વકિનારે કયા સ્થળે કોઠીની સ્થાપના કરી હતી.",
      options: [
        "મછલીપટ્ટનમમાં",
        "પુડુંચેરીમાં",
        "વિશાખાપટ્ટનમમાં",
        "ચેન્નાઈમાં"
      ],
      correctAnswer: 0,
      explanation: "",
      },
    {
      id: 17,
      question: "ભારતમાં અંગ્રેજ શાશન સમયની શિક્ષણ અને સમાજ વ્યવસ્થા બાબતે નીચેના વિધાનો ધ્યાને લો.\n1. અંગ્રેજ શાશન દરમિયાન શિક્ષણ આપતી સંસ્થાઓ ગામઠી શાળાઓ પાંડ્યની શાળાઓ અને ધૂળીયા નિશાળો તરીકે ઓળખાતી હતી.\n2. એ સમયે ઔપચારિક શિક્ષણની વ્યવસ્થા ન હતી.\n3. ગામના જાહેર સ્થળો, વડ કે અન્ય વૃક્ષના છાયડામાં શાળાઓ બેસાડવામાં આવતી હતી.\nઉપરોક્ત પૈકી સાચા વિધાનો જણાવો.",
      options: [
        "ફક્ત 1 અને 3 સાચા",
        "ફક્ત 2 અને 3 સાચા",
        "ફક્ત 3 સાચું",
        "આપેલ તમામ સાચા"
      ],
      correctAnswer: 3,
      explanation: "",
      },
    {
      id: 18,
      question: "ભારતમાં પ્રારંભિક વ્યવસ્થા બાબતે નીચેના વિધાનો ધ્યાને લો.\n1. ભારતમાં સૌપ્રથમ શિક્ષણ સંસ્થાની સ્થાપના વિલિયમ કેરે કોલકતા પાસે આવેલ સિરામપુરમાં ઇ.સ. 1789માં કરી હતી.\n2. માર્શમેન અને તેમનાં પત્નીએ કન્યા શાળાની સ્થાપના કરી હતી.\nઉપરોક્ત પૈકી સાચા વિધાનો જણાવો.",
      options: [
        "ફક્ત 1 સાચું",
        "ફક્ત 2 સાચું",
        "બંને સાચા",
        "બંને ખોટા"
      ],
      correctAnswer: 2,
      explanation: "",
      },
    {
      id: 19,
      question: "ભારતમાં શિક્ષણ થયેલા સુધારા બાબતે નીચેના વિધાનો ધ્યાને લો.\n1. ઈ.સ. 1951ની ગણતરી પ્રમાણે શિક્ષણ નો દર 16.6% હતો.\n2. ભારતના દેશી રજવાડામાં શિક્ષણ નો દર ઓછો હતો.\n3. ભારતનાં દેશી રજવાડામાં વડોદરામાં 28% ત્રાવણકોરમાં 47.8% જેવા શિક્ષિત રજવાડા હતા.\nઉપરોક્ત પૈકી ખોટા વિધાનો જણાવો.",
      options: [
        "ફક્ત 1 અને 3",
        "ફક્ત 2",
        "ફક્ત 3",
        "આપેલ તમામ"
      ],
      correctAnswer: 1,
      explanation: "",
      },
    {
      id: 20,
      question: "નીચેના વિધાનો ધ્યાને લો.\n1. બોમ્બે એસોસિયેશનની સ્થાપના દિલ્હીમાં થઈ હતી.\n2. બંગાળના ભાગલા પાડનાર વાઈસરોય લોર્ડ રીપન હતો.\n3. બ્રિટિશ સરકારે બંગાળના ભાગલા રદ 1908માં કર્યા હતા.\nઉપરોક્ત પૈકી સાચા વિધાન જણાવો.",
      options: [
        "ફક્ત 1 અને 2",
        "ફક્ત 2 અને 3",
        "ફક્ત 1 અને 3",
        "એકપણ નહી"
      ],
      correctAnswer: 3,
      explanation: "",
      },
    {
      id: 21,
      question: "વિદેશોમાં ક્રાંતિકારી પ્રવૃત્તિઓ બાબતે નીચેના વિધાનો ધ્યાને લો.\n1. કચ્છના વતની શ્યામજીકૃષ્ણ વર્માએ જાપાનમાં ઇન્ડિયન હોમરૂલ સોસાયટીની સ્થાપના કરી હતી.\n2. મદનલાલ ઢીંગરાને ઈ.સ. 1909માં વિલિયમ વાયલીને ગોળી મારી હત્યા કરતા તેને ફાંસી આપવામાં આવી હતી.\n3. મેડમ ભીખાઇજી રુસ્તમ કામાએ ઈ.સ. 1902માં યુરોપમાં 'વંદેમાતરમ' વર્તમાનપત્ર શરૂ કર્યુ હતું.\nઉપરોક્ત પૈકી સાચા વિધાન જણાવો.",
      options: [
        "ફક્ત 1 અને 2",
        "ફક્ત 2 અને 3",
        "ફક્ત 3",
        "આપેલ તમામ"
      ],
      correctAnswer: 1,
      explanation: "",
      },
    {
      id: 22,
      question: "ભારતમાં થયેલા મહત્વનાં આંદોલન બાબતે નીચેના વિધાનો ધ્યાને લો.\n1. માનગઢ હત્યાકાંડ નવેમ્બર 1913ના રોજ ગુજરાત રાજસ્થાન સરહદ પર માનગઢ ડુંગર પર સર્જાયો હતો.\n2. ન્યારા આદિવાસી આંદોલન ઈ.સ. 1914 તાપી જિલ્લામાં થયેલ.\n3. દ્રઢવાવ આદિવાસી આંદોલન ઈ.સ. 1922 વિજયનગર તાલુકામાં થયું હતું.\nઉપરોક્ત પૈકી ખોટા વિધાન જણાવો.",
      options: [
        "ફક્ત 1",
        "ફક્ત 2",
        "ફક્ત 3",
        "એકપણ નહી"
      ],
      correctAnswer: 3,
      explanation: "",
      },
    {
      id: 23,
      question: "નીચેના વિધાનો ધ્યાને લો.\n1. ગાંધીજી ચંપારણના ખેડુત રાજકુમાર શુકલના આગ્રહથી મોતીહારી આવ્યા હતા.\n2. ખેડા સત્યાગ્રહ ઈ.સ. 1917માં અતિવૃષ્ટિના કારણે પાક નિષ્ફળ જવાથી થયો હતો.\n3. ગાંધીએ બારડોલી સત્યાગ્રહ દરમિયાન મોહનલાલ પંડ્યાને 'ડુંગળી ચોર'નું બિરુદ આપ્યું હતું.\nઉપરોક્ત પૈકી સાચા વિધાન જણાવો.",
      options: [
        "ફક્ત 1 અને 2",
        "ફક્ત 2 અને 3",
        "ફક્ત 3",
        "આપેલ તમામ"
      ],
      correctAnswer: 0,
      explanation: "",
      },
    {
      id: 24,
      question: "કોની અધ્યક્ષતામાં મળેલા કોંગ્રેસના અધિવેશનમાં પૂર્ણ સ્વરાજનો ઠરાવ પસાર કરવામાં આવ્યો હતો?",
      options: [
        "વલ્લભભાઈ પટેલનો",
        "સુભાષચંદ્ર બોઝની",
        "ગાંધીજીની",
        "જવાહરલાલ નહેરુની"
      ],
      correctAnswer: 3,
      explanation: "",
      },
    {
      id: 25,
      question: "'હિંદ છોડો' આંદોલન બાબતે નીચેના વિધાનો ધ્યાને લો.\n1. ઈ.સ. 1942માં બ્રિટિશ સરકારે હિંદને મનાવી લેવા ક્રિપ્સ મિશન મોકલ્યું હતું.\n2. 8મી ઓગસ્ટ 1942માં મુંબઈમાં મળેલી કોંગ્રેસની મહાસમિતિની બેઠકમાં અંગ્રેજોએ હિન્દને છોડી દેવા ઐતિહાસિક હિંદ છોડોનો ઠરાવ પસાર કરવામાં આવ્યો હતો.\nઉપરોક્ત પૈકી સાચા વિધાન જણાવો.",
      options: [
        "ફક્ત 1",
        "ફક્ત 2",
        "બંને સાચા",
        "બંને ખોટા"
      ],
      correctAnswer: 2,
      explanation: "",
      },
    {
      id: 26,
      question: "ચિત્રકલા બાબતે મળતા પુરાવા બાબતે નીચેના વિધાનો ધ્યાને લો.\n1. મધ્યપ્રદેશની ભીમબેટકાની ગુફામાં ભીંતચિત્રો જોવા મળતા હતા.\n2. તક્ષશિલા અને નાલંદા જેવી વિશ્વવિદ્યાલયોમાં કલાનું શિક્ષણ આપવામાં આવતું હતું.\n3. દ્રશ્ય કલામાં ચિત્ર શિલ્પ અને હસ્તકલાનો સમાવેશ થાય છે.\n4. પ્રદર્શિત કલામાં સંગીત નૃત્ય, વાદ્ય અને નાટ્યકલાનો સમાવેશ થાય છે.\nઉપરોક્ત પૈકી સાચા વિધાન જણાવો.",
      options: [
        "ફક્ત 1, 3 અને 4",
        "ફક્ત 2, 3 અને 4",
        "ફક્ત 1, 3 અને 4",
        "આપેલ તમામ"
      ],
      correctAnswer: 3,
      explanation: "",
      },
    {
      id: 27,
      question: "મુઘલ વંશના કયા રાજાઓ એ ચિત્રકલા ક્ષેત્રે ખૂબ જ પ્રોત્સાહન આપ્યું હતું?\n1. બાબર\n2. જહાંગીર\n3. હુમાયુ\n4. અકબર\n5. ઔરંગઝેબ\n6. શાહજહાં\nઉપરોક્ત પૈકી રાજવીઓ ધ્યાને લઈ યોગ્ય જવાબ આપો.",
      options: [
        "ફક્ત 1, 3, 5 અને 6",
        "ફક્ત 1, 2, 3 અને 4",
        "ફક્ત 1, 2, 3, 5 અને 6",
        "1, 2, 3, 4, 5 અને 6"
      ],
      correctAnswer: 1,
      explanation: "",
      },
    {
      id: 28,
      question: "ભારતની વિભિન્ન ચિત્રશૈલીઓ બાબતે નીચેના વિધાનો ધ્યાને લો.\n(1) ફાડ ચિત્ર શૈલી - રાજસ્થાન\n(2) વારલી ચિત્રકલા - મહારાષ્ટ્ર\n(3) પીઠોરા ચિત્રકલા - ગુજરાત\n(4) કાલીઘાટ ચિત્રકલા - બંગાળ\nઉપરોક્ત પૈકી સાચા વિધાન જણાવો.",
      options: [
        "ફક્ત 1, 2 અને 4",
        "ફક્ત 3 અને 4",
        "ફક્ત 2, 3 અને 4",
        "1, 2, 3 અને 4"
      ],
      correctAnswer: 3,
      explanation: "",
      },
    {
      id: 29,
      question: "ફ્રાન્સે વસાહતો ભારત સરકારને સુપ્રત કરી ભારતમાંથી ક્યારે વિદાય લીધી?",
      options: [
        "13 માર્ચ 1953ના રોજ",
        "13 ઓક્ટોબર 1954ના રોજ",
        "28 ઓગસ્ટ 1955ના રોજ",
        "30 ડિસેમ્બર 1954ના રોજ"
      ],
      correctAnswer: 1,
      explanation: "",
      },
    {
      id: 30,
      question: "ભારતના દેશી રાજ્યોના વિલિનીકરણ બાબતે નીચેના સ્થળ જણાવો.\n1. ભારતની સ્વતંત્રતા વખતે ભારતના ગૃહપ્રધાન સરદાર વલ્લભભાઈ પટેલ હતા.\n2. સરદાર પટેલ અને વી.પી.મેનનના પ્રયત્નોથી હૈદરાબાદ, જૂનાગઢ અને કાશ્મીર સિવાય બધાજ રાજ્યોનું વિલિનિકરણ કરવામાં આવ્યું હતું.\nઉપરોક્ત પૈકી સાચા વિધાન જણાવો.",
      options: [
        "ફક્ત 1",
        "ફક્ત 2",
        "બંને સાચા",
        "બંને ખોટા"
      ],
      correctAnswer: 2,
      explanation: "",
      },
    {
      id: 31,
      question: "વાતાવરણમાં રહેલા ઓક્સિજન અને નાઈટ્રોજન જેવા વાયુઓ કયા પ્રકારનું સંસાધન છે?",
      options: [
        "સામાન્ય સુલભ",
        "એકલ",
        "વિરલ",
        "સર્વ સુલભ"
      ],
      correctAnswer: 3,
      explanation: "",
      },
    {
      id: 32,
      question: "સંસાધન બાબતે નીચેના વિધાનો ધ્યાને લો.\n1. ક્રાયોલાઈટ નામનું ખનિજ યુરોપના ગ્રીનલેન્ડમાંથી મળતું એકલ સંસાધન છે.\n2. યુરેનિયમ અને કોલસો કુદરતમાંથી મળતાં વિરલ સંસાધન છે.\nઉપરોક્ત પૈકી સાચા વિધાન જણાવો.",
      options: [
        "ફક્ત 1",
        "ફક્ત 2",
        "બંને સાચા",
        "એકપણ નહી"
      ],
      correctAnswer: 2,
      explanation: "",
      },
    {
      id: 33,
      question: "નીચેના પૈકી કયાં/કયું સંસાધન એકલ સંસાધન નથી?\n1. યૂરેનિયમ\n2. ક્રાયોલાઈટ\n3. ઓક્સિજન\n4. નાઈટ્રોજન\nઉપરોક્ત પૈકી સાચા વિધાન પસંદ કરો.",
      options: [
        "ફક્ત 1, 3 અને 4",
        "ફક્ત 1, 2 અને 3",
        "ફક્ત 1, 3 અને 4",
        "1, 2, 3 અને 4"
      ],
      correctAnswer: 0,
      explanation: "",
      },
    {
      id: 34,
      question: "ખનીજોના વર્ગીકરણ બાબતે નીચેના વિધાનો ધ્યાને લો.\n1. ખનીજો ઉષ્મા અને વિદ્યુતના વાહક હોય છે.\n2. પ્રહાર કરવાથી તે ટુકડાઓમાં વહેંચાય છે.\n3. ધાતુમય ખનીજોમાં ચમક અને તેજની વિશેષતા હોતી છે.\nઉપરોક્ત પૈકી સાચા વિધાન જણાવો.",
      options: [
        "ફક્ત 1 અને 2",
        "ફક્ત 1 અને 3",
        "ફક્ત 2 અને 3",
        "આપેલ તમામ"
      ],
      correctAnswer: 1,
      explanation: "",
      },
    {
      id: 35,
      question: "નીચેના વિધાનો ધ્યાને લો.\n1. જૈવિક અને અજૈવિક પદાર્થો ગરમી અને દબાણને લીધે પરિવર્તન પામીને ચોક્કસ ચોક્કસ રાસાયણિક બંધારણ ધારણ કરે તેને ખનિજ કહે છે.\n2. ખનીજ તેલ પ્રસ્તર ખડકમાંથી મેળવવામાં આવે છે.\nઉપરોક્ત પૈકી સાચા વિધાન જણાવો.",
      options: [
        "ફક્ત 1",
        "ફક્ત 2",
        "બંને સાચા",
        "બંને ખોટા"
      ],
      correctAnswer: 2,
      explanation: "",
      },
    {
      id: 36,
      question: "ખનીજોની ઉપયોગિતા બાબતે નીચેના વિધાનો ધ્યાને લો.\n1. કમ્પ્યૂટરમાં વપરાતું સિલિકોન ક્વાર્ટ્ઝમાંથી લેવામાં આવે છે.\n2. સીસાનો ઉપયોગ સ્ટોરેજ બેટરી અને ઝીંક ઓક્સાઈડની બનાવટમાં થાય છે.\n3. ચિનાઈમાટીની વસ્તુની બનાવટમાં ફ્લોરસ્પારનો ઉપયોગ કરવામાં આવે છે.\nઉપરોક્ત પૈકી સાચા વિધાન જણાવો.",
      options: [
        "ફક્ત 1 અને 3",
        "ફક્ત 2 અને 3",
        "ફક્ત 3",
        "આપેલ તમામ"
      ],
      correctAnswer: 3,
      explanation: "",
      },
    {
      id: 37,
      question: "વિશ્વની કુલ વસ્તીના લગભગ ¾ લોકો કયા ખંડોમાં વસવાટ કરે છે?",
      options: [
        "એશિયા અને યુરોપ",
        "એશિયા અને આફ્રિકા",
        "એશિયા અને ઉત્તર અમેરિકા",
        "યુરોપ અને ઓસ્ટ્રેલિયા"
      ],
      correctAnswer: 1,
      explanation: "",
      },
    {
      id: 38,
      question: "સૌપ્રથમ કયા પ્રાંતના સિપાઈઓએ એન્ફિલ્ડ રાઈફલના કારતૂસો વાપરવાનો ઈન્કાર કર્યો હતો?",
      options: [
        "મુંબઈના",
        "બંગાળના",
        "ચેન્નાઈના",
        "દિલ્હીના"
      ],
      correctAnswer: 1,
      explanation: "",
      },
    {
      id: 39,
      question: "1857 ના સંગ્રામ બાબતે નીચેના વિધાનો ધ્યાને લો.\n(1) અંગ્રેજ શાસનમાં ન્યાયતંત્ર અત્યંત ખર્ચાળ હતું.\n(2) અંગ્રેજો ભારતીય સૈનિકો સાથે કોઈ સામાજિક વ્યવહાર કરતા નહિ.\n(3) ચરબીવાળા કારતૂસ એ 1857 ના સંગ્રામનું તાત્કાલિક કારણ હતું.\n(4) ઈ.સ. 1857 માં અંગ્રેજ સરકારે સૈનિકો માટે નવી “એન્ફિલ્ડ રાઈફલ” નો ઉપયોગ કર્યો હતો.\nઉપરોક્ત પૈકી સાચા વિધાન જણાવો",
      options: [
        "ફક્ત 1 અને 3",
        "ફક્ત 2, 3 અને 4",
        "ફક્ત 1, 2 અને 4",
        "1, 2, 3, 4"
      ],
      correctAnswer: 3,
      explanation: "",
      },
    {
      id: 40,
      question: "હોલ્ટ મેકેન્ઝીએ મહાલવારીમાં જમીન મહેસૂલ પદ્ધતિ ક્યારે અમલમાં મૂકી હતી?",
      options: [
        "ઈ. સ. 1818માં",
        "ઈ.સ. 1824માં",
        "ઈ.સ. 1822માં",
        "ઈ.સ. 1839માં"
      ],
      correctAnswer: 2,
      explanation: "",
      }
  ]
};
