import type { TestData } from "@/types";

export const chapter11Test: TestData = {
  chapterId: "chapter-11",
  chapterTitle: "ટેસ્ટ 11",
  totalQuestions: 40,
  questions: [
    {
      id: 1,
      question: "યોગ્ય જોડકાં જોડો.\nઅ\n1. રાષ્ટ્રીય સંગ્રહાલય\n2. ભારતીય સંગ્રહાલય\n3. પ્રિન્સ ઑફ વેલ્સ મ્યુઝિયમ\n4. સાલારગંજ સંગ્રહાલય\nબ\na. કોલકાતા\nb. હૈદરાબાદ\nc. મુંબઈ\nd. નવી દિલ્લી",
      options: [
        "(1 - d), (2 - a), (3 - c), (4 - b)",
        "(1 - a), (2 - d), (3 - c), (4 - b)",
        "(1 - b), (2 - a), (3 - c), (4 - d)",
        "(1 - d), (2 - c), (3 - b), (4 - b)"
      ],
      correctAnswer: 0,
      explanation: "",
    },
    {
      id: 2,
      question: "યોગ્ય જોડકાં જોડો.\nઅ\n1. રાષ્ટ્રીય માનવ સંગ્રહાલય\n2. લાલભાઈ દલપતભાઈ સંગ્રહાલય\n3. શ્રી મહાવીર જૈન આરાધના કેન્દ્ર\n4. શ્રી. હેમચંદ્રાચાર્ય ગ્રંથાલય\nબ\na. ગાંધીનગર\nb. પાટણ\nc. ભોપાલ\nd. અમદાવાદ",
      options: [
        "(1 - c), (2 - d), (3 - a), (4 - b)",
        "(1 - d), (2 - c), (3 - a), (4 - b)",
        "(1 - c), (2 - a), (3 - d), (4 - b)",
        "(1 - c), (2 - d), (3 - b), (1 - a)"
      ],
      correctAnswer: 0,
      explanation: "",
    },
    {
      id: 3,
      question: "યોગ્ય જોડકાં જોડો.\nઅ\n1. ધોળકા\n2. પાટણ\n3. મહેમદાવાદ\n4. જૂનાગઢ\nબ\na. ભમરીયો કૂવો\nb. મલાવ તળાવ\nc. નવઘણ કૂવો\nd. રાણીની વાવ",
      options: [
        "(1 - b), (2 - d), (3 - a), (4 - c)",
        "(1 - d), (2 - b), (3 - a), (4 - c)",
        "(1 - b), (2 - a), (3 - b), (4 - c)",
        "(1 - b), (2 - c), (3 - a), (4 - d)"
      ],
      correctAnswer: 0,
      explanation: "",
    },
    {
      id: 4,
      question: "વૈશ્વિક વારસાનાં સ્થળોની યાદી કોણ તૈયાર કરે છે?",
      options: [
        "યુનેસ્કો",
        "યુનિસેફ",
        "સંયુક્ત રાષ્ટ્રોની સામાન્ય સભા",
        "સંયુક્ત રાષ્ટ્રોની સલામતી સમિતિ"
      ],
      correctAnswer: 0,
      explanation: "",
    },
    {
      id: 5,
      question: "ઈ. સ. 1883માં કઈ સંસ્થાની સ્થાપના થઈ હતી?",
      options: [
        "પશુ-પક્ષી અને પ્રાણીઓના સંરક્ષણની સમિતિની",
        "મુંબઈ પ્રાકૃતિક ઇતિહાસ સમિતિની",
        "સંગ્રહાલય સંરક્ષણ અને વિકાસ સમિતિની",
        "વનવિકાસ અને પર્યાવરણ જતન સમિતિની"
      ],
      correctAnswer: 1,
      explanation: "",
    },
    {
      id: 6,
      question: "ભારત સરકારે રાષ્ટ્રીય સ્મારકોની જાળવણીનું કામ કોને સોંપ્યું છે?",
      options: [
        "પ્રવાસ અને પર્યટન ખાતાને",
        "પર્યાવરણ ખાતાને",
        "પુરાતત્ત્વ ખાતાને",
        "શિક્ષણ ખાતાને"
      ],
      correctAnswer: 2,
      explanation: "",
    },
    {
      id: 7,
      question: "સંગમેશ્વરનું મંદિર અને પાપનાશમ્ મંદિરસમૂહ જળમાં ડૂબતા જાય તેમ હતાં, તેથી તેમને કયાં સ્થળાંતરિત કરવામાં આવ્યા છે?",
      options: [
        "આલમપુર",
        "કાઝીકોટા",
        "આઝાદપુર",
        "હૈદરાબાદ"
      ],
      correctAnswer: 0,
      explanation: "",
    },
    {
      id: 8,
      question: "ભારતીય નિધિ વ્યાપાર કાનૂન ક્યારે અમલમાં આવ્યો?",
      options: [
        "ઈ. સ. 1880માં",
        "ઈ.સ. 1888 માં",
        "ઈ. સ. 1876માં",
        "ઈ. સ. 1952માં"
      ],
      correctAnswer: 2,
      explanation: "",
    },
    {
      id: 9,
      question: "સંસ્કૃત, અર્ધમાગધી, પ્રાકૃત, પાલી વગેરે હસ્તપ્રતોની જાળવણી ક્યાં થાય છે?",
      options: [
        "સંગ્રહાલયોમાં",
        "સરકારી સંસ્થાઓમાં",
        "પુસ્તકાલયોમાં",
        "બિનસરકારી સંસ્થાઓમાં"
      ],
      correctAnswer: 0,
      explanation: "",
    },
    {
      id: 10,
      question: "હૈદરાબાદમાં કયું સંગ્રહાલય આવેલું છે?",
      options: [
        "સુલતાનગંજ સંગ્રાલય",
        "સાલારગંજ સંગ્રહાલય",
        "આબાદગંજ સંગ્રહાલય",
        "નિઝામ સંગ્રહાલય"
      ],
      correctAnswer: 1,
      explanation: "",
    },
    {
      id: 11,
      question: "શિકાગો શહેરમાં મળેલી 'વિશ્વધર્મ પરિષદ'માં કોણે વક્તવ્ય આપ્યું હતું?",
      options: [
        "સ્વામી રામકૃષ્ણ પરમહંસે",
        "સ્વામી દયાનંદ સરસ્વતીએ",
        "રાજા રામમોહનરાયે",
        "સ્વામી વિવેકાનંદ"
      ],
      correctAnswer: 3,
      explanation: "",
    },
    {
      id: 12,
      question: "સ્વામી વિવેકાનંદના શબ્દોમાં હિન્દુ ધર્મે જગતને ક્યા પાઠો શીખવ્યા છે?",
      options: [
        "સંસ્કૃતિ અને સભ્યતાના",
        "સહિષ્ણુતા અને વિશ્વબંધુત્વના",
        "સહિષ્ણુતા અને સાંપ્રદાયિકતાના",
        "એકતા અને વિષમતાના"
      ],
      correctAnswer: 1,
      explanation: "",
    },
    {
      id: 13,
      question: "પ્રાચીન ભારતના જ્યોતિર્ધરોએ આપણા દેશને કયું નામ આપ્યું હતું?",
      options: [
        "આર્યાવર્ત",
        "રામરાજ્ય",
        "ભરતખંડ",
        "ભારતવર્ષ"
      ],
      correctAnswer: 3,
      explanation: "",
    },
    {
      id: 14,
      question: "નીચેનામાંથી કયું જોડકું ખોટું છે તે જણાવો.",
      options: [
        "ભારતીય સંગ્રહાલય – નવી દિલ્લી",
        "પ્રિન્સ ઓફ વેલ્સ મ્યુઝિયમ – મુંબઈ",
        "સાલારગંજ સંગ્રહાલય – હૈદરાબાદ",
        "રાષ્ટ્રીય માનવ સંગ્રહાલય – ભોપાલ"
      ],
      correctAnswer: 0,
      explanation: "",
    },
    {
      id: 15,
      question: "કુદરતી સંસાધનો બાબતે નીચેના વિધાનો ધ્યાને લો.\n1) કુદરત, માનવ અને સંસ્કૃતિ પરસ્પર પ્રક્રિયા દ્વારા જ સંસાધન બને છે.\n2) સર્વ સુલભ સંસાધનોમાં ઓક્સિજન અને નાઈટ્રોજનનો સમાવેશ થાય છે.\nઉપરોક્ત પૈકી સાચા વિધાનો જણાવો.",
      options: [
        "ફક્ત 1",
        "ફક્ત 2",
        "બંને",
        "એકપણ નહી"
      ],
      correctAnswer: 2,
      explanation: "",
    },
    {
      id: 16,
      question: "સંસાધનની વિતરણ બાબતે નીચેના વિધાનો ધ્યાને લો.\n1) સર્વસુલભ સંસાધન - ઓક્સિજન અને નાઈટ્રોજન\n2) સામાન્ય સુલભ સંસાધન - ભૂમિ, જમીન, જળ, ગોચર\n3) વિરલ સંસાધન - કોલસો, પેટ્રોલિયમ\nઉપરોક્ત પૈકી સાચા વિધાન જણાવો.",
      options: [
        "ફક્ત 1",
        "ફક્ત 2 અને 3",
        "ફક્ત 3",
        "આપેલ તમામ"
      ],
      correctAnswer: 3,
      explanation: "",
    },
    {
      id: 17,
      question: "ક્રાયોલાઈટ ખનીજ એ ગ્રેન્ડલેન્ડમાંથી મળી આવે છે તે કેવા પ્રકારના સંસાધનમાં સમાવેશ થાય છે.",
      options: [
        "સર્વસુલભ સંસાધન",
        "સામાન્ય સુલભ સંસાધન",
        "વિરલ સંસાધન",
        "એકલ સંસાધન"
      ],
      correctAnswer: 3,
      explanation: "",
    },
    {
      id: 18,
      question: "ભારતીય કૃષિ સંશોધન પરિષદ (ICAR) દ્વારા ભારતની જમીનને કેટલા ભાગમાં વહેંચવામાં આવી છે?",
      options: [
        "7 ભાગમાં",
        "8 ભાગમાં",
        "6 ભાગમાં",
        "12 ભાગમાં"
      ],
      correctAnswer: 1,
      explanation: "",
    },
    {
      id: 19,
      question: "કાંપની જમીન બાબતે નીચેના વિધાનો ધ્યાને લો.\n1. આ પ્રકારની જમીન ભારતના કુલ ક્ષેત્રફળના લગભગ 43% ક્ષેત્રફળમાં ફેલાયેલી છે.\n2. કાંપની જમીનનું નિર્માણ નદીઓ દ્વારા નિક્ષેપિત કાંપને આભારી છે.\n3. આ જમીનમાં પોટાશ, ફોસ્ફરિક એસિડ અને ચૂનાનું પ્રમાણ જોવા મળે છે.\nઉપરોક્ત પૈકી સાચા વિધાન જણાવો.",
      options: [
        "ફક્ત 1 અને 3",
        "ફક્ત 2 અને 3",
        "ફક્ત 3",
        "આપેલ તમામ"
      ],
      correctAnswer: 3,
      explanation: "",
    },
    {
      id: 20,
      question: "ભારતના કુલ ક્ષેત્રફળના લગભગ કેટલા ટકા વિસ્તારમાં રાતી અથવા લાલ જમીન જોવા મળે છે?",
      options: [
        "43%",
        "22%",
        "19%",
        "29%"
      ],
      correctAnswer: 2,
      explanation: "",
    },
    {
      id: 21,
      question: "રાતી જમીનમાં કયાં તત્વની હાજરીના કારણે તેનો રંગ લાલ બને છે અને તથા તે નીચે જતા પીળા રંગમાં ફેરવાય છે?",
      options: [
        "નાઈટ્રોજન",
        "ફેરિક ઓક્સાઈડ",
        "મેગ્નેશિયમ કાર્બોનેટ",
        "પોટાશ"
      ],
      correctAnswer: 1,
      explanation: "",
    },
    {
      id: 22,
      question: "કાળી જમીન બાબતે નીચેના વિધાનો પૈકી કયું/કયા વિધાન સાચું/સાચા છે?\n1) કાળી જમીન રેગુર જમીન ભારતના કુલ ક્ષેત્રફળના 43% ક્ષેત્રફળમાં ફેલાયેલી છે.\n2) આ પ્રકારની જમીનમાં ઉદ્ભવ દખ્ખણના પથરાવાથી થયેલ છે.\n3) આ પ્રકારની જમીનમાં લોહ, ચૂનો, કેલ્શિયમ, પોટાશ એલ્યુમિનિયમ અને મેગ્નેશિયમ કાર્બોનેટનું પ્રમાણ વધુ જોવા મળે છે.",
      options: [
        "ફક્ત 1 અને 2",
        "ફક્ત 2 અને 3",
        "ફક્ત 3",
        "આપેલ તમામ"
      ],
      correctAnswer: 1,
      explanation: "",
    },
    {
      id: 23,
      question: "લેટેરાઈટ જમીન બાબતે નીચેના વિધાનો પૈકી કયું/કયાં વિધાન સાચું/સાચા છે?\n1) આ જમીનને પડખાઉ જમીન પણ કહેવામાં આવે છે.\n2) તેનો લાલ રંગ ફેરિક ઓક્સાઈડના કારણે હોય છે.\n3) આ જમીન ભીની થાય ત્યારે માખણ જેવી મુલાયમ અને સુકાય ત્યારે સખત બની જાય છે.\nઉપરોક્ત પૈકી સાચા વિધાન જણાવો.",
      options: [
        "ફક્ત 1 અને 3",
        "ફક્ત 2 અને 3",
        "ફક્ત 3",
        "આપેલ તમામ"
      ],
      correctAnswer: 0,
      explanation: "",
    },
    {
      id: 24,
      question: "સંસાધનો બાબતે નીચેના વિધાનો ધ્યાને લો.\n1) કાળી જમીનને રેગુરની જમીનના નામે પણ ઓળખવામાં આવે છે.\n2) પડખાઉ જમીનને લેટેરાઈટ જમીનના નામે પણ ઓળખવામાં આવે છે.\nઉપરોક્ત પૈકી સાચા વિધાનો ધ્યાને લો.",
      options: [
        "ફક્ત 1",
        "ફક્ત 2",
        "બંને",
        "એકપણ નહી"
      ],
      correctAnswer: 2,
      explanation: "",
    },
    {
      id: 25,
      question: "રણ પ્રકારની જમીન બાબતે નીચેના વિધાનમાંથી અયોગ્ય વિધાન પસંદ કરો.",
      options: [
        "આ જમીનમાં સુકી અને અર્ધસુકી આબોહવાવાળી પરિસ્થિતિમાં જોવા મળે છે.",
        "આ જમીન રેતાળ અને ફળદ્રુપ હોય છે.",
        "તેમાં દ્રાવ્ય ક્ષારોનું પ્રમાણ વધારે હોય છે",
        "આ પ્રકારની જમીન રાજસ્થાન, હરિયાણા અને દક્ષિણ પંજાબના વિસ્તારમાં જોવા મળે છે."
      ],
      correctAnswer: 1,
      explanation: "",
    },
    {
      id: 26,
      question: "નીચેનામાંથી કયા દિવસને ‘વિશ્વ પર્યાવરણ દિવસ‘ તરીકે ઉજવવામાં આવે છે.",
      options: [
        "5 ઓગસ્ટ",
        "5 સપ્ટેમ્બર",
        "5 જૂન",
        "5 માર્ચ"
      ],
      correctAnswer: 2,
      explanation: "",
    },
    {
      id: 27,
      question: "સોનું, તાંબુ અને યુરેનિયમ જેવી ખનીજો કેવા પ્રકારના સંસાધનોમાં સમાવેશ થાય છે?",
      options: [
        "સર્વસુલભ સંસાધન",
        "સામાન્ય સુલભ સંસાધન",
        "વિરલ સંસાધન",
        "એકલ સંસાધન"
      ],
      correctAnswer: 2,
      explanation: "",
    },
    {
      id: 28,
      question: "દલદલ કે પીટ પ્રકારની જમીન બાબતે નીચેના વિધાનો પૈકી કયું/કયા વિધાન સાચું/સાચા છે?\n1) આ પ્રકારની જમીન ભેજવાળા વિસ્તારમાં જૈવિક પદાર્થોના સંચયથી વિકસે છે.\n2) વર્ષાઋતુ દરમિયાન આ જમીન પાણીમાં ડૂબેલી હોય છે.\n3) પાણી ઓસરતા આ જમીનમાં ઘઉંની ખેતી કરવામાં આવે છે.\n4) આ જમીનનું ક્ષેત્ર અત્યંત મર્યાદિત વ્યાપ ધરાવે છે.",
      options: [
        "ફક્ત 1, 2 અને 4",
        "ફક્ત 2, 3 અને 4",
        "ફક્ત 3 અને 4",
        "આપેલ તમામ"
      ],
      correctAnswer: 0,
      explanation: "",
    },
    {
      id: 29,
      question: "પર્વતીય જમીન બાબતે નીચેના વિધાનો ધ્યાને લો.\n1) આ જમીનનું સ્તર પાતળું અને અપરિપકવ હોય છે.\n2) આ જમીન હિમાલયની ખીણો અને ઢોળાવનાં ક્ષેત્રોમાં 2700 મીટરથી 3000 મીટર સુધીની ઊંચાઈ પર જોવા મળે છે.\n3) હિમાલયના સામાન્ય ઊંચાઈના ભાગોમાં દેવદાર, ચીડ અને પાઈનના વૃક્ષોના વિસ્તારમાં આ જમીન જોવા મળે છે.\nઉપરોક્ત પૈકી ખોટા વિધાન જણાવો.",
      options: [
        "ફક્ત 1 અને 3",
        "ફક્ત 2",
        "ફક્ત 3",
        "એકપણ નહી"
      ],
      correctAnswer: 3,
      explanation: "",
    },
    {
      id: 30,
      question: "અસમ, દાર્જીલિંગ, ઉત્તરાખંડ, હિમાચલ પ્રદેશ અને કશ્મીરમાં નીચેનામાંથી કેવી જમીન જોવા મળે છે?",
      options: [
        "જંગલ પ્રકારની જમીન",
        "દલ દલ કે પીટ પ્રકારની જમીન",
        "રણ-પ્રકારની જમીન",
        "પર્વતીય જમીન"
      ],
      correctAnswer: 3,
      explanation: "",
    },
    {
      id: 31,
      question: "ગુજરાતના કયા વિસ્તારને 2008માં જૈવ આરક્ષિત ક્ષેત્ર તરીકે ઘોષિત કરાયો છે?",
      options: [
        "નળ સરોવરને",
        "ગીરને",
        "વેરાવદરને",
        "કચ્છના રણને"
      ],
      correctAnswer: 3,
      explanation: "",
    },
    {
      id: 32,
      question: "જંગલોના વર્ગીકરણના આધારે નીચેના વિધાનો ધ્યાને લો.\n1. અનામત જંગલ- સરકારી તંત્રના નિયંત્રણમાં હોય છે અને પશુપ્રવેશની મનાઈ હોય છે.\n2. સંરક્ષિત જંગલ- સરકારી તંત્રના નિયંત્રણમાં હોય છે અને લાકડા વિણવાની અને પશુચરણની સ્થાનિક લોકોને છૂટ હોય છે.",
      options: [
        "ફક્ત 1",
        "ફક્ત 2",
        "બંને",
        "એકપણ નહી"
      ],
      correctAnswer: 2,
      explanation: "",
    },
    {
      id: 33,
      question: "વન્યજીવ બાબતે નીચેના વિધાનોમાંથી કયું/કયાં વિધાન સાચું/સાચાં છે?\n1. વિશ્વમાં પશુ પંખીઓની 21 લાખ જેટલી પ્રજાતિઓ આવેલ છે.\n2. ભારત દેશમાં 81,251 જેટલી પ્રજાતિઓ જોવા મળે છે.\n3. જૈવ વિવિધતાની દ્રષ્ટિએ ભારત વિશ્વમાં 10માં ક્રમે છે.",
      options: [
        "ફક્ત 1 અને 2",
        "ફક્ત 2 અને 3",
        "ફક્ત 2",
        "એકપણ નહી"
      ],
      correctAnswer: 2,
      explanation: "",
    },
    {
      id: 34,
      question: "વન્યજીવ બાબતે નીચેના વિધાનો પૈકી કયું/કયાં વિધાન સાચું/સાચાં છે?\n1. તમિલનાડુના સમુદ્રકિનારાના રેતીના તટે સમુદ્રી કાચબાં-ઈંડા મુકવા આવે છે.\n2. દક્ષિણના ગીચ વર્ષાવનોમાં રાજનાગ જોવા મળે છે.",
      options: [
        "ફક્ત 1",
        "ફક્ત 2",
        "બંને",
        "એકપણ નહી"
      ],
      correctAnswer: 1,
      explanation: "",
    },
    {
      id: 35,
      question: "નીચેના જોડકા જોડો.\nઅ\n1. બિલાડી કુળનું પ્રાણી\n2. અભ્યારણ\n3. રાષ્ટ્રીય ઉદ્યાન\n4. જૈવ આરક્ષિત ક્ષેત્ર\nબ\nA. કાઝીરંગા\nB. ચંદ્રપ્રભા\nC. દિપડો\nD. કચ્છનું રણ",
      options: [
        "1-A, 2-B, 3-C, 4-D",
        "1-C, 2-B, 3-A, 4-D",
        "1-D, 2-C, 3-B, 4-A",
        "1-C, 2-B, 3-D, 4-A"
      ],
      correctAnswer: 1,
      explanation: "",
    },
    {
      id: 36,
      question: "ગુજરાતની કઈ નદીઓમાં જોવા મળતી જળ બિલાડી આજે જુજ માત્રામાં જોવા મળે છે?\n(1) નર્મદા (2) તાપી\n(3) મહી (4) સાબરમતી",
      options: [
        "ફક્ત 1, 2 અને 3",
        "ફક્ત 1",
        "ફક્ત 2 અને 4",
        "આપેલ તમામ"
      ],
      correctAnswer: 3,
      explanation: "",
    },
    {
      id: 37,
      question: "ઓડિસા, મેઘાલય, પંજાબ અને અરૂણાયલ પ્રદેશનાં પ્રદેશોમાં કયાં પ્રકારનાં જંગલોનું પ્રમાણ વિશેષ જોવા મળે છે?",
      options: [
        "ખાનગી",
        "જાહેર",
        "સામુદાયિક",
        "અનામત"
      ],
      correctAnswer: 0,
      explanation: "",
    },
    {
      id: 38,
      question: "લાલ પાંડા બાબતે નીચેના વિધાનો ધ્યાને લો.\n1) ભારતના પૂર્વ હિમાલયના શીત વનોમાં જોવા મળે છે.\n2) તેમનો ખોરાક કૂંપળો, ઈંડા નાના પક્ષીઓ અને જંતુઓ છે.\n3) આ પ્રાણી દિવસ દરમિયાન જ સક્રિય રહે છે.\nઉપરોક્ત પૈકી ખોટા વિધાન જણાવો.",
      options: [
        "ફક્ત 1 અને 2",
        "ફક્ત 2",
        "ફક્ત 3",
        "આપેલ તમામ"
      ],
      correctAnswer: 2,
      explanation: "",
    },
    {
      id: 39,
      question: "દીપડા બાબતે નીચેના વિધાનો પૈકી કયું/કયાં વિધાન સાચું/સાચાં છે?\n1) દીપડા એ બિલાડી કુળનો છે સિંહ અને વાઘની તુલનામાં નાનું કદ ધરાવે છે.\n2) ગુજરાતના જંગલોમાં તે મોટી સંખ્યામાં છે.\n3) તેની વસ્તી ભારતમાં જોવા મળે છે તે સંપૂર્ણ કાળા રંગના પણ જોવા મળે છે.",
      options: [
        "ફક્ત 1 અને 3",
        "ફક્ત 2 અને 3",
        "ફક્ત 3",
        "આપેલ તમામ"
      ],
      correctAnswer: 3,
      explanation: "",
    },
    {
      id: 40,
      question: "ગીધ બાબતે નીચેના વિધાનો પૈકી કયું /કયાં સાચું/સાચાં છે?\n1) તેને કુદરતના સફાઈ કામદાર કહેવામાં આવે છે.\n2) ભારતમાં ગીધની કુલ 3 પ્રજાતિઓ જોવા મળે છે.\n3) વર્ષ 2004માં ભારત સરકાર દ્વારા ગીધ પરીયોજના શરૂ કરાઈ હતી.",
      options: [
        "ફક્ત 1 અને 3",
        "ફક્ત 2 અને 3",
        "ફક્ત 2",
        "આપેલ તમામ"
      ],
      correctAnswer: 0,
      explanation: "",
    }
  ]
};
